Repository: python/python-docs-id
Catalog: python-newest.bugs/*.po
Languages: id

source: Dealing with Bugs
id: Berurusan dengan Bugs

source: Python is a mature programming language which has established a reputation for stability. In order to maintain this reputation, the developers would like to know of any deficiencies you find in Python.
id: Python adalah bahasa pemrograman matang yang telah membangun reputasi stabilitas. Untuk mempertahankan reputasi ini, pengembang ingin mengetahui kekurangan apa yang ada temukan di Python.

source: It can be sometimes faster to fix bugs yourself and contribute patches to Python as it streamlines the process and involves less people. Learn how to :ref:`contribute <contributing-to-python>`.
id: Terkadang lebih cepat untuk memperbaiki bugs oleh Anda kemudian menyumbangkan patch ke Python karena menyederhanakan proses dan melibatkan lebih sedikit orang. Pelajari caranya :ref:`contribute <contributing-to-python>`.

source: Documentation bugs
id: Dokumentasi *bugs*

source: If you find a bug in this documentation or would like to propose an improvement, please submit a bug report on the :ref:`tracker <using-the-tracker>`. If you have a suggestion on how to fix it, include that as well.
id: Jika Anda menemukan *bug* di dalam dokumentasi atau berkeinginan untuk mengusulkan sebuah perbaikan, mohon untuk mengajukan sebuah laporan tentang bug di dalam :ref:`tracker <using-the-tracker>`. Jika Anda memiliki sebuah saran bagaimana cara untuk memperbaikinya, lampirkan juga.

source: If you're short on time, you can also email documentation bug reports to docs@python.org (behavioral bugs can be sent to python-list@python.org). 'docs@' is a mailing list run by volunteers; your request will be noticed, though it may take a while to be processed.
id: Jika Anda tidak punya waktu, Anda juga dapat mengirim email laporan dokumentasi bug ke docs@python.org (perilaku bugs juga dapat dikirim ke python-list@python.org). 'docs@' adalah milis yang dijalankan oleh sukarelawan; permintaan Anda akan diperhatikan, meskipun mungkin perlu waktu beberapa saat untuk diproses.

source: `Documentation bugs`_
id: `Dokumentasi *bugs*`_

source: A list of documentation bugs that have been submitted to the Python issue tracker.
id: Daftar dokumentasi *bugs* yang telah dikirimkan ke pelacak isu *issue tracker* Python.

source: Overview of the process involved in reporting an improvement on the tracker.
id: Tinjauan dari proses yang terlibat dalam pelaporan perbaikan pada pelacak.

source: `Helping with Documentation <https://devguide.python.org/docquality/#helping-with-documentation>`_
id: `Membantu dengan Dokumentasi <https://devguide.python.org/docquality/#helping-with-documentation>`_

source: Comprehensive guide for individuals that are interested in contributing to Python documentation.
id: Panduan komprehensif untuk pribadi yang tertarik untuk berkontribusi dalam dokumentasi Python.

source: Using the Python issue tracker
id: Menggunakan pelacak isu Python

source: Bug reports for Python itself should be submitted via the Python Bug Tracker (https://bugs.python.org/). The bug tracker offers a Web form which allows pertinent information to be entered and submitted to the developers.
id: Laporan bug untuk Python perlu dikirimkan melalui pelacak Bug Python (https://bugs.python.org/). Pelacak bug menyediakan sebuah formulir Web dimana informasi terkait dapat dimasukkan kemudian dikirimkan ke pengembang.

source: The first step in filing a report is to determine whether the problem has already been reported. The advantage in doing so, aside from saving the developers time, is that you learn what has been done to fix it; it may be that the problem has already been fixed for the next release, or additional information is needed (in which case you are welcome to provide it if you can!). To do this, search the bug database using the search box on the top of the page.
id: Langkah pertama mengarsipkan laporan adalah mengecek apakah masalah telah dilaporkan. Keuntungan dari melakukan hal tersebut, selain menghemat waktu pengembang, adalah bahwa Anda telah mempelajari apakah masalah telah diperbaiki; mungkin masalah telah diperbaiki untuk rilis berikutnya, atau dibutuhkan tambahan informasi (dalam hal ini Anda dipersilahkan untuk menyertakan yang Anda bisa!). Untuk melakukan ini, cari di basis data bug menggunakan kotak pencarian di bagian atas halaman.

source: If the problem you're reporting is not already in the bug tracker, go back to the Python Bug Tracker and log in. If you don't already have a tracker account, select the "Register" link or, if you use OpenID, one of the OpenID provider logos in the sidebar. It is not possible to submit a bug report anonymously.
id: Jika masalah yang anda laporkan belum ada di pelacak bug, kembali ke pelacak bug Python dan masuk. Jika Anda belum memiliki akun pelacak, pilih tautan "Register", atau jika Anda menggunakan OpenID, pilih salah satu logo penyedia OpenID di menu samping. Tidak mungkin mengirimkan laporan bug secara anonim.

source: Being now logged in, you can submit a bug. Select the "Create New" link in the sidebar to open the bug reporting form.
id: Saat sudah masuk, Anda bisa mengirimkan *bug*. Pilih tautan "Create New" di menu samping untuk membuka formulir laporan *bug*.

source: The submission form has a number of fields. For the "Title" field, enter a *very* short description of the problem; less than ten words is good. In the "Type" field, select the type of your problem; also select the "Component" and "Versions" to which the bug relates.
id: Formulir pengiriman memiliki sejumlah area. Untuk area "Title", masukkan deskripsi *sangat* singkat dari permasalahan; baiknya kurang dari 10 kata. Di area "Type", pilih jenis masalah; juga pilih "Component" dan "Versions" dimana terkait bug.

source: In the "Comment" field, describe the problem in detail, including what you expected to happen and what did happen. Be sure to include whether any extension modules were involved, and what hardware and software platform you were using (including version information as appropriate).
id: Di area "Comment", deskripsikan masalah dengan detil, termasuk apa yang Anda harapkan terjadi dan apa yang saat ini terjadi. Pastikan untuk menyertakan apakah ada modul ekstensi yang terkait, dan platform perangkat keras serta perangkat lunak yang digunakan (termasuk info versi yang sesuai).

source: Each bug report will be assigned to a developer who will determine what needs to be done to correct the problem. You will receive an update each time action is taken on the bug.
id: Setiap laporan bug akan diberikan kepada pengembang yang akan menentukan apa yang perlu dilakukan untuk memperbaiki masalah. Anda akan menerima pembaruan setiap saat ada tindakan pada bug.

source: `How to Report Bugs Effectively <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_
id: `Bagaimana Melaporkan Bug Secara Efektif <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_

source: Article which goes into some detail about how to create a useful bug report. This describes what kind of information is useful and why it is useful.
id: Artikel yang menyantumkan sejumlah detil tentang bagaimana membuat laporan bug yang berguna. Menjelaskan tentang sejumlah informasi yang berguna dan mengapa hal tersebut berguna.

source: `Bug Report Writing Guidelines <https://developer.mozilla.org/en-US/docs/Mozilla/QA/Bug_writing_guidelines>`_
id: `Pendoman Pelaporan Bug <https://developer.mozilla.org/en-US/docs/Mozilla/QA/Bug_writing_guidelines>`_

source: Information about writing a good bug report. Some of this is specific to the Mozilla project, but describes general good practices.
id: Informasi tentang menulis laporan bug yang baik. Beberapa di antaranya khusus untuk proyek Mozilla, tapi secara umum menjelaskan praktik yang baik.

source: Getting started contributing to Python yourself
id: Mulai berkontribusi untuk Python

source: Beyond just reporting bugs that you find, you are also welcome to submit patches to fix them. You can find more information on how to get started patching Python in the `Python Developer's Guide`_. If you have questions, the `core-mentorship mailing list`_ is a friendly place to get answers to any and all questions pertaining to the process of fixing issues in Python.
id: Selain hanya melaporkan bugs yang Anda temukan, anda juga dipersilahkan mengirim patch untuk memperbaikinya. Anda dapat menemukan informasi lebih lanjut mengenai bagaimana memulai memperbaiki Python di `Panduan Pengembang Python`_. Jika Anda punya pertanyaan-pertanyaan, `milis core-mentorship`_ adalah tempat yang ramah untuk mendapatkan jawaban atas semua pertanyaan terkait proses memperbaiki masalah di Python.
