Repository: python/python-docs-id
Catalog: tutorial/controlflow.po
Languages: id

source: and of course it would print:
id: dan tentu saja itu akan mencetak:

source: Note that the order in which the keyword arguments are printed is guaranteed to match the order in which they were provided in the function call.
id: Perhatikan bahwa bagaimana urutan argumen kata kunci dicetak telah dijamin sesuai dengan urutan yang disediakan dalam pemanggilan fungsi.

source: Special parameters
id: Parameter spesial

source: By default, arguments may be passed to a Python function either by position or explicitly by keyword. For readability and performance, it makes sense to restrict the way arguments can be passed so that a developer need only look at the function definition to determine if items are passed by position, by position or keyword, or by keyword.
id: Secara bawaan, argumen dapat diteruskan ke fungsi Python baik dengan posisi atau secara eksplisit oleh kata kunci. Untuk keterbacaan dan kinerja, masuk akal untuk membatasi cara argumen dapat dilewatkan sehingga pengembang hanya perlu melihat definisi fungsi untuk menentukan apakah item dilewatkan secara posisi saja, posisi atau kata kunci, atau kata kunci saja.

source: A function definition may look like:
id: Definisi fungsi mungkin terlihat seperti:

source: where ``/`` and ``*`` are optional. If used, these symbols indicate the kind of parameter by how the arguments may be passed to the function: positional-only, positional-or-keyword, and keyword-only. Keyword parameters are also referred to as named parameters.
id: di mana ``/`` dan ``*`` adalah opsional. Jika digunakan, simbol-simbol ini menunjukkan jenis parameter dengan cara argumen dilewatkan ke fungsi: posisi-saja, posisi-atau-kata kunci, dan kata kunci-saja. Parameter kata kunci juga disebut sebagai parameter bernama.

source: Positional-or-Keyword Arguments
id: Argumen Posisi-atau-Kata Kunci

source: If ``/`` and ``*`` are not present in the function definition, arguments may be passed to a function by position or by keyword.
id: Jika ``/`` dan ``*`` tidak ada dalam definisi fungsi, argumen dapat diteruskan ke fungsi dengan posisi atau kata kunci.

source: Positional-Only Parameters
id: Parameter Posisi-saja

source: Looking at this in a bit more detail, it is possible to mark certain parameters as *positional-only*. If *positional-only*, the parameters' order matters, and the parameters cannot be passed by keyword. Positional-only parameters are placed before a ``/`` (forward-slash). The ``/`` is used to logically separate the positional-only parameters from the rest of the parameters. If there is no ``/`` in the function definition, there are no positional-only parameters.
id: Melihat ini sedikit lebih detail, dimungkinkan untuk menandai parameter tertentu sebagai *positional-only*. Jika *positional-only*, urutan parameter penting, dan parameter tidak dapat dilewatkan dengan kata kunci. Parameter posisi-saja ditempatkan sebelum ``/`` (garis miring). ``/`` Digunakan untuk secara logis memisahkan parameter posisi-saja dari parameter lainnya. Jika tidak ada ``/`` dalam definisi fungsi, tidak ada parameter posisi-saja.

source: Parameters following the ``/`` may be *positional-or-keyword* or *keyword-only*.
id: Parameter yang mengikuti ``/`` dapat berupa *positional-or-keyword* atau *keyword-only*.

source: Keyword-Only Arguments
id: Argumen Kata Kunci-saja

source: To mark parameters as *keyword-only*, indicating the parameters must be passed by keyword argument, place an ``*`` in the arguments list just before the first *keyword-only* parameter.
id: Untuk menandai parameter sebagai *keyword-only*, yang menunjukkan parameter harus dilewatkan dengan argumen kata kunci, tempatkan ``*`` dalam daftar argumen tepat sebelum parameter *keyword-only*.

source: Function Examples
id: Contoh Fungsi

source: Consider the following example function definitions paying close attention to the markers ``/`` and ``*``::
id: Perhatikan definisi fungsi contoh berikut dengan memperhatikan marker ``/`` dan ``*``::

source: The first function definition, ``standard_arg``, the most familiar form, places no restrictions on the calling convention and arguments may be passed by position or keyword::
id: Definisi fungsi pertama, ``standard_arg``, bentuk yang paling akrab, tidak menempatkan batasan pada konvensi pemanggilan dan argumen dapat dilewatkan dengan posisi atau kata kunci::

source: The second function ``pos_only_arg`` is restricted to only use positional parameters as there is a ``/`` in the function definition::
id: Fungsi kedua ``pos_only_arg`` dibatasi hanya menggunakan parameter posisi karena ada ``/`` dalam definisi fungsi::

source: The third function ``kwd_only_args`` only allows keyword arguments as indicated by a ``*`` in the function definition::
id: Fungsi ketiga ``kwd_only_args`` hanya memungkinkan argumen kata kunci *keyword argument* seperti ditunjukkan oleh ``*`` dalam definisi fungsi::

source: And the last uses all three calling conventions in the same function definition::
id: Dan yang terakhir menggunakan ketiga konvensi pemanggilan dalam definisi fungsi yang sama::

source: Finally, consider this function definition which has a potential collision between the positional argument ``name`` and ``**kwds`` which has ``name`` as a key::
id: Akhirnya, pertimbangkan definisi fungsi ini yang memiliki potensi tabrakan antara argumen posisi ``name`` dan ``**kwds`` yang memiliki ``name`` sebagai kunci::

source: There is no possible call that will make it return ``True`` as the keyword ``'name'`` will always bind to the first parameter. For example::
id: Tidak ada kemungkinan panggilan yang memungkinkan untuk mengembalikan ke dalam ``True'' karena kata kunci `` 'nama' 'akan selalu terikat ke parameter pertama. Sebagai contoh::

source: But using ``/`` (positional only arguments), it is possible since it allows ``name`` as a positional argument and ``'name'`` as a key in the keyword arguments::
id: Tetapi menggunakan ``/`` (argumen posisi saja), ini dimungkinkan karena memungkinkan ``name`` sebagai argumen posisi dan ``'name'`` sebagai kunci dalam argumen kata kunci *keyword argument*::

source: In other words, the names of positional-only parameters can be used in ``**kwds`` without ambiguity.
id: Dengan kata lain, nama-nama parameter posisi-saja dapat digunakan dalam ``**kwds`` tanpa ambiguitas.

source: Recap
id: Rekap

source: The use case will determine which parameters to use in the function definition::
id: Contoh kasus dimana akan menentukan parameter mana yang akan digunakan dalam definisi fungsi::

source: As guidance:
id: Sebagai pedoman:

source: Use positional-only if you want the name of the parameters to not be available to the user. This is useful when parameter names have no real meaning, if you want to enforce the order of the arguments when the function is called or if you need to take some positional parameters and arbitrary keywords.
id: Gunakan posisi-saja jika Anda ingin nama parameter tidak tersedia bagi pengguna. Ini berguna ketika nama parameter tidak memiliki arti nyata, jika Anda ingin menegakkan urutan argumen ketika fungsi dipanggil atau jika Anda perlu mengambil beberapa parameter posisi dan kata kunci bergantian *arbitrary*.

source: Use keyword-only when names have meaning and the function definition is more understandable by being explicit with names or you want to prevent users relying on the position of the argument being passed.
id: Gunakan kata kunci-saja ketika nama memiliki makna dan definisi fungsi lebih mudah dipahami dengan secara eksplisit menggunakan nama atau Anda ingin mencegah pengguna mengandalkan posisi argumen yang dikirimkan.

source: For an API, use positional-only to prevent breaking API changes if the parameter's name is modified in the future.
id: Untuk API, gunakan posisi-saja untuk mencegah perubahan yang merusak dari API jika nama parameter diubah di masa mendatang.

source: Arbitrary Argument Lists
id: Daftar Argumen Berubah-ubah *Arbitrary*

source: Finally, the least frequently used option is to specify that a function can be called with an arbitrary number of arguments. These arguments will be wrapped up in a tuple (see :ref:`tut-tuples`). Before the variable number of arguments, zero or more normal arguments may occur. ::
id: Akhirnya, opsi yang paling jarang digunakan adalah menentukan bahwa suatu fungsi dapat dipanggil dengan sejumlah argumen acak *arbitrary*. Argumen-argumen ini akan dibungkus dalam sebuah tuple (lihat :ref:`tuttuples`). Sebelum jumlah variabel argumen, nol atau lebih argumen normal dapat muncul. ::

source: Normally, these ``variadic`` arguments will be last in the list of formal parameters, because they scoop up all remaining input arguments that are passed to the function. Any formal parameters which occur after the ``*args`` parameter are 'keyword-only' arguments, meaning that they can only be used as keywords rather than positional arguments. ::
id: Biasanya, argumen ``variadic`` ini akan menjadi yang terakhir dalam daftar parameter formal, karena mereka mengambil semua argumen masukan yang tersisa yang diteruskan ke fungsi. Parameter formal apa pun yang muncul setelah parameter ``*args`` adalah argumen 'keyword-only', yang berarti bahwa parameter itu hanya dapat digunakan sebagai kata kunci alih-alih argumen posisi. ::

source: Unpacking Argument Lists
id: Pembukaan Paket *Unpacking* Daftar Argumen

source: The reverse situation occurs when the arguments are already in a list or tuple but need to be unpacked for a function call requiring separate positional arguments. For instance, the built-in :func:`range` function expects separate *start* and *stop* arguments. If they are not available separately, write the function call with the ``*``\ -operator to unpack the arguments out of a list or tuple::
id: Situasi sebaliknya terjadi ketika argumen sudah ada dalam daftar *list* atau tuple tetapi perlu dibongkar untuk panggilan fungsi yang membutuhkan argumen posisi terpisah. Sebagai contoh, fungsi bawaan :func:`range` mengharapkan argumen terpisah *start* dan *stop*. Jika tidak tersedia secara terpisah, tulis fungsi panggilan dengan operator\-``*`` untuk membongkar argumen dari daftar *list* atau tuple::

source: In the same fashion, dictionaries can deliver keyword arguments with the ``**``\ -operator::
id: Dengan cara yang sama, kamus dapat mengirimkan argumen kata kunci dengan operator\-``**``::

source: Lambda Expressions
id: Ekspresi Lambda

source: Small anonymous functions can be created with the :keyword:`lambda` keyword. This function returns the sum of its two arguments: ``lambda a, b: a+b``. Lambda functions can be used wherever function objects are required. They are syntactically restricted to a single expression. Semantically, they are just syntactic sugar for a normal function definition. Like nested function definitions, lambda functions can reference variables from the containing scope::
id: Fungsi kecil anonim dapat dibuat dengan kata kunci :keyword:`lambda`. Fungsi ini mengembalikan jumlah dari dua argumennya: ``lambda a, b: a+b``. Fungsi Lambda dapat digunakan di mana pun objek fungsi diperlukan. Mereka secara sintaksis terbatas pada satu ekspresi. Secara semantik, mereka hanya pemanis sintaksis untuk definisi fungsi normal. Seperti definisi fungsi bersarang, fungsi lambda dapat mereferensikan variabel dari cakupan yang mengandung ::

source: The above example uses a lambda expression to return a function. Another use is to pass a small function as an argument::
id: Contoh di atas menggunakan ekspresi lambda untuk mengembalikan fungsi. Penggunaan lain adalah untuk melewatkan fungsi kecil sebagai argumen::

source: Documentation Strings
id: String Dokumentasi

source: Here are some conventions about the content and formatting of documentation strings.
id: Berikut adalah beberapa konvensi tentang konten dan format string dokumentasi.

source: The first line should always be a short, concise summary of the object's purpose. For brevity, it should not explicitly state the object's name or type, since these are available by other means (except if the name happens to be a verb describing a function's operation). This line should begin with a capital letter and end with a period.
id: Baris pertama harus selalu berupa ringkasan singkat dan ringkas dari tujuan objek. Untuk singkatnya, itu tidak boleh secara eksplisit menyatakan nama atau jenis objek, karena ini tersedia dengan cara lain (kecuali jika nama tersebut merupakan kata kerja yang menggambarkan operasi fungsi). Baris ini harus dimulai dengan huruf kapital dan diakhiri dengan titik.

source: If there are more lines in the documentation string, the second line should be blank, visually separating the summary from the rest of the description. The following lines should be one or more paragraphs describing the object's calling conventions, its side effects, etc.
id: Jika ada lebih banyak baris dalam string dokumentasi, baris kedua harus kosong, memisahkan ringkasan secara visual dari sisa deskripsi. Baris berikut harus satu atau lebih paragraf yang menggambarkan konvensi pemanggilan objek, efek sampingnya, dll.

source: The Python parser does not strip indentation from multi-line string literals in Python, so tools that process documentation have to strip indentation if desired. This is done using the following convention. The first non-blank line *after* the first line of the string determines the amount of indentation for the entire documentation string. (We can't use the first line since it is generally adjacent to the string's opening quotes so its indentation is not apparent in the string literal.) Whitespace "equivalent" to this indentation is then stripped from the start of all lines of the string. Lines that are indented less should not occur, but if they occur all their leading whitespace should be stripped. Equivalence of whitespace should be tested after expansion of tabs (to 8 spaces, normally).
id: Pengurai Python tidak menghapus lekukan dari string multi-baris literal di Python, jadi alat yang memproses dokumentasi harus menghapus indentasi jika diinginkan. Ini dilakukan dengan menggunakan konvensi berikut. Baris tidak-kosong pertama *setelah* baris pertama string menentukan jumlah indentasi untuk seluruh string dokumentasi. (Kami tidak dapat menggunakan baris pertama karena umumnya berbatasan dengan tanda kutip pembukaan string sehingga indentasinya tidak terlihat dalam string literal.) Spasi "equivalent" untuk indentasi ini kemudian dihilangkan dari awal semua baris string. Baris yang indentasi lebih sedikit seharusnya tidak terjadi, tetapi jika terjadi semua spasi *whitespace* utama harus dihilangkan. Kesetaraan spasi harus diuji setelah ekspansi tab (hingga 8 spasi, biasanya).

source: Here is an example of a multi-line docstring::
id: Berikut adalah contoh dari multi-baris *docstring*::

source: Function Annotations
id: Anotasi Fungsi

source: :ref:`Function annotations <function>` are completely optional metadata information about the types used by user-defined functions (see :pep:`3107` and :pep:`484` for more information).
id: :ref:`Function annotations <function>` informasi metadata yang sepenuhnya opsional tentang jenis yang digunakan oleh fungsi yang ditentukan pengguna (lihat :pep:`3107` dan :pep:`484` untuk informasi lebih lanjut).

source: :term:`Annotations <function annotation>` are stored in the :attr:`__annotations__` attribute of the function as a dictionary and have no effect on any other part of the function. Parameter annotations are defined by a colon after the parameter name, followed by an expression evaluating to the value of the annotation. Return annotations are defined by a literal ``->``, followed by an expression, between the parameter list and the colon denoting the end of the :keyword:`def` statement. The following example has a positional argument, a keyword argument, and the return value annotated::
id: :term:`Annotations <function annotation>` disimpan dalam atribut :attr:`__annotations__` dari fungsi sebagai kamus *dictionary* dan tidak berpengaruh pada bagian fungsi yang lain. Anotasi parameter didefinisikan oleh titik dua setelah nama parameter, diikuti oleh ekspresi yang mengevaluasi nilai anotasi. Anotasi pengembalian didefinisikan oleh literal ``->``, diikuti oleh ekspresi, antara daftar parameter dan titik dua yang menunjukkan akhir dari pernyataan :keyword:`def`. Contoh berikut memiliki argumen posisi, argumen kata kunci *keyword argument*, dan nilai kembalian yang dianotasi ::

source: Intermezzo: Coding Style
id: Intermezzo: Gaya *Coding*

source: Now that you are about to write longer, more complex pieces of Python, it is a good time to talk about *coding style*. Most languages can be written (or more concise, *formatted*) in different styles; some are more readable than others. Making it easy for others to read your code is always a good idea, and adopting a nice coding style helps tremendously for that.
id: Sekarang Anda akan menulis potongan Python yang lebih panjang dan lebih kompleks, ini adalah saat yang tepat untuk berbicara tentang *coding style*. Sebagian besar bahasa dapat ditulis (atau lebih ringkas, *formatted*) dalam gaya yang berbeda; beberapa lebih mudah dibaca daripada yang lain. Memudahkan orang lain untuk membaca kode Anda selalu merupakan ide yang baik, dan mengadopsi gaya pengkodean yang bagus sangat membantu untuk itu.

source: For Python, :pep:`8` has emerged as the style guide that most projects adhere to; it promotes a very readable and eye-pleasing coding style. Every Python developer should read it at some point; here are the most important points extracted for you:
id: Untuk Python, :pep:`8` telah muncul sebagai panduan gaya yang dipatuhi sebagian besar proyek; itu mempromosikan gaya pengkodean yang sangat mudah dibaca dan menyenangkan. Setiap pengembang Python harus membacanya di beberapa bagian; di sini adalah poin paling penting yang ditunjukkan untuk Anda:

source: Use 4-space indentation, and no tabs.
id: Gunakan lekukan 4-spasi, dan tanpa tab.

source: 4 spaces are a good compromise between small indentation (allows greater nesting depth) and large indentation (easier to read). Tabs introduce confusion, and are best left out.
id: 4 spasi adalah kompromi yang baik antara indentasi kecil (memungkinkan kedalaman bersarang lebih besar) dan indentasi besar (lebih mudah dibaca). Tab menimbulkan kebingungan, dan sebaiknya ditinggalkan.

source: Wrap lines so that they don't exceed 79 characters.
id: Bungkus *wrap* garis agar tidak melebihi 79 karakter.

source: This helps users with small displays and makes it possible to have several code files side-by-side on larger displays.
id: Ini membantu pengguna dengan tampilan kecil dan memungkinkan untuk memiliki beberapa file kode berdampingan pada tampilan yang lebih besar.

source: Use blank lines to separate functions and classes, and larger blocks of code inside functions.
id: Gunakan baris kosong untuk memisahkan fungsi dan kelas, dan blok kode yang lebih besar di dalam fungsi.

source: When possible, put comments on a line of their own.
id: Jika memungkinkan, berikan komentar pada baris terkait.

source: Use docstrings.
id: Gunakan String Dokumentasi *docstrings*.

source: Use spaces around operators and after commas, but not directly inside bracketing constructs: ``a = f(1, 2) + g(3, 4)``.
id: Gunakan spasi di sekitar operator dan setelah koma, tetapi tidak secara langsung di dalam konstruksi kurung *bracketing*: ``a = f(1, 2) + g(3, 4)``.

source: Name your classes and functions consistently; the convention is to use ``UpperCamelCase`` for classes and ``lowercase_with_underscores`` for functions and methods. Always use ``self`` as the name for the first method argument (see :ref:`tut-firstclasses` for more on classes and methods).
id: Beri nama kelas dan fungsi Anda secara konsisten; konvensi ini menggunakan ``UpperCamelCase`` untuk kelas dan ``lowercase_with_underscores`` untuk fungsi dan metode. Selalu gunakan ``self`` sebagai nama untuk argumen metode pertama (lihat :ref:`tut-firstclass` untuk lebih lanjut tentang kelas dan metode).

source: Don't use fancy encodings if your code is meant to be used in international environments. Python's default, UTF-8, or even plain ASCII work best in any case.
id: Jangan gunakan pengkodean ajaib *fancy encodings* jika kode Anda dimaksudkan untuk digunakan di lingkungan internasional. Default Python, UTF-8, atau bahkan ASCII biasa berfungsi paling baik dalam hal apa pun.

source: Likewise, don't use non-ASCII characters in identifiers if there is only the slightest chance people speaking a different language will read or maintain the code.
id: Demikian juga, jangan gunakan karakter non-ASCII dalam pengidentifikasi jika hanya ada sedikit kesempatan orang berbicara bahasa yang berbeda akan membaca atau merawat kode.

source: Footnotes
id: Catatan kaki

source: Actually, *call by object reference* would be a better description, since if a mutable object is passed, the caller will see any changes the callee makes to it (items inserted into a list).
id: Sebenarnya, *call by object reference* akan menjadi deskripsi yang lebih baik, karena jika objek yang bisa ditransmisikan dilewatkan, pemanggil akan melihat perubahan yang dibuat oleh yang dipanggil *callee* (item dimasukkan ke dalam daftar).
