Repository: python/python-docs-id
Catalog: tutorial/controlflow.po
Languages: id

source: More Control Flow Tools
id: Lebih Banyak Alat Pengatur Aliran *Control Flow*

source: Besides the :keyword:`while` statement just introduced, Python uses the usual flow control statements known from other languages, with some twists.
id: Selain pernyataan :keyword:`while` baru saja diperkenalkan, Python menggunakan pernyataan kontrol aliran yang biasa dikenal dari bahasa lain, dengan beberapa *twist*.

source: :keyword:`!if` Statements
id: Pernyataan :keyword:`!if`

source: Perhaps the most well-known statement type is the :keyword:`if` statement. For example::
id: Mungkin tipe pernyataan yang paling terkenal adalah pernyataan :keyword:`if`. Sebagai contoh::

source: There can be zero or more :keyword:`elif` parts, and the :keyword:`else` part is optional. The keyword ':keyword:`!elif`' is short for 'else if', and is useful to avoid excessive indentation. An :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... sequence is a substitute for the ``switch`` or ``case`` statements found in other languages.
id: Mungkin ada nol atau lebih bagian :keyword:`elif`, dan bagian :keyword:`else` adalah opsional. Kata kunci ':keyword:`!elif`' adalah kependekan dari 'else if', dan berguna untuk menghindari indentasi yang berlebihan. Sebuah :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... adalah urutan pengganti untuk pernyataan ``switch`` atau ``case`` yang ditemukan dalam bahasa lain.

source: :keyword:`!for` Statements
id: Pernyataan :keyword:`!for`

source: The :keyword:`for` statement in Python differs a bit from what you may be used to in C or Pascal. Rather than always iterating over an arithmetic progression of numbers (like in Pascal), or giving the user the ability to define both the iteration step and halting condition (as C), Python's :keyword:`!for` statement iterates over the items of any sequence (a list or a string), in the order that they appear in the sequence. For example (no pun intended):
id: Pernyataan :keyword:`for` dalam Python sedikit berbeda dari apa yang mungkin Anda gunakan di C atau Pascal. Alih-alih selalu mengulangi perkembangan angka dalam aritmatika (seperti dalam Pascal), atau memberikan pengguna kemampuan untuk menentukan langkah iterasi dan kondisi berhenti (seperti C), Python pernyataan :keyword:`!for` diulangi pada item-item dari urutan apa pun (daftar *list* atau string), dalam urutan yang muncul dalam urutan. Misalnya (tidak ada permainan kata-kata):

source: Code that modifies a collection while iterating over that same collection can be tricky to get right. Instead, it is usually more straight-forward to loop over a copy of the collection or to create a new collection::
id: Kode yang memodifikasi koleksi *collection* sambil mengulangi koleksi yang sama bisa sulit untuk diperbaiki. Sebagai gantinya, biasanya lebih mudah untuk mengulang salinan koleksi atau membuat koleksi baru::

source: The :func:`range` Function
id: Fungsi :func:`range`

source: If you do need to iterate over a sequence of numbers, the built-in function :func:`range` comes in handy. It generates arithmetic progressions::
id: Jika Anda perlu mengulangi urutan angka, fungsi bawaan :func:`range` berguna. Ini menghasilkan urutan *pregressions* aritmatika::

source: The given end point is never part of the generated sequence; ``range(10)`` generates 10 values, the legal indices for items of a sequence of length 10. It is possible to let the range start at another number, or to specify a different increment (even negative; sometimes this is called the 'step')::
id: Titik akhir yang diberikan tidak pernah menjadi bagian dari urutan yang dihasilkan; ``range(10)`` menghasilkan 10 nilai, indeks sah *legal* untuk item dengan urutan panjang 10. Dimungkinkan untuk membiarkan rentang mulai dari nomor lain, atau untuk menentukan kenaikan yang berbeda (bahkan negatif; kadang-kadang ini disebut 'step')::

source: To iterate over the indices of a sequence, you can combine :func:`range` and :func:`len` as follows::
id: Untuk beralih pada indeks urutan, Anda dapat menggabungkan :func:`range` dan :func:`len` sebagai berikut::

source: In most such cases, however, it is convenient to use the :func:`enumerate` function, see :ref:`tut-loopidioms`.
id: Dalam kebanyakan kasus seperti itu, bagaimanapun, lebih mudah untuk menggunakan fungsi :func:`enumerate`, lihat :ref:`tut-loopidioms`.

source: A strange thing happens if you just print a range::
id: Hal aneh terjadi jika Anda hanya mencetak rentang *range*::

source: In many ways the object returned by :func:`range` behaves as if it is a list, but in fact it isn't. It is an object which returns the successive items of the desired sequence when you iterate over it, but it doesn't really make the list, thus saving space.
id: Dalam banyak hal objek dikembalikan oleh :func:`range` berperilaku seolah-olah itu adalah daftar *list*, tetapi sebenarnya tidak. Ini adalah objek yang mengembalikan item berurutan dari urutan yang diinginkan ketika Anda mengulanginya, tetapi itu tidak benar-benar membuat daftar *list*, sehingga menghemat ruang.

source: We say such an object is :term:`iterable`, that is, suitable as a target for functions and constructs that expect something from which they can obtain successive items until the supply is exhausted. We have seen that the :keyword:`for` statement is such a construct, while an example of a function that takes an iterable is :func:`sum`::
id: Kami mengatakan bahwa objek seperti itu adalah :term:`iterable`, yaitu, cocok sebagai target untuk fungsi dan konstruksi yang mengharapkan sesuatu dari mana mereka dapat memperoleh item berturut-turut sampai pasokan habis. Kita telah melihat bahwa pernyataan :keyword:`for` adalah konstruksi seperti itu, sedangkan contoh fungsi yang membutuhkan sebuah iterable adalah :func:`sum`::

source: Later we will see more functions that return iterables and take iterables as arguments. Lastly, maybe you are curious about how to get a list from a range. Here is the solution::
id: Nanti kita akan melihat lebih banyak fungsi yang mengembalikan *iterables* dan menganggap *iterables* sebagai argumen. Terakhir, mungkin Anda ingin tahu tentang cara mendapatkan daftar *list* dari suatu rentang *range*. Ini solusinya::

source: In chapter :ref:`tut-structures`, we will discuss in more detail about :func:`list`.
id: Dalam bab :ref:`tut-structure`, kita akan membahas lebih detail tentang :func:`list`.

source: :keyword:`!break` and :keyword:`!continue` Statements, and :keyword:`!else` Clauses on Loops
id: Pernyataan :keyword:`!break` dan :keyword:`!continue`, dan :keyword:`!else` Klausa pada Perulangan *Loops*

source: The :keyword:`break` statement, like in C, breaks out of the innermost enclosing :keyword:`for` or :keyword:`while` loop.
id: Pernyataan :keyword:`break`, seperti dalam C, keluar dari bagian terdalam yang terlampir perulangan :keyword:`for` atau :keyword:`while`.

source: Loop statements may have an :keyword:`!else` clause; it is executed when the loop terminates through exhaustion of the iterable (with :keyword:`for`) or when the condition becomes false (with :keyword:`while`), but not when the loop is terminated by a :keyword:`break` statement. This is exemplified by the following loop, which searches for prime numbers::
id: Pernyataan perulangan *loop* mungkin memiliki klausa :keyword:`!else`; itu dieksekusi ketika loop berakhir melalui selesainya *exhaustion* *iterable* (dengan :keyword:`for`) atau ketika kondisi menjadi salah (dengan :keyword:`while`), tetapi tidak ketika loop diakhiri oleh pernyataan :keyword:`break`. Ini dicontohkan oleh perulangan berikut, yang mencari bilangan prima::

source: (Yes, this is the correct code. Look closely: the ``else`` clause belongs to the :keyword:`for` loop, **not** the :keyword:`if` statement.)
id: (Ya, ini adalah kode yang benar. Perhatikan baik-baik: klausul ``else`` milik perulangan :keyword:`for`, **not** pernyataan :keyword:`if`.)

source: When used with a loop, the ``else`` clause has more in common with the ``else`` clause of a :keyword:`try` statement than it does with that of :keyword:`if` statements: a :keyword:`try` statement's ``else`` clause runs when no exception occurs, and a loop's ``else`` clause runs when no ``break`` occurs. For more on the :keyword:`!try` statement and exceptions, see :ref:`tut-handling`.
id: Ketika digunakan dengan sebuah perulangan, klausa ``else`` memiliki lebih banyak kesamaan dengan klausa ``else`` dari pernyataan :keyword:`try` dibandingkan dengan pernyataan :keyword:`if`: sebuah klausa ``else`` pernyataan :keyword:`try` berjalan ketika tidak ada pengecualian terjadi, dan klausa ``else`` perulangan berjalan ketika tidak ada ``break`` terjadi. Untuk lebih lanjut tentang pernyataan :keyword:`!try` dan pengecualian, lihat :ref:`tut-handling`.

source: The :keyword:`continue` statement, also borrowed from C, continues with the next iteration of the loop::
id: Pernyataan :keyword:`continue`, juga dipinjam dari C, melanjutkan dengan pengulangan berikutnya dari loop::

source: :keyword:`!pass` Statements
id: Pernyataan :keyword:`!pass`

source: The :keyword:`pass` statement does nothing. It can be used when a statement is required syntactically but the program requires no action. For example::
id: Pernyataan :keyword:`pass` tidak melakukan apa-apa. Ini dapat digunakan ketika pernyataan diperlukan secara sintaksis tetapi program tidak memerlukan tindakan. Sebagai contoh::

source: This is commonly used for creating minimal classes::
id: Ini biasanya digunakan untuk membuat kelas minimal::

source: Another place :keyword:`pass` can be used is as a place-holder for a function or conditional body when you are working on new code, allowing you to keep thinking at a more abstract level. The :keyword:`!pass` is silently ignored::
id: Tempat lain :keyword:`pass` dapat digunakan adalah sebagai tempat-penampung *place-holder* untuk fungsi atau badan bersyarat *conditional body* saat Anda bekerja pada kode baru, memungkinkan Anda untuk terus berpikir pada tingkat yang lebih abstrak. :keyword:`!pass` diabaikan secara diam-diam::

source: Defining Functions
id: Mendefinisikan Fungsi

source: We can create a function that writes the Fibonacci series to an arbitrary boundary::
id: Kita dapat membuat fungsi yang menulis seri Fibonacci ke batas acak *arbitrary*::

source: The keyword :keyword:`def` introduces a function *definition*. It must be followed by the function name and the parenthesized list of formal parameters. The statements that form the body of the function start at the next line, and must be indented.
id: Kata kunci :keyword:`def` memperkenalkan fungsi *definition*. Itu harus diikuti oleh nama fungsi dan daftar parameter formal yang di dalam tanda kurung. Pernyataan yang membentuk tubuh fungsi mulai dari baris berikutnya, dan harus diberi indentasi.

source: The first statement of the function body can optionally be a string literal; this string literal is the function's documentation string, or :dfn:`docstring`. (More about docstrings can be found in the section :ref:`tut-docstrings`.) There are tools which use docstrings to automatically produce online or printed documentation, or to let the user interactively browse through code; it's good practice to include docstrings in code that you write, so make a habit of it.
id: Pernyataan pertama dari tubuh fungsi secara opsional dapat berupa string literal; string literal ini adalah string dokumentasi fungsi, atau :dfn:`docstring`. (Lebih lanjut tentang *docstring* dapat ditemukan di bagian :ref:`tut-docstrings`.) Ada alat yang menggunakan *docstring* untuk secara otomatis menghasilkan dokumentasi online atau cetak, atau untuk membiarkan pengguna menelusuri kode secara interaktif; itu praktik yang baik untuk memasukkan dokumen dalam kode yang Anda tulis, jadi biasakan seperti itu.

source: The *execution* of a function introduces a new symbol table used for the local variables of the function. More precisely, all variable assignments in a function store the value in the local symbol table; whereas variable references first look in the local symbol table, then in the local symbol tables of enclosing functions, then in the global symbol table, and finally in the table of built-in names. Thus, global variables and variables of enclosing functions cannot be directly assigned a value within a function (unless, for global variables, named in a :keyword:`global` statement, or, for variables of enclosing functions, named in a :keyword:`nonlocal` statement), although they may be referenced.
id: *execution* dari suatu fungsi memperkenalkan tabel simbol baru yang digunakan untuk variabel lokal dari fungsi tersebut. Lebih tepatnya, semua tugas variabel dalam suatu fungsi menyimpan nilai dalam tabel simbol lokal; sedangkan referensi variabel pertama-tama terlihat pada tabel simbol lokal, kemudian pada tabel simbol lokal lampiran *enclosing* fungsi, kemudian pada tabel simbol global, dan akhirnya pada tabel nama bawaan. Dengan demikian, variabel global dan variabel lampiran *enclosing* fungsi tidak dapat secara langsung menetapkan nilai dalam suatu fungsi (kecuali, untuk variabel global, disebutkan dalam pernyataan :keyword:`global`, atau, untuk variabel lampiran *enclosing* fungsi, dinamai dalam pernyataan :keyword:`nonlocal`), meskipun mungkin direferensikan.

source: The actual parameters (arguments) to a function call are introduced in the local symbol table of the called function when it is called; thus, arguments are passed using *call by value* (where the *value* is always an object *reference*, not the value of the object). [#]_ When a function calls another function, a new local symbol table is created for that call.
id: Parameter aktual (*arguments*) untuk panggilan fungsi diperkenalkan dalam tabel simbol lokal dari fungsi yang dipanggil ketika dipanggil; dengan demikian, argumen dilewatkan menggunakan *call by value* (di mana *value* selalu menjadi objek *reference*, bukan nilai objek). [#]_ Ketika suatu fungsi memanggil fungsi lain, tabel simbol lokal baru dibuat untuk panggilan itu.

source: A function definition associates the function name with the function object in the current symbol table. The interpreter recognizes the object pointed to by that name as a user-defined function. Other names can also point to that same function object and can also be used to access the function::
id: Definisi fungsi mengasosiasikan nama fungsi dengan objek fungsi dalam tabel simbol saat ini. Sebuah interpreter dapat mengenali objek yang ditunjuk dengan nama itu sebagai fungsi yang ditentukan oleh pengguna. Nama lain juga dapat menunjuk ke objek fungsi yang sama dan juga dapat digunakan untuk mengakses fungsi tersebut::

source: Coming from other languages, you might object that ``fib`` is not a function but a procedure since it doesn't return a value. In fact, even functions without a :keyword:`return` statement do return a value, albeit a rather boring one. This value is called ``None`` (it's a built-in name). Writing the value ``None`` is normally suppressed by the interpreter if it would be the only value written. You can see it if you really want to using :func:`print`::
id: Berasal dari bahasa lain, Anda mungkin keberatan bahwa ``fib`` bukan fungsi melainkan prosedur karena tidak mengembalikan nilai. Bahkan, fungsi bahkan tanpa pernyataan :keyword:`return` mengembalikan nilai, meskipun yang agak membosankan. Nilai ini disebut ``None`` (ini adalah nama bawaan). Menulis nilai ``None`` biasanya dihilangkan *suppressed* oleh *interpreter* jika itu akan menjadi satu-satunya nilai yang ditulis. Anda dapat melihatnya jika Anda benar-benar ingin menggunakan :func:`print`::

source: It is simple to write a function that returns a list of the numbers of the Fibonacci series, instead of printing it::
id: Sangat mudah untuk menulis fungsi yang mengembalikan daftar *list* nomor seri Fibonacci, alih-alih mencetaknya::

source: This example, as usual, demonstrates some new Python features:
id: Contoh ini, seperti biasa, menunjukkan beberapa fitur Python baru:

source: The :keyword:`return` statement returns with a value from a function. :keyword:`!return` without an expression argument returns ``None``. Falling off the end of a function also returns ``None``.
id: Pernyataan :keyword:`return` kembali dengan nilai dari suatu fungsi. :keyword:`!return` tanpa argumen ekspresi mengembalikan ``None``. Keluar dari akhir suatu fungsi juga mengembalikan ``None``.

source: The statement ``result.append(a)`` calls a *method* of the list object ``result``. A method is a function that 'belongs' to an object and is named ``obj.methodname``, where ``obj`` is some object (this may be an expression), and ``methodname`` is the name of a method that is defined by the object's type. Different types define different methods. Methods of different types may have the same name without causing ambiguity. (It is possible to define your own object types and methods, using *classes*, see :ref:`tut-classes`) The method :meth:`append` shown in the example is defined for list objects; it adds a new element at the end of the list. In this example it is equivalent to ``result = result + [a]``, but more efficient.
id: Pernyataan ``result.append(a)`` memanggil *method* dari objek daftar *list* ``result``. Sebuah metode adalah fungsi yang 'milik' sebuah objek dan dinamai ``obj.methodname``, di mana ``obj`` adalah suatu objek (ini mungkin sebuah ekspresi), dan ``methodname`` adalah nama dari metode yang ditentukan oleh tipe objek. Jenis yang berbeda menentukan metode yang berbeda. Metode tipe yang berbeda mungkin memiliki nama yang sama tanpa menimbulkan ambiguitas. (Dimungkinkan untuk menentukan jenis dan metode objek Anda sendiri, menggunakan *classes*, lihat :ref:`tut-classes`) Metode :meth:`append` yang ditunjukkan pada contoh didefinisikan untuk objek daftar; itu menambahkan elemen baru di akhir daftar. Dalam contoh ini setara dengan ``result = result + [a]``, tetapi lebih efisien.

source: More on Defining Functions
id: Lebih lanjut tentang Mendefinisikan Fungsi

source: It is also possible to define functions with a variable number of arguments. There are three forms, which can be combined.
id: Dimungkinkan juga untuk mendefinisikan fungsi dengan sejumlah variabel argumen. Ada tiga bentuk, yang bisa digabungkan.

source: Default Argument Values
id: Nilai Argumen Bawaan

source: The most useful form is to specify a default value for one or more arguments. This creates a function that can be called with fewer arguments than it is defined to allow. For example::
id: Bentuk yang paling berguna adalah menentukan nilai bawaan untuk satu atau lebih argumen. Ini menciptakan fungsi yang bisa dipanggil dengan argumen yang lebih sedikit daripada yang didefinisikan untuk diizinkan. Sebagai contoh::

source: This function can be called in several ways:
id: Fungsi ini dapat dipanggil dengan beberapa cara:

source: giving only the mandatory argument: ``ask_ok('Do you really want to quit?')``
id: hanya memberikan argumen wajib: ``ask_ok('Do you really want to quit?')``

source: giving one of the optional arguments: ``ask_ok('OK to overwrite the file?', 2)``
id: memberikan salah satu argumen opsional: ``ask_ok('OK to overwrite the file?', 2)``

source: or even giving all arguments: ``ask_ok('OK to overwrite the file?', 2, 'Come on, only yes or no!')``
id: atau bahkan memberikan semua argumen: ``ask_ok('OK to overwrite the file?', 2, 'Come on, only yes or no!')``

source: This example also introduces the :keyword:`in` keyword. This tests whether or not a sequence contains a certain value.
id: Contoh ini juga memperkenalkan kata kunci :keyword:`in`. Ini menguji apakah suatu urutan berisi nilai tertentu atau tidak.

source: The default values are evaluated at the point of function definition in the *defining* scope, so that ::
id: Nilai bawaan dievaluasi pada titik definisi fungsi dalam lingkup *defining*, sehingga::

source: will print ``5``.
id: akan mencetak ``5``.

source: **Important warning:** The default value is evaluated only once. This makes a difference when the default is a mutable object such as a list, dictionary, or instances of most classes. For example, the following function accumulates the arguments passed to it on subsequent calls::
id: **Peringatan penting:** Nilai bawaan dievaluasi hanya sekali. Ini membuat perbedaan ketika bawaan adalah objek yang dapat diubah seperti daftar *list*, kamus *dictionary*, atau *instances* dari sebagian besar kelas. Misalnya, fungsi berikut mengakumulasi argumen yang diteruskan pada panggilan berikutnya::

source: This will print ::
id: Ini akan mencetak::

source: If you don't want the default to be shared between subsequent calls, you can write the function like this instead::
id: Jika Anda tidak ingin bawaan dibagi dengan panggilan berikutnya, Anda dapat menulis fungsi seperti ini sebagai gantinya:

source: Keyword Arguments
id: Argumen Kata Kunci *Keyword Arguments*

source: Functions can also be called using :term:`keyword arguments <keyword argument>` of the form ``kwarg=value``. For instance, the following function::
id: Fungsi juga dapat dipanggil menggunakan :term:`keyword argument <keyword argument>` dari bentuk ``kwarg=value``. Misalnya, fungsi berikut::

source: accepts one required argument (``voltage``) and three optional arguments (``state``, ``action``, and ``type``). This function can be called in any of the following ways::
id: menerima satu argumen yang diperlukan (``voltage``) dan tiga argumen opsional (``state``, ``action``, dan ``type``). Fungsi ini dapat dipanggil dengan salah satu cara berikut::

source: but all the following calls would be invalid::
id: tetapi semua pemanggilan berikut ini tidak valid::

source: In a function call, keyword arguments must follow positional arguments. All the keyword arguments passed must match one of the arguments accepted by the function (e.g. ``actor`` is not a valid argument for the ``parrot`` function), and their order is not important. This also includes non-optional arguments (e.g. ``parrot(voltage=1000)`` is valid too). No argument may receive a value more than once. Here's an example that fails due to this restriction::
id: Dalam pemanggilan fungsi, argumen kata kunci *keyword argument* harus mengikuti argumen posisi. Semua argumen kata kunci *keyword argument* yang diteruskan harus cocok dengan salah satu argumen yang diterima oleh fungsi (mis. ``actor`` bukan argumen yang valid untuk fungsi ``parrot``), dan urutannya tidak penting. Ini juga termasuk argumen non-opsional (mis. ``parrot(voltage=1000)`` juga valid). Tidak ada argumen yang dapat menerima nilai lebih dari sekali. Berikut ini contoh yang gagal karena batasan ini::

source: When a final formal parameter of the form ``**name`` is present, it receives a dictionary (see :ref:`typesmapping`) containing all keyword arguments except for those corresponding to a formal parameter. This may be combined with a formal parameter of the form ``*name`` (described in the next subsection) which receives a :ref:`tuple <tut-tuples>` containing the positional arguments beyond the formal parameter list. (``*name`` must occur before ``**name``.) For example, if we define a function like this::
id: Ketika parameter formal terakhir dari bentuk ``**name`` ada, ia menerima kamus *dictionary* (lihat :ref:`typesmapping`) yang berisi semua argumen kata kunci *keyword argument* kecuali yang terkait dengan parameter formal. Ini dapat digabungkan dengan parameter formal dari bentuk ``*name`` (dijelaskan dalam subbagian berikutnya) yang menerima :ref:`tuple <tut-tuples>` yang berisi argumen posisi di luar daftar parameter formal. (``*name`` harus ada sebelum ``**name``.) Misalnya, jika kita mendefinisikan fungsi seperti ini::

source: It could be called like this::
id: Ini bisa disebut seperti ini::
