Repository: python/python-docs-id
Catalog: tutorial/datastructures.po
Languages: id

source: When the keys are simple strings, it is sometimes easier to specify pairs using keyword arguments::
id: Ketika kunci adalah string sederhana, kadang-kadang lebih mudah untuk menentukan pasangan menggunakan argumen kata kunci *keyword arguments*::

source: Looping Techniques
id: Teknik Perulangan

source: When looping through dictionaries, the key and corresponding value can be retrieved at the same time using the :meth:`items` method. ::
id: Saat mengulang kamus *dictionaries*, kunci *key* dan nilai *value* terkait dapat diambil pada saat yang sama menggunakan metode :meth:`items`. ::

source: When looping through a sequence, the position index and corresponding value can be retrieved at the same time using the :func:`enumerate` function. ::
id: Saat mengulang melalui urutan, indeks posisi dan nilai terkait dapat diambil pada saat yang sama menggunakan fungsi :func:`enumerate`. ::

source: To loop over two or more sequences at the same time, the entries can be paired with the :func:`zip` function. ::
id: Untuk mengulang dua urutan atau lebih secara bersamaan, entri dapat dipasangkan dengan fungsi :func:`zip`. ::

source: To loop over a sequence in reverse, first specify the sequence in a forward direction and then call the :func:`reversed` function. ::
id: Untuk mengulang urutan secara terbalik, pertama tentukan urutan dalam arah maju dan kemudian panggil fungsi :func:`reversed`. ::

source: To loop over a sequence in sorted order, use the :func:`sorted` function which returns a new sorted list while leaving the source unaltered. ::
id: Untuk mengulangi sebuah urutan *sequence* dalam susunan yang diurutkan, gunakan fungsi :func:`sort` yang mengembalikan daftar terurut baru dengan membiarkan sumber tidak diubah. ::

source: Using :func:`set` on a sequence eliminates duplicate elements. The use of :func:`sorted` in combination with :func:`set` over a sequence is an idiomatic way to loop over unique elements of the sequence in sorted order. ::
id: Menggunakan :func:`set` pada sebuah urutan dapat menghilangkan elemen-elemen yang duplikat. Penggunaan :func:`sorted` yang dikombinasikan dengan :func:`set` terhadap sebuah urutan merupakan cara idiomatik untuk *loop* dari elemen-elemen unik dari urutan yang diurutkan. ::

source: It is sometimes tempting to change a list while you are looping over it; however, it is often simpler and safer to create a new list instead. ::
id: Terkadang tergoda untuk mengubah daftar *list* saat Anda mengulanginya; namun, seringkali lebih mudah dan aman untuk membuat daftar *list* baru. ::

source: More on Conditions
id: Lebih lanjut tentang Kondisi

source: The conditions used in ``while`` and ``if`` statements can contain any operators, not just comparisons.
id: Kondisi yang digunakan dalam pernyataan ``while`` dan ``if`` dapat berisi operator apa pun, bukan hanya perbandingan.

source: The comparison operators ``in`` and ``not in`` check whether a value occurs (does not occur) in a sequence. The operators ``is`` and ``is not`` compare whether two objects are really the same object; this only matters for mutable objects like lists. All comparison operators have the same priority, which is lower than that of all numerical operators.
id: Operator perbandingan ``in`` dan ``not in`` memeriksa apakah suatu nilai terjadi (tidak terjadi) secara berurutan. Operator ``is`` dan ``is not`` membandingkan apakah dua objek benar-benar objek yang sama; ini hanya penting untuk objek yang dapat diubah seperti daftar *list*. Semua operator pembanding memiliki prioritas yang sama, yang lebih rendah daripada semua operator numerik.

source: Comparisons can be chained. For example, ``a < b == c`` tests whether ``a`` is less than ``b`` and moreover ``b`` equals ``c``.
id: Perbandingan bisa dibuat berantai. Sebagai contoh, ``a < b == c`` menguji apakah ``a`` kurang dari ``b`` dan apa ``b`` sama dengan ``c``.

source: Comparisons may be combined using the Boolean operators ``and`` and ``or``, and the outcome of a comparison (or of any other Boolean expression) may be negated with ``not``. These have lower priorities than comparison operators; between them, ``not`` has the highest priority and ``or`` the lowest, so that ``A and not B or C`` is equivalent to ``(A and (not B)) or C``. As always, parentheses can be used to express the desired composition.
id: Perbandingan dapat digabungkan menggunakan operator Boolean ``and`` dan ``or``, dan hasil perbandingan (atau ekspresi Boolean lainnya) dapat dinegasikan dengan ``not``. Ini memiliki prioritas lebih rendah daripada operator pembanding; di antara mereka, ``not`` memiliki prioritas tertinggi dan ``or`` terendah, sehingga ``A and not B or C`` setara dengan ``(A and (not B)) or C`` . Seperti biasa, tanda kurung dapat digunakan untuk mengekspresikan komposisi yang diinginkan.

source: The Boolean operators ``and`` and ``or`` are so-called *short-circuit* operators: their arguments are evaluated from left to right, and evaluation stops as soon as the outcome is determined. For example, if ``A`` and ``C`` are true but ``B`` is false, ``A and B and C`` does not evaluate the expression ``C``. When used as a general value and not as a Boolean, the return value of a short-circuit operator is the last evaluated argument.
id: Operator Boolean ``and`` dan ``or`` disebut operator *short-circuit*: argumen mereka dievaluasi dari kiri ke kanan, dan evaluasi berhenti segera setelah hasilnya ditentukan. Misalnya, jika ``A`` dan ``C`` bernilai benar tetapi ``B`` salah, ``A and B and C`` tidak mengevaluasi ekspresi ``C``. Ketika digunakan sebagai nilai umum dan bukan sebagai Boolean, nilai kembalian dari operator hubung singkat *short-circuit* adalah argumen terakhir yang dievaluasi.

source: It is possible to assign the result of a comparison or other Boolean expression to a variable. For example, ::
id: Dimungkinkan untuk menetapkan hasil perbandingan atau ekspresi Boolean lainnya ke variabel. Sebagai contoh, ::

source: Note that in Python, unlike C, assignment inside expressions must be done explicitly with the :ref:`walrus operator <why-can-t-i-use-an-assignment-in-an-expression>` ``:=``. This avoids a common class of problems encountered in C programs: typing ``=`` in an expression when ``==`` was intended.
id: Perhatikan bahwa dalam Python, tidak seperti C, penugasan di dalam ekspresi harus dilakukan secara eksplisit dengan operator *walrus* ``:=``. Ini menghindari masalah kelas umum yang dihadapi dalam program C: mengetikkan ``=`` dalam ekspresi ketika ``==`` dimaksudkan.

source: Comparing Sequences and Other Types
id: Membandingkan Urutan *Sequences* dan Jenis Lainnya

source: Sequence objects typically may be compared to other objects with the same sequence type. The comparison uses *lexicographical* ordering: first the first two items are compared, and if they differ this determines the outcome of the comparison; if they are equal, the next two items are compared, and so on, until either sequence is exhausted. If two items to be compared are themselves sequences of the same type, the lexicographical comparison is carried out recursively. If all items of two sequences compare equal, the sequences are considered equal. If one sequence is an initial sub-sequence of the other, the shorter sequence is the smaller (lesser) one. Lexicographical ordering for strings uses the Unicode code point number to order individual characters. Some examples of comparisons between sequences of the same type::
id: Objek urutan *sequence* biasanya dapat dibandingkan dengan objek lain dengan jenis urutan yang sama. Perbandingan menggunakan pengurutan *lexicographical*: pertama dua item pertama dibandingkan, dan jika mereka berbeda ini menentukan hasil perbandingan; jika mereka sama, dua item berikutnya dibandingkan, dan seterusnya, sampai urutan mana pun habis. Jika dua item yang akan dibandingkan adalah urutannya sendiri dari jenis yang sama, perbandingan leksikografis dilakukan secara rekursif. Jika semua item dari dua urutan membandingkan hasilnya sama, urutannya dianggap sama. Jika satu urutan adalah sub-urutan awal dari yang lain, urutan yang lebih pendek adalah yang lebih kecil (lebih pendek). Pengurutan leksikografis untuk string menggunakan nomor titik kode Unicode untuk mengurutkan masing-masing karakter. Beberapa contoh perbandingan antara urutan dengan tipe yang sama::

source: Note that comparing objects of different types with ``<`` or ``>`` is legal provided that the objects have appropriate comparison methods. For example, mixed numeric types are compared according to their numeric value, so 0 equals 0.0, etc. Otherwise, rather than providing an arbitrary ordering, the interpreter will raise a :exc:`TypeError` exception.
id: Perhatikan bahwa membandingkan objek dari berbagai jenis dengan ``<`` atau ``>`` adalah sah asalkan objek memiliki metode perbandingan yang sesuai. Misalnya, tipe numerik campuran dibandingkan menurut nilai numeriknya, sehingga 0 sama dengan 0.0, dll. Jika tidak, alih-alih memberikan penyusunan acak, interpreter akan memunculkan pengecualian :exc:`TypeError`.

source: Footnotes
id: Catatan kaki

source: Other languages may return the mutated object, which allows method chaining, such as ``d->insert("a")->remove("b")->sort();``.
id: Bahasa lain dapat mengembalikan objek bermutasi, yang memungkinkan metode berantai *chaining*, seperti ``d->insert("a")->remove("b")->sort();``.
