Repository: python/python-docs-id
Catalog: tutorial/datastructures.po
Languages: id

source: Data Structures
id: Struktur Data

source: This chapter describes some things you've learned about already in more detail, and adds some new things as well.
id: Bab ini menjelaskan beberapa hal yang telah Anda pelajari secara lebih rinci, dan menambahkan beberapa hal baru juga.

source: More on Lists
id: Lebih Lanjut tentang Daftar *Lists*

source: The list data type has some more methods. Here are all of the methods of list objects:
id: Tipe data daftar *list* memiliki beberapa metode lagi. Berikut ini semua metode dari objek daftar *list*:

source: Add an item to the end of the list. Equivalent to ``a[len(a):] = [x]``.
id: Tambahkan item ke akhir daftar *list*. Setara dengan ``a[len(a):] = [x]``.

source: Extend the list by appending all the items from the iterable. Equivalent to ``a[len(a):] = iterable``.
id: Perpanjang daftar *list* dengan menambahkan semua item dari *iterable*. Setara dengan ``a[len(a):] = iterable``.

source: Insert an item at a given position. The first argument is the index of the element before which to insert, so ``a.insert(0, x)`` inserts at the front of the list, and ``a.insert(len(a), x)`` is equivalent to ``a.append(x)``.
id: Masukkan item pada posisi tertentu. Argumen pertama adalah indeks elemen sebelum memasukkan, jadi ``a.insert(0, x)`` memasukkan di bagian depan daftar *list*, dan ``a.insert(len(a), x)`` sama dengan ``a.append(x)``.

source: Remove the first item from the list whose value is equal to *x*. It raises a :exc:`ValueError` if there is no such item.
id: Hapus item pertama dari daftar *list* yang nilainya sama dengan *x*. Ini memunculkan :exc:`ValueError` jika tidak ada item seperti itu.

source: Remove the item at the given position in the list, and return it. If no index is specified, ``a.pop()`` removes and returns the last item in the list. (The square brackets around the *i* in the method signature denote that the parameter is optional, not that you should type square brackets at that position. You will see this notation frequently in the Python Library Reference.)
id: Hapus item pada posisi yang diberikan dalam daftar, dan kembalikan. Jika tidak ada indeks yang ditentukan, ``a.pop()`` menghapus dan mengembalikan item terakhir dalam daftar. (Tanda kurung siku di sekitar *i* dalam pengenal *signature* metode menunjukkan bahwa parameternya opsional, bukan Anda harus mengetik tanda kurung siku pada posisi itu. Anda akan sering melihat notasi ini di Referensi Pustaka Python.)

source: Remove all items from the list. Equivalent to ``del a[:]``.
id: Hapus semua item dari daftar *list*. Setara dengan ``del a[:]``.

source: Return zero-based index in the list of the first item whose value is equal to *x*. Raises a :exc:`ValueError` if there is no such item.
id: Kembalikan indeks berbasis nol dalam daftar item pertama yang nilainya sama dengan *x*. Menimbulkan :exc:`ValueError` jika tidak ada item seperti itu.

source: The optional arguments *start* and *end* are interpreted as in the slice notation and are used to limit the search to a particular subsequence of the list. The returned index is computed relative to the beginning of the full sequence rather than the *start* argument.
id: Argumen opsional *start* dan *end* ditafsirkan seperti dalam notasi *slice* dan digunakan untuk membatasi pencarian ke urutan tertentu dari daftar. Indeks yang dikembalikan dihitung relatif terhadap awal urutan penuh daripada argumen *start*.

source: Return the number of times *x* appears in the list.
id: Kembalikan berapa kali *x* muncul dalam daftar.

source: Sort the items of the list in place (the arguments can be used for sort customization, see :func:`sorted` for their explanation).
id: Urutkan item daftar di tempat (argumen dapat digunakan untuk mengurutkan ubahsuaian *customization*, lihat :func:`sorted` untuk penjelasannya).

source: Reverse the elements of the list in place.
id: Balikkan elemen daftar *list* di tempatnya.

source: Return a shallow copy of the list. Equivalent to ``a[:]``.
id: Kembalikan salinan daftar *list* yang dangkal. Setara dengan ``a[:]``.

source: An example that uses most of the list methods::
id: Contoh yang menggunakan sebagian besar metode daftar *list*::

source: You might have noticed that methods like ``insert``, ``remove`` or ``sort`` that only modify the list have no return value printed -- they return the default ``None``. [1]_ This is a design principle for all mutable data structures in Python.
id: Anda mungkin telah memperhatikan bahwa metode seperti ``insert``, ``remove`` atau ``sort`` yang hanya mengubah daftar *list* tidak memiliki nilai pengembalian yang dicetak -- mereka mengembalikan standar ``None``. [1]_ Ini adalah prinsip desain untuk semua struktur data yang bisa berubah *mutable* dalam Python.

source: Another thing you might notice is that not all data can be sorted or compared. For instance, ``[None, 'hello', 10]`` doesn't sort because integers can't be compared to strings and *None* can't be compared to other types. Also, there are some types that don't have a defined ordering relation. For example, ``3+4j < 5+7j`` isn't a valid comparison.
id: Hal lain yang mungkin Anda perhatikan adalah bahwa tidak semua data dapat diurutkan atau dibandingkan. Misalnya, ``[None, 'hello', 10]`` tidak mengurutkan karena bilangan bulat tidak dapat dibandingkan dengan string dan *None* tidak dapat dibandingkan dengan jenis lainnya. Juga, ada beberapa tipe yang tidak memiliki hubungan pengurutan yang ditentukan. Sebagai contoh, ``3+4j < 5+7j`` bukan perbandingan yang valid.

source: Using Lists as Stacks
id: Menggunakan Daftar *Lists* sebagai Tumpukan *Stacks*

source: The list methods make it very easy to use a list as a stack, where the last element added is the first element retrieved ("last-in, first-out"). To add an item to the top of the stack, use :meth:`append`. To retrieve an item from the top of the stack, use :meth:`pop` without an explicit index. For example::
id: Metode daftar membuatnya sangat mudah untuk menggunakan daftar *lust* sebagai tumpukan *stack*, di mana elemen terakhir yang ditambahkan adalah elemen pertama yang diambil ("last-in, first-out"). Untuk menambahkan item ke atas tumpukan, gunakan :meth:`append`. Untuk mengambil item dari atas tumpukan, gunakan :meth:`pop` tanpa indeks eksplisit. Sebagai contoh::

source: Using Lists as Queues
id: Menggunakan Daftar *Lists* sebagai Antrian *Queues*

source: It is also possible to use a list as a queue, where the first element added is the first element retrieved ("first-in, first-out"); however, lists are not efficient for this purpose. While appends and pops from the end of list are fast, doing inserts or pops from the beginning of a list is slow (because all of the other elements have to be shifted by one).
id: Dimungkinkan juga untuk menggunakan daftar sebagai antrian, di mana elemen pertama yang ditambahkan adalah elemen pertama yang diambil ("first-in, first-out"); namun, daftar tidak efisien untuk tujuan ini. Sementara menambahkan dan muncul dari akhir daftar cepat, melakukan memasukkan atau muncul dari awal daftar lambat (karena semua elemen lain harus digeser satu).

source: To implement a queue, use :class:`collections.deque` which was designed to have fast appends and pops from both ends. For example::
id: Untuk mengimplementasikan antrian, gunakan :class:`collections.deque` yang dirancang untuk menambahkan dan muncul dengan cepat dari kedua ujungnya. Sebagai contoh::

source: List Comprehensions
id: Daftar *List* *Comprehensions*

source: List comprehensions provide a concise way to create lists. Common applications are to make new lists where each element is the result of some operations applied to each member of another sequence or iterable, or to create a subsequence of those elements that satisfy a certain condition.
id: Pemahaman daftar *list comprehensions* menyediakan cara singkat untuk membuat daftar. Aplikasi umum adalah membuat daftar baru di mana setiap elemen adalah hasil dari beberapa operasi yang diterapkan pada setiap anggota dari urutan lain atau *iterable*, atau untuk membuat urutan elemen-elemen yang memenuhi kondisi tertentu.

source: For example, assume we want to create a list of squares, like::
id: Misalnya, anggap kita ingin membuat daftar kotak, seperti::

source: Note that this creates (or overwrites) a variable named ``x`` that still exists after the loop completes. We can calculate the list of squares without any side effects using::
id: Perhatikan bahwa ini membuat (atau menimpa) variabel bernama ``x`` yang masih ada setelah loop selesai. Kami dapat menghitung daftar kotak tanpa efek samping menggunakan::

source: or, equivalently::
id: atau, dengan kata lain::

source: which is more concise and readable.
id: yang lebih ringkas dan mudah dibaca.

source: A list comprehension consists of brackets containing an expression followed by a :keyword:`!for` clause, then zero or more :keyword:`!for` or :keyword:`!if` clauses. The result will be a new list resulting from evaluating the expression in the context of the :keyword:`!for` and :keyword:`!if` clauses which follow it. For example, this listcomp combines the elements of two lists if they are not equal::
id: Pemahaman daftar *list comprehension* terdiri dari tanda kurung yang berisi ekspresi diikuti oleh klausa :keyword:`!for`, lalu nol atau lebih klausa :keyword:`!for` atau :keyword:`!if`. Hasilnya akan menjadi daftar baru yang dihasilkan dari mengevaluasi ekspresi dalam konteks dari klausa :keyword:`!for` dan :keyword:`!if` yang mengikutinya. Sebagai contoh, *listcomp* ini menggabungkan elemen dari dua daftar jika tidak sama::

source: and it's equivalent to::
id: dan itu setara dengan::

source: Note how the order of the :keyword:`for` and :keyword:`if` statements is the same in both these snippets.
id: Perhatikan bagaimana urutan pernyataan :keyword:`for` dan :keyword:`if` adalah sama di kedua cuplikan ini.

source: If the expression is a tuple (e.g. the ``(x, y)`` in the previous example), it must be parenthesized. ::
id: Jika ekspresi adalah tuple (mis. ``(x, y)`` dalam contoh sebelumnya), ekspresi tersebut harus diberi kurung. ::

source: List comprehensions can contain complex expressions and nested functions::
id: Pemahaman daftar *list comprehensions* dapat berisi ekspresi kompleks dan fungsi bersarang::

source: Nested List Comprehensions
id: Pemahaman Daftar *List Comprehensions* Bersarang

source: The initial expression in a list comprehension can be any arbitrary expression, including another list comprehension.
id: Ekspresi awal dalam pemahaman daftar *list comprehension* dapat berupa ekspresi acak *arbitrary*, termasuk pemahaman daftar *list comprehension* lainnya.

source: Consider the following example of a 3x4 matrix implemented as a list of 3 lists of length 4::
id: Perhatikan contoh matriks 3x4 berikut yang diimplementasikan sebagai daftar *list* 3 dari daftar *list* panjang 4 ::

source: The following list comprehension will transpose rows and columns::
id: Pemahaman daftar *list comprehension* berikut akan mengubah baris dan kolom::

source: As we saw in the previous section, the nested listcomp is evaluated in the context of the :keyword:`for` that follows it, so this example is equivalent to::
id: Seperti yang kita lihat di bagian sebelumnya, *listcomp* bersarang dievaluasi dalam konteks :keyword:`for` yang mengikutinya, jadi contoh ini setara dengan::

source: which, in turn, is the same as::
id: yang, pada gilirannya, sama dengan::

source: In the real world, you should prefer built-in functions to complex flow statements. The :func:`zip` function would do a great job for this use case::
id: Di dunia nyata, Anda harus memilih fungsi bawaan untuk pernyataan aliran *flow* yang kompleks. Fungsi :func:`zip` akan melakukan pekerjaan yang baik untuk kasus penggunaan ini::

source: See :ref:`tut-unpacking-arguments` for details on the asterisk in this line.
id: Lihat :ref:`tut-unpacking-argumen` untuk detail tentang tanda bintang *asterisk* di baris ini.

source: The :keyword:`!del` statement
id: Pernyataan :keyword:`!del`

source: There is a way to remove an item from a list given its index instead of its value: the :keyword:`del` statement. This differs from the :meth:`pop` method which returns a value. The :keyword:`!del` statement can also be used to remove slices from a list or clear the entire list (which we did earlier by assignment of an empty list to the slice). For example::
id: Ada cara untuk menghapus item dari daftar yang diberikan indeksnya, bukan nilainya: pernyataan :keyword:`del`. Ini berbeda dari metode :meth:`pop` yang mengembalikan nilai. Pernyataan :keyword:`!del` juga dapat digunakan untuk menghapus irisan dari daftar *list* atau menghapus seluruh daftar *list* (yang kami lakukan sebelumnya dengan menetapkan daftar kosong pada *slice*). Sebagai contoh::

source: :keyword:`del` can also be used to delete entire variables::
id: :keyword:`del` juga dapat digunakan untuk menghapus seluruh variabel::

source: Referencing the name ``a`` hereafter is an error (at least until another value is assigned to it). We'll find other uses for :keyword:`del` later.
id: Merujuk nama ``a`` selanjutnya adalah kesalahan (setidaknya sampai nilai lain ditetapkan untuknya). Kita akan menemukan kegunaan lain untuk :keyword:`del` nanti.

source: Tuples and Sequences
id: Tuples and *Urutan* Sequences

source: We saw that lists and strings have many common properties, such as indexing and slicing operations. They are two examples of *sequence* data types (see :ref:`typesseq`). Since Python is an evolving language, other sequence data types may be added. There is also another standard sequence data type: the *tuple*.
id: Kita melihat bahwa daftar *list* dan string memiliki banyak properti yang sama, seperti operasi pengindeksan dan pemotongan. Mereka adalah dua contoh tipe data *sequence* (lihat :ref:`typesseq`). Karena Python adalah bahasa yang berkembang, tipe data urutan lainnya dapat ditambahkan. Ada juga tipe data urutan standar lain: *tuple*.

source: A tuple consists of a number of values separated by commas, for instance::
id: Sebuah *tuple* terdiri dari sejumlah nilai yang dipisahkan oleh koma, misalnya::

source: As you see, on output tuples are always enclosed in parentheses, so that nested tuples are interpreted correctly; they may be input with or without surrounding parentheses, although often parentheses are necessary anyway (if the tuple is part of a larger expression). It is not possible to assign to the individual items of a tuple, however it is possible to create tuples which contain mutable objects, such as lists.
id: Seperti yang Anda lihat, pada *tuple* keluaran selalu tertutup dalam tanda kurung, sehingga *tuple* bersarang *nester* ditafsirkan dengan benar; mereka mungkin dimasukkan dengan atau tanpa tanda kurung di sekitarnya, meskipun seringkali tanda kurung diperlukan pula (jika tuple adalah bagian dari ekspresi yang lebih besar). Tidak mungkin untuk memberikan nilai ke masing-masing item *tuple*, namun dimungkinkan untuk membuat tuple yang berisi objek yang bisa berubah *mutable*, seperti daftar.

source: Though tuples may seem similar to lists, they are often used in different situations and for different purposes. Tuples are :term:`immutable`, and usually contain a heterogeneous sequence of elements that are accessed via unpacking (see later in this section) or indexing (or even by attribute in the case of :func:`namedtuples <collections.namedtuple>`). Lists are :term:`mutable`, and their elements are usually homogeneous and are accessed by iterating over the list.
id: Meskipun *tuple* mungkin mirip dengan daftar, *tuple* sering digunakan dalam situasi yang berbeda dan untuk tujuan yang berbeda. *Tuples* adalah :term:`immutable`, dan biasanya berisi urutan elemen yang heterogen yang diakses melalui *unpacking* (lihat nanti di bagian ini) atau pengindeksan (atau bahkan berdasarkan atribut dalam kasus :func:`namedtuples <collections.namedtuple> `). Daftar adalah :term:`mutable`, dan elemen-elemennya biasanya homogen dan diakses dengan menyusuri *iterating* daftar *list*.

source: A special problem is the construction of tuples containing 0 or 1 items: the syntax has some extra quirks to accommodate these. Empty tuples are constructed by an empty pair of parentheses; a tuple with one item is constructed by following a value with a comma (it is not sufficient to enclose a single value in parentheses). Ugly, but effective. For example::
id: Masalah khusus adalah pembangunan *tuple* yang mengandung 0 atau 1 item: sintaksis memiliki beberapa kebiasaan *quirks* tambahan untuk mengakomodasi ini. *Tuple* kosong dibangun oleh sepasang kurung kosong; tupel dengan satu item dikonstruksi dengan mengikuti nilai dengan koma (tidak cukup untuk menyertakan nilai tunggal dalam tanda kurung). Jelek, tapi efektif. Sebagai contoh::

source: The statement ``t = 12345, 54321, 'hello!'`` is an example of *tuple packing*: the values ``12345``, ``54321`` and ``'hello!'`` are packed together in a tuple. The reverse operation is also possible::
id: Pernyataan ``t = 12345, 54321, 'hello!'`` Adalah contoh dari *tuple packing*: nilainya ``12345``, ``54321`` dan ``'hello!'`` Dikemas bersama-sama dalam *tuple*. Operasi terbalik juga dimungkinkan ::

source: This is called, appropriately enough, *sequence unpacking* and works for any sequence on the right-hand side. Sequence unpacking requires that there are as many variables on the left side of the equals sign as there are elements in the sequence. Note that multiple assignment is really just a combination of tuple packing and sequence unpacking.
id: Ini disebut, cukup tepat, urutan membongkar *sequence unpacking* dan berfungsi untuk setiap urutan di sisi kanan. Urutan membongkar mensyaratkan bahwa ada banyak variabel di sisi kiri tanda sama dengan ada elemen dalam urutan. Perhatikan bahwa banyak tugas benar-benar hanya kombinasi dari *tuple packing* dan urutan pembongkaran *sequence unpacking*.

source: Sets
id: Himpunan *Set*

source: Python also includes a data type for *sets*. A set is an unordered collection with no duplicate elements. Basic uses include membership testing and eliminating duplicate entries. Set objects also support mathematical operations like union, intersection, difference, and symmetric difference.
id: Python juga menyertakan tipe data untuk *sets*. Himpunan atau *Set* adalah koleksi yang tidak terurut tanpa elemen duplikat. Penggunaan dasar termasuk pengujian keanggotaan dan menghilangkan entri duplikat. Atur objek juga mendukung operasi matematika seperti penyatuan *union*, persimpangan *intersection*, perbedaan *difference*, dan perbedaan simetris.

source: Curly braces or the :func:`set` function can be used to create sets. Note: to create an empty set you have to use ``set()``, not ``{}``; the latter creates an empty dictionary, a data structure that we discuss in the next section.
id: Kurung kurawal atau fungsi :func:`set` dapat digunakan untuk membuat himpunan. Catatan: untuk membuat himpunan kosong Anda harus menggunakan ``set()``, bukan ``{}``; yang terakhir itu membuat kamus *dictionary* kosong, struktur data yang kita bahas di bagian selanjutnya.

source: Here is a brief demonstration::
id: Berikut ini adalah demonstrasi singkat::

source: Similarly to :ref:`list comprehensions <tut-listcomps>`, set comprehensions are also supported::
id: Seperti halnya untuk :ref:`list comprehensions <tut-listcomps>`, *set comprehensions* juga didukung::

source: Dictionaries
id: Kamus *Dictionaries*

source: Another useful data type built into Python is the *dictionary* (see :ref:`typesmapping`). Dictionaries are sometimes found in other languages as "associative memories" or "associative arrays". Unlike sequences, which are indexed by a range of numbers, dictionaries are indexed by *keys*, which can be any immutable type; strings and numbers can always be keys. Tuples can be used as keys if they contain only strings, numbers, or tuples; if a tuple contains any mutable object either directly or indirectly, it cannot be used as a key. You can't use lists as keys, since lists can be modified in place using index assignments, slice assignments, or methods like :meth:`append` and :meth:`extend`.
id: Tipe data lain yang berguna yang dibangun ke dalam Python adalah *dictionary* (lihat :ref:`typesmapping`). Kamus *dictionary* kadang-kadang ditemukan dalam bahasa lain sebagai "assosiative memories" atau "assosiative array". Tidak seperti urutan *sequences*, yang diindeks oleh sejumlah angka, kamus *dictionary* diindeks oleh *keys*, yang dapat berupa jenis apa pun yang tidak dapat diubah *immutable type*; string dan angka selalu bisa menjadi kunci *key*. *Tuples* dapat digunakan sebagai kunci jika hanya berisi string, angka, atau *tuple*; jika sebuah tuple berisi objek yang bisa berubah baik secara langsung atau tidak langsung, itu tidak dapat digunakan sebagai kunci *key*. Anda tidak dapat menggunakan daftar *list* sebagai kunci, karena daftar dapat dimodifikasi di tempat menggunakan penugasan indeks, penugasan *slice*, atau metode seperti :meth:`append` dan :meth:`extend`.

source: It is best to think of a dictionary as a set of *key: value* pairs, with the requirement that the keys are unique (within one dictionary). A pair of braces creates an empty dictionary: ``{}``. Placing a comma-separated list of key:value pairs within the braces adds initial key:value pairs to the dictionary; this is also the way dictionaries are written on output.
id: Sebaiknya pikirkan kamus *dictionary* sebagai satu set *key: value* berpasangan, dengan persyaratan bahwa kunci tersebut unik (dalam satu kamus *dictionary*). Sepasang kurung kurawal membuat kamus *dictionary* kosong: ``{}``. Menempatkan daftar pasangan kunci:nilai yang dipisah koma dalam kurung menambahkan pasangan kunci:nilai ke kamus *dictionary*; ini juga cara kamus *dictionary* ditulis pada keluaran.

source: The main operations on a dictionary are storing a value with some key and extracting the value given the key. It is also possible to delete a key:value pair with ``del``. If you store using a key that is already in use, the old value associated with that key is forgotten. It is an error to extract a value using a non-existent key.
id: Operasi utama pada kamus *dictionary* adalah menyimpan nilai dengan beberapa kunci *key* dan mengekstraksi nilai yang diberikan kunci *key*. Dimungkinkan juga untuk menghapus pasangan kunci:nilai dengan ``del``. Jika Anda menyimpan menggunakan kunci yang sudah digunakan, nilai lama yang terkait dengan kunci itu dilupakan. Merupakan kesalahan untuk mengekstraksi nilai menggunakan kunci yang tidak ada.

source: Performing ``list(d)`` on a dictionary returns a list of all the keys used in the dictionary, in insertion order (if you want it sorted, just use ``sorted(d)`` instead). To check whether a single key is in the dictionary, use the :keyword:`in` keyword.
id: Melakukan ``list(d)`` pada kamus mengembalikan daftar *list* semua kunci yang digunakan dalam kamus, dalam urutan penyisipan (jika Anda ingin diurutkan, cukup gunakan ``sorted(d)`` sebagai gantinya). Untuk memeriksa apakah ada satu kunci dalam kamus, gunakan kaca kunci :keyword:`in`.

source: Here is a small example using a dictionary::
id: Ini adalah contoh kecil menggunakan kamus *dictionary*::

source: The :func:`dict` constructor builds dictionaries directly from sequences of key-value pairs::
id: Pembangun *constructor* :func:`dict` membangun kamus langsung dari urutan pasangan kunci-nilai::

source: In addition, dict comprehensions can be used to create dictionaries from arbitrary key and value expressions::
id: Selain itu, pemahaman kamus *dict comprehensions* dapat digunakan untuk membuat kamus *dictionary* dari ekspresi kunci dan nilai acak *arbitrary*::
