Repository: python/python-docs-id
Catalog: about.po
Languages: id

source: About these documents
id: Tentang dokumen-dokumen ini

source: These documents are generated from `reStructuredText`_ sources by `Sphinx`_, a document processor specifically written for the Python documentation.
id: Dokumen-dokumen ini dihasilkan dari `reStructuredText`_ dengan `Sphinx`_, sebuah pemroses dokumen yang khusus ditulis untuk dokumentasi Python.

source: Development of the documentation and its toolchain is an entirely volunteer effort, just like Python itself. If you want to contribute, please take a look at the :ref:`reporting-bugs` page for information on how to do so. New volunteers are always welcome!
id: Pengembangan dokumentasi dan perangkat pengembangannya sepenuhnya upaya sukarela, seperti halnya Python. Jika anda ingin berkontribusi, silakan lihat halaman :ref:`reporting-bugs` untuk informasi cara melakukannya. Relawan baru selalu diterima!

source: Many thanks go to:
id: Terima kasih banyak untuk:

source: Fred L. Drake, Jr., the creator of the original Python documentation toolset and writer of much of the content;
id: Fred L. Drake, Jr., pembuat awal kumpulan alat dokumentasi Python dan penulis banyak konten;

source: the `Docutils <http://docutils.sourceforge.net/>`_ project for creating reStructuredText and the Docutils suite;
id: `Docutils <http://docutils.sourceforge.net/>`_ proyek untuk membuat reStructuredText dan Docutils suite;

source: Fredrik Lundh for his `Alternative Python Reference <http://effbot.org/zone/pyref.htm>`_ project from which Sphinx got many good ideas.
id: Fredrik Lundh untuk `Alternative Python Reference <http://effbot.org/zone/pyref.htm>`_ proyek dimana Sphinx mendapatkan banyak ide bagus.

source: Contributors to the Python Documentation
id: Kontributor untuk dokumentasi Python

source: Many people have contributed to the Python language, the Python standard library, and the Python documentation. See :source:`Misc/ACKS` in the Python source distribution for a partial list of contributors.
id: Banyak orang telah berkontribusi ke bahasa Python, pustaka standar Python, dan dokumentasi Python. Lihat :source:`Misc/ACKS` di distribusi kode sumber Python untuk sebagian daftar kontributor-kontributor.

source: It is only with the input and contributions of the Python community that Python has such wonderful documentation -- Thank You!
id: Hanya dengan masukan dan kontribusi dari komunitas Python sehingga Python memiliki dokumentasi yang sangat baik. Terima kasih!
