Repository: python/python-docs-id
Catalog: python-newest.tutorial--classes/*.po
Languages: id

source: In fact, it is slightly more complex than that; the method resolution order changes dynamically to support cooperative calls to :func:`super`. This approach is known in some other multiple-inheritance languages as call-next-method and is more powerful than the super call found in single-inheritance languages.
id: Faktanya, ini sedikit lebih kompleks dari itu; urutan resolusi metode berubah secara dinamis untuk mendukung pemanggilan kooperatif ke :func:`super`. Pendekatan ini dikenal dalam beberapa bahasa warisan ganda sebagai metode panggilan-berikutnya *call-next-method* dan lebih berdaya daripada panggilan super yang ditemukan dalam bahasa warisan tunggal.

source: Dynamic ordering is necessary because all cases of multiple inheritance exhibit one or more diamond relationships (where at least one of the parent classes can be accessed through multiple paths from the bottommost class). For example, all classes inherit from :class:`object`, so any case of multiple inheritance provides more than one path to reach :class:`object`. To keep the base classes from being accessed more than once, the dynamic algorithm linearizes the search order in a way that preserves the left-to-right ordering specified in each class, that calls each parent only once, and that is monotonic (meaning that a class can be subclassed without affecting the precedence order of its parents). Taken together, these properties make it possible to design reliable and extensible classes with multiple inheritance. For more detail, see https://www.python.org/download/releases/2.3/mro/.
id: Urutan dinamis diperlukan karena semua kasus pewarisan berganda menunjukkan satu atau lebih hubungan intan *diamond relationships* (di mana setidaknya satu dari kelas induk dapat diakses melalui beberapa jalur dari kelas bawah). Sebagai contoh, semua kelas mewarisi dari :class:`object`, jadi segala kasus pewarisan berganda menyediakan lebih dari satu jalur untuk mencapai :class:` object`. Untuk menjaga agar kelas dasar tidak diakses lebih dari sekali, algoritma dinamis linier mengurutkan urutan pencarian dengan cara yang mempertahankan urutan kiri-ke-kanan yang ditentukan dalam setiap kelas, yang memanggil setiap induk hanya sekali, dan itu monoton (artinya suatu kelas dapat di-subklas-kan tanpa memengaruhi urutan prioritas orang tuanya). Secara bersama-sama, properti ini memungkinkan untuk merancang kelas yang andal dan dapat diperluas dengan banyak pewarisan. Untuk detail lebih lanjut, lihat https://www.python.org/download/releases/2.3/mro/.

source: Private Variables
id: Variabel Privat

source: "Private" instance variables that cannot be accessed except from inside an object don't exist in Python. However, there is a convention that is followed by most Python code: a name prefixed with an underscore (e.g. ``_spam``) should be treated as a non-public part of the API (whether it is a function, a method or a data member). It should be considered an implementation detail and subject to change without notice.
id: Variabel instance "Private" yang tidak dapat diakses kecuali dari dalam suatu objek tidak ada dalam Python. Namun, ada konvensi yang diikuti oleh sebagian besar kode Python: nama diawali dengan garis bawah (mis. ``_spam``) harus diperlakukan sebagai bagian non-publik dari API (apakah itu fungsi, metode atau anggota data). Ini harus dianggap sebagai detail implementasi dan dapat berubah tanpa pemberitahuan.

source: Since there is a valid use-case for class-private members (namely to avoid name clashes of names with names defined by subclasses), there is limited support for such a mechanism, called :dfn:`name mangling`. Any identifier of the form ``__spam`` (at least two leading underscores, at most one trailing underscore) is textually replaced with ``_classname__spam``, where ``classname`` is the current class name with leading underscore(s) stripped. This mangling is done without regard to the syntactic position of the identifier, as long as it occurs within the definition of a class.
id: Karena ada kasus penggunaan yang valid untuk anggota kelas-pribadi (yaitu untuk menghindari bentrokan nama dengan nama yang ditentukan oleh subkelas), ada dukungan terbatas untuk mekanisme semacam itu, yang disebut :dfn:`name mangling`. Setiap pengidentifikasi dari bentuk ``__spam`` (setidaknya dua garis bawah utama, paling banyak satu garis bawah garis bawah) secara teks diganti dengan ``_classname__spam``, di mana ``classname`` adalah nama kelas saat ini dengan garis(-garis) bawah utama dilucuti. *Mangling* ini dilakukan tanpa memperhatikan posisi sintaksis pengidentifikasi, asalkan terjadi dalam definisi kelas.

source: Name mangling is helpful for letting subclasses override methods without breaking intraclass method calls. For example::
id: *Name mangling* sangat membantu untuk membiarkan subclass menimpa metode tanpa memutus panggilan metode *intraclass*. Sebagai contoh::

source: The above example would work even if ``MappingSubclass`` were to introduce a ``__update`` identifier since it is replaced with ``_Mapping__update`` in the ``Mapping`` class and ``_MappingSubclass__update`` in the ``MappingSubclass`` class respectively.
id: Contoh di atas akan berfungsi bahkan jika ``MappingSubclass`` akan memperkenalkan sebuah pengidentifikasi ``__update`` karena diganti dengan ``_Mapping__update`` di kelas ``Mapping`` dan ``_MappingSubclass__update`` di kelas ``MappingSubclass`` masing-masing.

source: Note that the mangling rules are designed mostly to avoid accidents; it still is possible to access or modify a variable that is considered private. This can even be useful in special circumstances, such as in the debugger.
id: Perhatikan bahwa aturan *mangling* sebagian besar dirancang untuk menghindari kecelakaan; masih dimungkinkan untuk mengakses atau memodifikasi variabel yang dianggap pribadi. Ini bahkan dapat berguna dalam keadaan khusus, seperti di *debugger*.

source: Notice that code passed to ``exec()`` or ``eval()`` does not consider the classname of the invoking class to be the current class; this is similar to the effect of the ``global`` statement, the effect of which is likewise restricted to code that is byte-compiled together. The same restriction applies to ``getattr()``, ``setattr()`` and ``delattr()``, as well as when referencing ``__dict__`` directly.
id: Perhatikan bahwa kode yang dilewatkan ke ``exec()`` atau ``eval()`` tidak menganggap nama kelas *classname* dari kelas yang dipanggil sebagai kelas saat ini; ini mirip dengan efek pernyataan ``global``, yang efeknya juga terbatas pada kode yang dikompilasi-byte *byte-compiled* bersama. Pembatasan yang sama berlaku untuk ``getattr()``, ``setattr()`` dan ``delattr()``, serta saat mereferensikan ``__dict__`` secara langsung.

source: Odds and Ends
id: Barang Sisa *Odds and Ends*

source: Sometimes it is useful to have a data type similar to the Pascal "record" or C "struct", bundling together a few named data items. An empty class definition will do nicely::
id: Kadang-kadang berguna untuk memiliki tipe data yang mirip dengan "record" Pascal atau "struct" C, menyatukan beberapa item data bernama. Definisi kelas kosong akan menghasilkan hal tersebut dengan baik::

source: A piece of Python code that expects a particular abstract data type can often be passed a class that emulates the methods of that data type instead. For instance, if you have a function that formats some data from a file object, you can define a class with methods :meth:`read` and :meth:`!readline` that get the data from a string buffer instead, and pass it as an argument.
id: Sepotong kode Python yang mengharapkan tipe data abstrak tertentu sering dapat dilewatkan kelas yang mengemulasi metode tipe data itu sebagai gantinya. Misalnya, jika Anda memiliki fungsi yang memformat beberapa data dari objek file, Anda dapat mendefinisikan kelas dengan metode :meth:`read` dan :meth:`!readline` yang mendapatkan data dari buffer string sebagai gantinya, dan meneruskan itu sebagai argumen.

source: Instance method objects have attributes, too: ``m.__self__`` is the instance object with the method :meth:`m`, and ``m.__func__`` is the function object corresponding to the method.
id: Objek metode *instance* memiliki atribut, juga: ``m.__self__`` adalah objek instan dengan metode :meth:`m`, dan ``m.__func__`` adalah objek fungsi yang sesuai dengan metode tersebut.

source: By now you have probably noticed that most container objects can be looped over using a :keyword:`for` statement::
id: Sekarang Anda mungkin telah memperhatikan bahwa sebagian besar objek penampung *container* dapat dibuat perulangan menggunakan pernyataan :keyword:`for`::

source: This style of access is clear, concise, and convenient. The use of iterators pervades and unifies Python. Behind the scenes, the :keyword:`for` statement calls :func:`iter` on the container object. The function returns an iterator object that defines the method :meth:`~iterator.__next__` which accesses elements in the container one at a time. When there are no more elements, :meth:`~iterator.__next__` raises a :exc:`StopIteration` exception which tells the :keyword:`!for` loop to terminate. You can call the :meth:`~iterator.__next__` method using the :func:`next` built-in function; this example shows how it all works::
id: Gaya akses ini jelas, ringkas, dan nyaman. Penggunaan *iterator* meliputi *pervades* dan menyatukan Python. Di belakang layar, pernyataan :keyword:`for` memanggil :func:`iter` pada objek penampung *container*. Fungsi mengembalikan objek *iterator* yang mendefinisikan metode :meth:`~iterator.__next__` yang mengakses elemen dalam penampung *container* satu per satu. Ketika tidak ada lagi elemen, :meth:`~iterator.__next__` memunculkan pengecualian :exc:`StopIteration` yang memberi tahu perulangan :keyword:`!for` untuk mengakhiri. Anda dapat memanggil metode :meth:`~iterator.__next__` menggunakan :func:`next` fungsi bawaan; contoh ini menunjukkan cara kerjanya::

source: Having seen the mechanics behind the iterator protocol, it is easy to add iterator behavior to your classes. Define an :meth:`__iter__` method which returns an object with a :meth:`~iterator.__next__` method. If the class defines :meth:`__next__`, then :meth:`__iter__` can just return ``self``::
id: Setelah melihat mekanisme di balik protokol *iterator*, mudah untuk menambahkan perilaku *iterator* ke kelas Anda. Definisikan metode :meth:`__iter__` yang mengembalikan objek dengan metode :meth:`~iterator.__next__`. Jika kelas mendefinisikan :meth:`__next__`, maka :meth:`__iter__` bisa langsung mengembalikan ``self``::

source: Generators
id: Pembangkit *Generator*

source: :term:`Generators <generator>` are a simple and powerful tool for creating iterators. They are written like regular functions but use the :keyword:`yield` statement whenever they want to return data. Each time :func:`next` is called on it, the generator resumes where it left off (it remembers all the data values and which statement was last executed). An example shows that generators can be trivially easy to create::
id: :term:`Generators<generator>` adalah sebuah tool yang sederhana dan simpel untuk membuat sebuah iterasi. Itu ditulis seperti fungsi biasa tapi menggunakan pernyataan :keyword:`yield` setiap kali ingin mengembalikan sebuah data. Tiap kali :func:`next` itu dipanggil, generators tersebut akan melanjutkan di mana hal itu berhenti (itu akan mengingat semua nilai dan pernyataan mana yang terakhir dieksekusi). Sebuah contoh menunjukkan bahwa generator sangat mudah dibuat::

source: Anything that can be done with generators can also be done with class-based iterators as described in the previous section. What makes generators so compact is that the :meth:`__iter__` and :meth:`~generator.__next__` methods are created automatically.
id: Apa pun yang dapat dilakukan dengan pembangkit *generator* juga dapat dilakukan dengan *iterator* berbasis kelas seperti yang dijelaskan pada bagian sebelumnya. Apa yang membuat pembangkit *generator* sangat kompak adalah bahwa metode :meth:`__iter__` dan :meth:`~generator.__next__` dibuat secara otomatis.

source: Another key feature is that the local variables and execution state are automatically saved between calls. This made the function easier to write and much more clear than an approach using instance variables like ``self.index`` and ``self.data``.
id: Fitur utama lainnya adalah variabel lokal dan status eksekusi secara otomatis disimpan di antara pemanggilan. Ini membuat fungsi lebih mudah untuk ditulis dan jauh lebih jelas daripada pendekatan menggunakan variabel instan seperti ``self.index`` dan ``self.data``.

source: In addition to automatic method creation and saving program state, when generators terminate, they automatically raise :exc:`StopIteration`. In combination, these features make it easy to create iterators with no more effort than writing a regular function.
id: Selain pembuatan metode otomatis dan menyimpan status program, ketika pembangkit *generator* berhenti, mereka secara otomatis menimbulkan :exc:`StopIteration`. Secara kombinasi, fitur-fitur ini membuatnya mudah untuk membuat *iterator* tanpa lebih dari sekadar menulis fungsi biasa.

source: Generator Expressions
id: Ekspresi Pembangkit *Generator*

source: Some simple generators can be coded succinctly as expressions using a syntax similar to list comprehensions but with parentheses instead of square brackets. These expressions are designed for situations where the generator is used right away by an enclosing function. Generator expressions are more compact but less versatile than full generator definitions and tend to be more memory friendly than equivalent list comprehensions.
id: Beberapa pembangkit *generators* sederhana dapat dikodekan secara ringkas sebagai ekspresi menggunakan sintaksis yang mirip dengan pemahaman daftar *list comprehensions* tetapi dengan tanda kurung bukan dengan tanda kurung siku. Ungkapan-ungkapan ini dirancang untuk situasi di mana *generator* digunakan segera oleh fungsi penutup. Ekspresi *generator* lebih kompak tetapi kurang fleksibel daripada definisi *generator* penuh dan cenderung lebih ramah memori daripada pemahaman daftar *list comprehensions* setara.

source: Examples::
id: Contoh::

source: Footnotes
id: Catatan kaki

source: Except for one thing. Module objects have a secret read-only attribute called :attr:`~object.__dict__` which returns the dictionary used to implement the module's namespace; the name :attr:`~object.__dict__` is an attribute but not a global name. Obviously, using this violates the abstraction of namespace implementation, and should be restricted to things like post-mortem debuggers.
id: Kecuali satu hal. Objek modul memiliki atribut baca-saja *read-only* rahasia bernama :attr:`~object.__dict__` yang mengembalikan kamus *dictionary* yang digunakan untuk mengimplementasikan *namespace* modul; nama :attr:`~object.__ dict__` adalah atribut tetapi bukan nama global. Jelas, menggunakan ini melanggar abstraksi implementasi *namespace*, dan harus dibatasi untuk hal-hal seperti *debuggers* *post-mortem*.
