Repository: python/python-docs-id
Catalog: python-newest.tutorial--classes/*.po
Languages: id

source: then ``MyClass.i`` and ``MyClass.f`` are valid attribute references, returning an integer and a function object, respectively. Class attributes can also be assigned to, so you can change the value of ``MyClass.i`` by assignment. :attr:`__doc__` is also a valid attribute, returning the docstring belonging to the class: ``"A simple example class"``.
id: kemudian ``MyClass.i`` dan ``MyClass.f`` adalah referensi atribut yang valid, masing-masing mengembalikan integer dan objek fungsi. Atribut kelas juga dapat ditetapkan, sehingga Anda dapat mengubah nilai ``MyClass.i`` oleh penugasan. :attr:`__doc__` juga merupakan atribut yang valid, mengembalikan *docstring* milik kelas: ``"A simple example class"``.

source: Class *instantiation* uses function notation. Just pretend that the class object is a parameterless function that returns a new instance of the class. For example (assuming the above class)::
id: *instantiation* kelas menggunakan notasi fungsi. Hanya berpura-pura bahwa objek kelas adalah fungsi tanpa parameter yang mengembalikan instance baru dari kelas. Misalnya (dengan asumsi kelas di atas)::

source: creates a new *instance* of the class and assigns this object to the local variable ``x``.
id: membuat *instance* baru dari kelas dan menetapkan objek ini ke variabel lokal ``x``.

source: The instantiation operation ("calling" a class object) creates an empty object. Many classes like to create objects with instances customized to a specific initial state. Therefore a class may define a special method named :meth:`__init__`, like this::
id: Operasi instansiasi ("calling" objek kelas) membuat objek kosong. Banyak kelas suka membuat objek dengan *instance* yang disesuaikan dengan kondisi awal tertentu. Oleh karena itu sebuah kelas dapat mendefinisikan metode khusus bernama :meth:`__init__`, seperti ini::

source: When a class defines an :meth:`__init__` method, class instantiation automatically invokes :meth:`__init__` for the newly-created class instance. So in this example, a new, initialized instance can be obtained by::
id: Ketika sebuah kelas mendefinisikan metode :meth:`__init__`, instantiasi kelas secara otomatis memanggil :meth:`__init__` untuk instance kelas yang baru dibuat. Jadi dalam contoh ini, contoh baru yang diinisialisasi dapat diperoleh oleh::

source: Of course, the :meth:`__init__` method may have arguments for greater flexibility. In that case, arguments given to the class instantiation operator are passed on to :meth:`__init__`. For example, ::
id: Tentu saja, metode :meth:`__init__` mungkin memiliki argumen untuk fleksibilitas yang lebih besar. Dalam hal itu, argumen yang diberikan kepada operator instantiasi kelas diteruskan ke :meth:`__init__`. Sebagai contoh, ::

source: Instance Objects
id: Objek *Instance*

source: Now what can we do with instance objects? The only operations understood by instance objects are attribute references. There are two kinds of valid attribute names: data attributes and methods.
id: Sekarang apa yang bisa kita lakukan dengan objek instan? Satu-satunya operasi yang dipahami oleh objek instan adalah referensi atribut. Ada dua jenis nama atribut yang valid: atribut data, dan metode.

source: *data attributes* correspond to "instance variables" in Smalltalk, and to "data members" in C++. Data attributes need not be declared; like local variables, they spring into existence when they are first assigned to. For example, if ``x`` is the instance of :class:`MyClass` created above, the following piece of code will print the value ``16``, without leaving a trace::
id: *data attributes* sesuai dengan "variabel instan" di Smalltalk, dan "data members" di C++. Atribut data tidak perlu dinyatakan; seperti variabel lokal, mereka muncul ketika mereka pertama kali ditugaskan. Misalnya, jika ``x`` adalah turunan dari :class:`MyClass` yang dibuat di atas, bagian kode berikut akan mencetak nilai ``16``, tanpa meninggalkan jejak::

source: The other kind of instance attribute reference is a *method*. A method is a function that "belongs to" an object. (In Python, the term method is not unique to class instances: other object types can have methods as well. For example, list objects have methods called append, insert, remove, sort, and so on. However, in the following discussion, we'll use the term method exclusively to mean methods of class instance objects, unless explicitly stated otherwise.)
id: Jenis lain dari referensi atribut instance adalah *method*. Metode adalah fungsi yang "milik" suatu objek. (Dalam Python, istilah metode tidak unik untuk instance kelas: tipe objek lain dapat memiliki metode juga. Misalnya, objek daftar memiliki metode yang disebut *append*, *insert*, *remove*, *sort*, dan sebagainya. Namun, dalam diskusi berikut, kita akan menggunakan istilah metode secara eksklusif untuk mengartikan metode objek *instance* kelas, kecuali dinyatakan secara eksplisit.)

source: Valid method names of an instance object depend on its class. By definition, all attributes of a class that are function objects define corresponding methods of its instances. So in our example, ``x.f`` is a valid method reference, since ``MyClass.f`` is a function, but ``x.i`` is not, since ``MyClass.i`` is not. But ``x.f`` is not the same thing as ``MyClass.f`` --- it is a *method object*, not a function object.
id: Nama metode yang valid dari objek *instance* bergantung pada kelasnya. Menurut definisi, semua atribut dari kelas yang merupakan objek fungsi menentukan metode yang sesuai dari *instance*-nya. Jadi dalam contoh kita, ``x.f`` adalah referensi metode yang valid, karena ``MyClass.f`` adalah fungsi, tetapi ``x.i`` tidak, karena ``MyClass.i`` tidak. Tetapi ``x.f`` bukan hal yang sama dengan ``MyClass.f`` --- itu adalah *method object*, bukan objek fungsi.

source: Method Objects
id: Metode Objek

source: Usually, a method is called right after it is bound::
id: Biasanya, metode dipanggil tepat setelah itu terikat::

source: In the :class:`MyClass` example, this will return the string ``'hello world'``. However, it is not necessary to call a method right away: ``x.f`` is a method object, and can be stored away and called at a later time. For example::
id: Dalam contoh :class:`MyClass`, ini akan mengembalikan string ``'hello world'``. Namun, tidak perlu memanggil metode segera: ``x.f`` adalah metode objek, dan dapat disimpan dan dipanggil di lain waktu. Sebagai contoh::

source: will continue to print ``hello world`` until the end of time.
id: akan terus mencetak ``hello world`` hingga akhir waktu.

source: What exactly happens when a method is called? You may have noticed that ``x.f()`` was called without an argument above, even though the function definition for :meth:`f` specified an argument. What happened to the argument? Surely Python raises an exception when a function that requires an argument is called without any --- even if the argument isn't actually used...
id: Apa yang sebenarnya terjadi ketika suatu metode dipanggil? Anda mungkin telah memperhatikan bahwa ``x.f()`` dipanggil tanpa argumen di atas, meskipun definisi fungsi untuk :meth:`f` menentukan argumen. Apa yang terjadi dengan argumen itu? Tentunya Python memunculkan pengecualian ketika fungsi yang membutuhkan argumen dipanggil tanpa --- bahkan jika argumen tersebut tidak benar-benar digunakan...

source: Actually, you may have guessed the answer: the special thing about methods is that the instance object is passed as the first argument of the function. In our example, the call ``x.f()`` is exactly equivalent to ``MyClass.f(x)``. In general, calling a method with a list of *n* arguments is equivalent to calling the corresponding function with an argument list that is created by inserting the method's instance object before the first argument.
id: Sebenarnya, Anda mungkin sudah menebak jawabannya: hal khusus tentang metode adalah objek *instance* dilewatkan sebagai argumen pertama dari fungsi. Dalam contoh kita, panggilan ``x.f()`` persis sama dengan ``MyClass.f(x)``. Secara umum, memanggil metode dengan daftar argumen *n* setara dengan memanggil fungsi yang sesuai dengan daftar argumen yang dibuat dengan menyisipkan objek contoh metode sebelum argumen pertama.

source: If you still don't understand how methods work, a look at the implementation can perhaps clarify matters. When a non-data attribute of an instance is referenced, the instance's class is searched. If the name denotes a valid class attribute that is a function object, a method object is created by packing (pointers to) the instance object and the function object just found together in an abstract object: this is the method object. When the method object is called with an argument list, a new argument list is constructed from the instance object and the argument list, and the function object is called with this new argument list.
id: Jika Anda masih tidak mengerti bagaimana metode bekerja, melihat implementasi mungkin dapat mengklarifikasi masalah. Ketika atribut non-data dari sebuah *instance* direferensikan, kelas *instance* tersebut dicari. Jika nama menunjukkan atribut kelas yang valid yang merupakan objek fungsi, objek metode dibuat dengan mengemas (menunjuk *pointers* ke) objek *instance* dan objek fungsi yang baru saja ditemukan bersama dalam objek abstrak: ini adalah objek metode. Ketika objek metode dipanggil dengan daftar argumen, daftar argumen baru dibangun dari objek instance dan daftar argumen, dan objek fungsi dipanggil dengan daftar argumen baru ini.

source: Class and Instance Variables
id: Variabel Kelas dan *Instance*

source: Generally speaking, instance variables are for data unique to each instance and class variables are for attributes and methods shared by all instances of the class::
id: Secara umum, variabel *instance* adalah untuk data unik untuk setiap *instance* dan variabel kelas adalah untuk atribut dan metode yang dibagikan oleh semua *instance* kelas::

source: As discussed in :ref:`tut-object`, shared data can have possibly surprising effects with involving :term:`mutable` objects such as lists and dictionaries. For example, the *tricks* list in the following code should not be used as a class variable because just a single list would be shared by all *Dog* instances::
id: Seperti yang dibahas dalam :ref:`tut-object`, data bersama dapat memiliki efek yang mengejutkan dengan melibatkan objek :term:`mutable` seperti daftar *lists* dan kamus *dictionaries*. Sebagai contoh, daftar *tricks* dalam kode berikut tidak boleh digunakan sebagai variabel kelas karena hanya satu daftar yang akan dibagikan oleh semua *Dog* instance::

source: Correct design of the class should use an instance variable instead::
id: Desain kelas yang benar harus menggunakan variabel *instance* sebagai gantinya::

source: Random Remarks
id: Keterangan Acak

source: If the same attribute name occurs in both an instance and in a class, then attribute lookup prioritizes the instance::
id: Jika nama atribut yang sama muncul di kedua *instance* dan di kelas, maka pencarian atribut memprioritaskan *instance*::

source: Data attributes may be referenced by methods as well as by ordinary users ("clients") of an object. In other words, classes are not usable to implement pure abstract data types. In fact, nothing in Python makes it possible to enforce data hiding --- it is all based upon convention. (On the other hand, the Python implementation, written in C, can completely hide implementation details and control access to an object if necessary; this can be used by extensions to Python written in C.)
id: Atribut data dapat dirujuk oleh metode dan juga oleh pengguna biasa ("clients") dari suatu objek. Dengan kata lain, kelas tidak dapat digunakan untuk mengimplementasikan tipe data abstrak murni. Faktanya, tidak ada dalam Python yang memungkinkan untuk menegakkan *enforce* data yang disembunyikan --- semuanya didasarkan pada konvensi. (Di sisi lain, implementasi Python, ditulis dalam C, dapat sepenuhnya menyembunyikan detail implementasi dan mengontrol akses ke objek jika perlu; ini dapat digunakan oleh ekstensi ke Python yang ditulis dalam C.)

source: Clients should use data attributes with care --- clients may mess up invariants maintained by the methods by stamping on their data attributes. Note that clients may add data attributes of their own to an instance object without affecting the validity of the methods, as long as name conflicts are avoided --- again, a naming convention can save a lot of headaches here.
id: Klien harus menggunakan atribut data dengan hati-hati --- klien dapat mengacaukan invarian yang dikelola oleh metode dengan menginjak *stamping* atribut data mereka. Perhatikan bahwa klien dapat menambahkan atribut data mereka sendiri ke objek *instance* tanpa memengaruhi validitas metode, asalkan konflik nama dihindari --- sekali lagi, konvensi penamaan dapat menghindarkan dari banyak sakit kepala di sini.

source: There is no shorthand for referencing data attributes (or other methods!) from within methods. I find that this actually increases the readability of methods: there is no chance of confusing local variables and instance variables when glancing through a method.
id: Tidak ada istilah untuk referensi atribut data (atau metode lain!) dari dalam metode. Saya menemukan bahwa ini sebenarnya meningkatkan keterbacaan metode: tidak ada kemungkinan membingungkan variabel lokal dan variabel *instance* ketika melirik *glancing* melalui metode.

source: Often, the first argument of a method is called ``self``. This is nothing more than a convention: the name ``self`` has absolutely no special meaning to Python. Note, however, that by not following the convention your code may be less readable to other Python programmers, and it is also conceivable that a *class browser* program might be written that relies upon such a convention.
id: Seringkali, argumen pertama dari suatu metode disebut ``self``. Ini tidak lebih dari sebuah konvensi: nama ``self`` sama sekali tidak memiliki arti khusus untuk Python. Perhatikan, bagaimanapun, bahwa dengan tidak mengikuti konvensi kode Anda mungkin kurang dapat dibaca oleh programmer Python lain, dan juga dapat dibayangkan bahwa program *class browser* dapat ditulis yang bergantung pada konvensi semacam itu.

source: Any function object that is a class attribute defines a method for instances of that class. It is not necessary that the function definition is textually enclosed in the class definition: assigning a function object to a local variable in the class is also ok. For example::
id: Objek fungsi apa pun yang merupakan atribut kelas menentukan metode untuk *instance* dari kelas itu. Tidak perlu bahwa definisi fungsi tertutup secara teks dalam definisi kelas: menetapkan objek fungsi ke variabel lokal di kelas juga ok. Sebagai contoh::

source: Now ``f``, ``g`` and ``h`` are all attributes of class :class:`C` that refer to function objects, and consequently they are all methods of instances of :class:`C` --- ``h`` being exactly equivalent to ``g``. Note that this practice usually only serves to confuse the reader of a program.
id: Sekarang ``f``, ``g`` dan ``h`` adalah semua atribut class :class:`C` yang merujuk ke objek-objek fungsi, dan akibatnya semuanya adalah metode instance dari :class:`C` --- ``h`` sama persis dengan ``g``. Perhatikan bahwa praktik ini biasanya hanya membingungkan pembaca program.

source: Methods may call other methods by using method attributes of the ``self`` argument::
id: Metode dapat memanggil metode lain dengan menggunakan atribut metode dari argumen ``self``::

source: Methods may reference global names in the same way as ordinary functions. The global scope associated with a method is the module containing its definition. (A class is never used as a global scope.) While one rarely encounters a good reason for using global data in a method, there are many legitimate uses of the global scope: for one thing, functions and modules imported into the global scope can be used by methods, as well as functions and classes defined in it. Usually, the class containing the method is itself defined in this global scope, and in the next section we'll find some good reasons why a method would want to reference its own class.
id: Metode dapat merujuk nama global dengan cara yang sama seperti fungsi biasa. Ruang lingkup *scope* global yang terkait dengan suatu metode adalah modul yang berisi definisinya. (Kelas tidak pernah digunakan sebagai ruang lingkup *scope* global.) Sementara seseorang jarang menemukan alasan yang baik untuk menggunakan data global dalam suatu metode, ada banyak penggunaan sah lingkup global: untuk satu hal, fungsi dan modul yang diimpor ke dalam lingkup global dapat digunakan oleh metode, serta fungsi dan kelas yang didefinisikan di dalamnya. Biasanya, kelas yang berisi metode itu sendiri didefinisikan dalam lingkup global ini, dan di bagian selanjutnya kita akan menemukan beberapa alasan bagus mengapa suatu metode ingin merujuk kelasnya sendiri.

source: Each value is an object, and therefore has a *class* (also called its *type*). It is stored as ``object.__class__``.
id: Setiap nilai adalah objek, dan karenanya memiliki *kelas* (juga disebut sebagai *type*). Ini disimpan sebagai ``object.__class__``.

source: Inheritance
id: Pewarisan

source: Of course, a language feature would not be worthy of the name "class" without supporting inheritance. The syntax for a derived class definition looks like this::
id: Tentu saja, fitur bahasa tidak akan layak untuk nama "class" tanpa mendukung pewarisan. Sintaks untuk definisi kelas turunan terlihat seperti ini::

source: The name :class:`BaseClassName` must be defined in a scope containing the derived class definition. In place of a base class name, other arbitrary expressions are also allowed. This can be useful, for example, when the base class is defined in another module::
id: Nama :class:`BaseClassName` harus didefinisikan dalam lingkup yang berisi definisi kelas turunan. Di tempat nama kelas dasar, ekspresi berubah-ubah *arbitrary* lainnya juga diperbolehkan. Ini bisa berguna, misalnya, ketika kelas dasar didefinisikan dalam modul lain::

source: Execution of a derived class definition proceeds the same as for a base class. When the class object is constructed, the base class is remembered. This is used for resolving attribute references: if a requested attribute is not found in the class, the search proceeds to look in the base class. This rule is applied recursively if the base class itself is derived from some other class.
id: Eksekusi definisi kelas turunan menghasilkan sama seperti untuk kelas dasar. Ketika objek kelas dibangun, kelas dasar diingat. Ini digunakan untuk menyelesaikan referensi atribut: jika atribut yang diminta tidak ditemukan di kelas, pencarian dilanjutkan untuk mencari di kelas dasar. Aturan ini diterapkan secara rekursif jika kelas dasar itu sendiri berasal dari beberapa kelas lain.

source: There's nothing special about instantiation of derived classes: ``DerivedClassName()`` creates a new instance of the class. Method references are resolved as follows: the corresponding class attribute is searched, descending down the chain of base classes if necessary, and the method reference is valid if this yields a function object.
id: Tidak ada yang istimewa tentang instance kelas turunan: ``DerivedClassName()`` membuat instance baru dari kelas. Referensi metode diselesaikan sebagai berikut: atribut kelas yang sesuai dicari, turun rantai kelas dasar jika perlu, dan referensi metode ini valid jika ini menghasilkan objek fungsi.

source: Derived classes may override methods of their base classes. Because methods have no special privileges when calling other methods of the same object, a method of a base class that calls another method defined in the same base class may end up calling a method of a derived class that overrides it. (For C++ programmers: all methods in Python are effectively ``virtual``.)
id: Kelas turunan dapat menimpa metode kelas dasar mereka. Karena metode tidak memiliki hak khusus ketika memanggil metode lain dari objek yang sama, metode kelas dasar yang memanggil metode lain yang didefinisikan dalam kelas dasar yang sama mungkin akhirnya memanggil metode kelas turunan yang menimpanya. (Untuk programmer C++: semua metode dalam Python secara efektif ``virtual``.)

source: An overriding method in a derived class may in fact want to extend rather than simply replace the base class method of the same name. There is a simple way to call the base class method directly: just call ``BaseClassName.methodname(self, arguments)``. This is occasionally useful to clients as well. (Note that this only works if the base class is accessible as ``BaseClassName`` in the global scope.)
id: Menimpa metode dalam kelas turunan mungkin sebenarnya ingin memperluas daripada hanya mengganti metode kelas dasar dengan nama yang sama. Ada cara sederhana untuk memanggil metode kelas dasar secara langsung: cukup panggil ``BaseClassName.methodname(self, arguments)``. Ini kadang-kadang berguna untuk klien juga. (Perhatikan bahwa ini hanya berfungsi jika kelas dasar dapat diakses sebagai ``BaseClassName`` dalam lingkup global.)

source: Python has two built-in functions that work with inheritance:
id: Python memiliki dua fungsi bawaan yang bekerja dengan warisan:

source: Use :func:`isinstance` to check an instance's type: ``isinstance(obj, int)`` will be ``True`` only if ``obj.__class__`` is :class:`int` or some class derived from :class:`int`.
id: Gunakan :func:`isinstance` untuk memeriksa jenis instance: ``isinstance(obj, int)`` akan menjadi ``True`` hanya jika ``obj.__class__`` adalah :class:`int` atau beberapa kelas yang diturunkan dari :class:`int`.

source: Use :func:`issubclass` to check class inheritance: ``issubclass(bool, int)`` is ``True`` since :class:`bool` is a subclass of :class:`int`. However, ``issubclass(float, int)`` is ``False`` since :class:`float` is not a subclass of :class:`int`.
id: Gunakan :func:`issubclass` untuk memeriksa warisan kelas: ``issubclass(bool, int)``adalah ``True`` karena :class:`bool` adalah subkelas dari :class:`int`. Namun, ``issubclass(float, int)`` adalah ``False`` karena :class:`float` bukan subkelas dari :class:`int`.

source: Multiple Inheritance
id: Pewarisan Berganda

source: Python supports a form of multiple inheritance as well. A class definition with multiple base classes looks like this::
id: Python mendukung bentuk pewarisan berganda juga. Definisi kelas dengan beberapa kelas dasar terlihat seperti ini::

source: For most purposes, in the simplest cases, you can think of the search for attributes inherited from a parent class as depth-first, left-to-right, not searching twice in the same class where there is an overlap in the hierarchy. Thus, if an attribute is not found in :class:`DerivedClassName`, it is searched for in :class:`Base1`, then (recursively) in the base classes of :class:`Base1`, and if it was not found there, it was searched for in :class:`Base2`, and so on.
id: Untuk sebagian besar tujuan, dalam kasus paling sederhana, Anda dapat menganggap pencarian atribut yang diwarisi dari kelas induk sebagai kedalaman-pertama *depth-first*, kiri-ke-kanan, bukan mencari dua kali di kelas yang sama di mana ada tumpang tindih dalam hierarki. Dengan demikian, jika atribut tidak ditemukan di :class:`DerivedClassName`, itu dicari di :class:`Base1`, kemudian (secara rekursif) di kelas dasar dari :class:`Base1`, dan jika tidak ditemukan di sana, itu dicari di :class:`Base2`, dan seterusnya.
