Repository: python/python-docs-id
Catalog: python-newest.tutorial--classes/*.po
Languages: id

source: Classes provide a means of bundling data and functionality together. Creating a new class creates a new *type* of object, allowing new *instances* of that type to be made. Each class instance can have attributes attached to it for maintaining its state. Class instances can also have methods (defined by its class) for modifying its state.
id: *Classes* atau kelas-kelas menyediakan sarana untuk menggabungkan data dan fungsionalitas bersama. Membuat sebuah *class* baru menghasilkan objek dengan *type* baru, memungkinkan dibuat *instance* baru dari tipe itu. Setiap *instance* dari *class* dapat memiliki atribut yang melekat padanya untuk mempertahankan kondisinya. *Instance* dari sebuah *class* juga dapat memiliki metode (ditentukan oleh *class*) untuk memodifikasi kondisinya.

source: Compared with other programming languages, Python's class mechanism adds classes with a minimum of new syntax and semantics. It is a mixture of the class mechanisms found in C++ and Modula-3. Python classes provide all the standard features of Object Oriented Programming: the class inheritance mechanism allows multiple base classes, a derived class can override any methods of its base class or classes, and a method can call the method of a base class with the same name. Objects can contain arbitrary amounts and kinds of data. As is true for modules, classes partake of the dynamic nature of Python: they are created at runtime, and can be modified further after creation.
id: Dibandingkan dengan bahasa pemrograman lain, mekanisme kelas Python menambah kelas dengan minimum sintaksis dan semantik baru. Ini adalah campuran dari mekanisme kelas yang ditemukan dalam C++ dan Modula-3. Kelas Python menyediakan semua fitur standar Pemrograman Berorientasi Objek: mekanisme pewarisan kelas memungkinkan beberapa kelas dasar, kelas turunan dapat menimpa metode apa pun dari kelas dasar atau kelasnya, dan metode dapat memanggil metode kelas dasar dengan nama yang sama . Objek dapat berisi jumlah dan jenis data yang berubah-ubah. Seperti halnya untuk modul, kelas mengambil bagian dari sifat dinamis Python: mereka dibuat pada saat runtime, dan dapat dimodifikasi lebih lanjut setelah pembuatan.

source: In C++ terminology, normally class members (including the data members) are *public* (except see below :ref:`tut-private`), and all member functions are *virtual*. As in Modula-3, there are no shorthands for referencing the object's members from its methods: the method function is declared with an explicit first argument representing the object, which is provided implicitly by the call. As in Smalltalk, classes themselves are objects. This provides semantics for importing and renaming. Unlike C++ and Modula-3, built-in types can be used as base classes for extension by the user. Also, like in C++, most built-in operators with special syntax (arithmetic operators, subscripting etc.) can be redefined for class instances.
id: Dalam terminologi C++, biasanya anggota kelas (termasuk anggota data) adalah *public* (kecuali lihat di bawah :ref:`tut-private`), dan semua fungsi anggota adalah *virtual*. Seperti dalam Modula-3, tidak ada singkatan untuk merujuk anggota objek dari metodenya: fungsi metode dideklarasikan dengan argumen pertama eksplisit yang mewakili objek, yang diberikan secara implisit oleh panggilan. Seperti dalam Smalltalk, kelas itu sendiri adalah objek. Ini memberikan semantik untuk mengimpor dan mengganti nama. Tidak seperti C++ dan Modula-3, tipe bawaan dapat digunakan sebagai kelas dasar untuk ekstensi oleh pengguna. Juga, seperti di C++, sebagian besar operator bawaan dengan sintaks khusus (operator aritmatika, *subscripting* dll) dapat didefinisikan ulang untuk *instance* kelas.

source: (Lacking universally accepted terminology to talk about classes, I will make occasional use of Smalltalk and C++ terms. I would use Modula-3 terms, since its object-oriented semantics are closer to those of Python than C++, but I expect that few readers have heard of it.)
id: (Kurangnya terminologi yang diterima secara universal untuk berbicara tentang kelas, saya akan sesekali menggunakan istilah Smalltalk dan C++. Saya akan menggunakan istilah Modula-3, karena semantik berorientasi objeknya lebih dekat dengan Python daripada C++, tapi saya berharap bahwa beberapa pembaca pernah mendengarnya.)

source: A Word About Names and Objects
id: Sepatah Kata Tentang Nama dan Objek

source: Objects have individuality, and multiple names (in multiple scopes) can be bound to the same object. This is known as aliasing in other languages. This is usually not appreciated on a first glance at Python, and can be safely ignored when dealing with immutable basic types (numbers, strings, tuples). However, aliasing has a possibly surprising effect on the semantics of Python code involving mutable objects such as lists, dictionaries, and most other types. This is usually used to the benefit of the program, since aliases behave like pointers in some respects. For example, passing an object is cheap since only a pointer is passed by the implementation; and if a function modifies an object passed as an argument, the caller will see the change --- this eliminates the need for two different argument passing mechanisms as in Pascal.
id: Objek memiliki individualitas, dan banyak nama (dalam berbagai lingkup) dapat terikat ke objek yang sama. Ini dikenal sebagai *aliasing* dalam bahasa lain. Ini biasanya tidak dihargai pada pandangan pertama pada Python, dan dapat diabaikan dengan aman ketika berhadapan dengan tipe dasar yang tidak dapat diubah (angka, string, *tuple*). Namun, *aliasing* memiliki efek yang mungkin mengejutkan pada semantik kode Python yang melibatkan objek yang bisa berubah seperti daftar *list*, kamus *dictionary*, dan sebagian besar jenis lainnya. Ini biasanya digunakan untuk kepentingan program, karena alias berperilaku seperti *pointers* dalam beberapa hal. Sebagai contoh, melewatkan objek adalah murah karena hanya sebuah *pointer* dilewatkan oleh implementasi; dan jika suatu fungsi memodifikasi objek yang dilewatkan sebagai argumen, pemanggil akan melihat perubahan --- ini menghilangkan kebutuhan untuk dua mekanisme yang berbeda melewatkan argumen *argument passing* seperti dalam Pascal.

source: Python Scopes and Namespaces
id: Lingkup Python dan *Namespaces*

source: Before introducing classes, I first have to tell you something about Python's scope rules. Class definitions play some neat tricks with namespaces, and you need to know how scopes and namespaces work to fully understand what's going on. Incidentally, knowledge about this subject is useful for any advanced Python programmer.
id: Sebelum memperkenalkan kelas, pertama-tama saya harus memberi tahu Anda tentang aturan ruang lingkup *scope* Python. Definisi kelas memainkan beberapa trik rapi dengan ruang nama *namespaces*, dan Anda perlu tahu bagaimana ruang lingkup dan ruang nama *namespaces* bekerja untuk sepenuhnya memahami apa yang terjadi. Kebetulan, pengetahuan tentang subjek ini berguna untuk programmer Python tingkat lanjut.

source: Let's begin with some definitions.
id: Mari kita mulai dengan beberapa definisi.

source: A *namespace* is a mapping from names to objects. Most namespaces are currently implemented as Python dictionaries, but that's normally not noticeable in any way (except for performance), and it may change in the future. Examples of namespaces are: the set of built-in names (containing functions such as :func:`abs`, and built-in exception names); the global names in a module; and the local names in a function invocation. In a sense the set of attributes of an object also form a namespace. The important thing to know about namespaces is that there is absolutely no relation between names in different namespaces; for instance, two different modules may both define a function ``maximize`` without confusion --- users of the modules must prefix it with the module name.
id: Sebuah *namespace* adalah pemetaan dari nama ke objek. Sebagian besar ruang nama *namespace* saat ini diimplementasikan sebagai kamus *dictionary* Python, tetapi itu biasanya tidak terlihat dengan cara apa pun (kecuali untuk kinerja), dan itu mungkin berubah di masa depan. Contoh ruang nama *namespace* adalah: himpunan nama bawaan (berisi fungsi seperti :func:`abs`, dan nama pengecualian bawaan); nama-nama global dalam sebuah modul; dan nama-nama lokal dalam pemanggilan fungsi. Dalam arti himpunan atribut suatu objek juga membentuk *namespace*. Hal penting yang perlu diketahui tentang ruang nama *namespace* adalah sama sekali tidak ada hubungan antara nama dalam ruang nama *namespace* yang berbeda; misalnya, dua modul yang berbeda dapat mendefinisikan fungsi ``maximize`` tanpa kebingungan --- pengguna modul harus memberikan awalan dengan nama modul.

source: By the way, I use the word *attribute* for any name following a dot --- for example, in the expression ``z.real``, ``real`` is an attribute of the object ``z``. Strictly speaking, references to names in modules are attribute references: in the expression ``modname.funcname``, ``modname`` is a module object and ``funcname`` is an attribute of it. In this case there happens to be a straightforward mapping between the module's attributes and the global names defined in the module: they share the same namespace! [#]_
id: Ngomong-ngomong, saya menggunakan kata *attribute* untuk nama apa pun yang mengikuti titik --- misalnya, dalam ekspresi ``z.real``, ``real`` adalah atribut dari objek ``z`` . Sebenarnya, referensi ke nama dalam modul adalah referensi atribut: dalam ekspresi ``modname.funcname``, ``modname`` adalah objek modul dan ``funcname`` adalah atributnya. Dalam kasus ini akan terjadi pemetaan langsung antara atribut modul dan nama global yang didefinisikan dalam modul: mereka berbagi namespace yang sama! [#]_

source: Attributes may be read-only or writable. In the latter case, assignment to attributes is possible. Module attributes are writable: you can write ``modname.the_answer = 42``. Writable attributes may also be deleted with the :keyword:`del` statement. For example, ``del modname.the_answer`` will remove the attribute :attr:`the_answer` from the object named by ``modname``.
id: Atribut dapat baca-saja *read-only* atau dapat ditulis. Dalam kasus terakhir, pemberian nilai ke atribut dimungkinkan. Atribut modul dapat ditulis: Anda dapat menulis ``modname.the_answer = 42``. Atribut yang dapat ditulis juga dapat dihapus dengan pernyataan :keyword:`del`. Sebagai contoh, ``del modname.the_answer`` akan menghapus atribut :attr:`the_answer` dari objek yang dinamai oleh ``modname``.

source: Namespaces are created at different moments and have different lifetimes. The namespace containing the built-in names is created when the Python interpreter starts up, and is never deleted. The global namespace for a module is created when the module definition is read in; normally, module namespaces also last until the interpreter quits. The statements executed by the top-level invocation of the interpreter, either read from a script file or interactively, are considered part of a module called :mod:`__main__`, so they have their own global namespace. (The built-in names actually also live in a module; this is called :mod:`builtins`.)
id: *Namespace* dibuat pada saat yang berbeda dan memiliki masa hidup yang berbeda. *Namespace* yang berisi nama-nama bawaan dibuat ketika interpreter Python dimulai, dan tidak pernah dihapus. *Namespace* global untuk modul dibuat ketika definisi modul dibaca; biasanya, *namespace* modul juga bertahan hingga *interpreter* berhenti. Pernyataan yang dieksekusi oleh pemanggilan *interpreter* tingkat atas, baik membaca dari file skrip atau secara interaktif, dianggap sebagai bagian dari modul yang disebut :mod:`__main__`, sehingga mereka memiliki namespace global sendiri. (Nama bawaan sebenarnya juga hidup dalam modul; ini disebut :mod:`builtins`.)

source: The local namespace for a function is created when the function is called, and deleted when the function returns or raises an exception that is not handled within the function. (Actually, forgetting would be a better way to describe what actually happens.) Of course, recursive invocations each have their own local namespace.
id: *Namespace* lokal untuk suatu fungsi dibuat ketika fungsi dipanggil, dan dihapus ketika fungsi kembali *returns* atau memunculkan pengecualian yang tidak ditangani dalam fungsi tersebut. (Sebenarnya, melupakan akan menjadi cara yang lebih baik untuk menggambarkan apa yang sebenarnya terjadi.) Tentu saja, pemanggilan rekursif masing-masing memiliki ruang-nama *namespace* lokal mereka sendiri.

source: A *scope* is a textual region of a Python program where a namespace is directly accessible. "Directly accessible" here means that an unqualified reference to a name attempts to find the name in the namespace.
id: Suatu *scope* adalah wilayah tekstual dari program Python di mana *namespace* dapat diakses secara langsung. "Directly accessible" di sini berarti bahwa referensi yang tidak memenuhi syarat untuk suatu nama berusaha menemukan nama tersebut di *namespace*.

source: Although scopes are determined statically, they are used dynamically. At any time during execution, there are 3 or 4 nested scopes whose namespaces are directly accessible:
id: Meskipun cakupan *scopes* ditentukan secara statis, mereka digunakan secara dinamis. Setiap saat selama eksekusi, setidaknya ada 3 atau 4 cakupan bersarang yang ruang nama-nya *namespaces* dapat diakses secara langsung:

source: the innermost scope, which is searched first, contains the local names
id: ruang lingkup *scope* terdalam, yang dicari pertama kali, berisi nama-nama lokal

source: the scopes of any enclosing functions, which are searched starting with the nearest enclosing scope, contains non-local, but also non-global names
id: lingkup *scope* dari setiap fungsi penutup, yang dicari dimulai dengan lingkup penutup terdekat, berisi nama-nama non-lokal, tetapi juga non-global

source: the next-to-last scope contains the current module's global names
id: lingkup berikutnya *next-to-last* berisi nama global modul saat ini

source: the outermost scope (searched last) is the namespace containing built-in names
id: ruang lingkup *scope* terluar (dicari terakhir) adalah *namespace* yang mengandung nama bawaan

source: If a name is declared global, then all references and assignments go directly to the middle scope containing the module's global names. To rebind variables found outside of the innermost scope, the :keyword:`nonlocal` statement can be used; if not declared nonlocal, those variables are read-only (an attempt to write to such a variable will simply create a *new* local variable in the innermost scope, leaving the identically named outer variable unchanged).
id: Jika sebuah nama dinyatakan global, maka semua referensi dan penugasan langsung ke lingkup *scope* tengah yang berisi nama global modul. Untuk mengembalikan variabel yang ditemukan di luar cakupan terdalam, pernyataan :keyword:`nonlocal` dapat digunakan; jika tidak dideklarasikan nonlokal, variabel-variabel itu hanya baca-saja (upaya untuk menulis ke variabel seperti itu hanya akan membuat variabel lokal *baru* dalam cakupan terdalam, membiarkan variabel luar yang dinamai identik tidak berubah).

source: Usually, the local scope references the local names of the (textually) current function. Outside functions, the local scope references the same namespace as the global scope: the module's namespace. Class definitions place yet another namespace in the local scope.
id: Biasanya, cakupan lokal merujuk nama lokal dari fungsi (secara tekstual) saat ini. Fungsi luar, lingkup lokal merujuk *namespace* yang sama dengan lingkup global: *namespace* modul. Definisi kelas menempatkan namespace lain dalam lingkup lokal.

source: It is important to realize that scopes are determined textually: the global scope of a function defined in a module is that module's namespace, no matter from where or by what alias the function is called. On the other hand, the actual search for names is done dynamically, at run time --- however, the language definition is evolving towards static name resolution, at "compile" time, so don't rely on dynamic name resolution! (In fact, local variables are already determined statically.)
id: Penting untuk menyadari bahwa cakupan *scope* ditentukan secara tekstual: ruang lingkup global dari suatu fungsi yang didefinisikan dalam modul adalah ruang nama *namespace* modul itu, tidak peduli dari mana atau oleh apa alias fungsi itu dipanggil. Di sisi lain, pencarian nama sebenarnya dilakukan secara dinamis, pada saat *run time* --- namun, definisi bahasa berkembang menuju resolusi nama statis, pada waktu "compile", jadi jangan mengandalkan resolusi nama dinamis! (Faktanya, variabel lokal sudah ditentukan secara statis.)

source: A special quirk of Python is that -- if no :keyword:`global` or :keyword:`nonlocal` statement is in effect -- assignments to names always go into the innermost scope. Assignments do not copy data --- they just bind names to objects. The same is true for deletions: the statement ``del x`` removes the binding of ``x`` from the namespace referenced by the local scope. In fact, all operations that introduce new names use the local scope: in particular, :keyword:`import` statements and function definitions bind the module or function name in the local scope.
id: Sebuah kekhasan khusus dari Python adalah bahwa -- jika tidak ada pernyataan :keyword:`global` atau pernyataan :keyword:`nonlocal` yang berlaku -- pemberian nilai untuk nama selalu masuk ke ruang lingkup terdalam. Pemberian nilai tidak menyalin data --- mereka hanya mengikat nama ke objek. Hal yang sama berlaku untuk penghapusan: pernyataan ``del x`` menghapus pengikatan ``x`` dari *namespace* yang dirujuk oleh lingkup *scope* lokal. Bahkan, semua operasi yang memperkenalkan nama-nama baru menggunakan lingkup lokal: khususnya, pernyataan :keyword:`import` dan definisi fungsi mengikat modul atau nama fungsi di lingkup lokal.

source: The :keyword:`global` statement can be used to indicate that particular variables live in the global scope and should be rebound there; the :keyword:`nonlocal` statement indicates that particular variables live in an enclosing scope and should be rebound there.
id: Pernyataan :keyword:`global` dapat digunakan untuk menunjukkan bahwa variabel tertentu hidup dalam lingkup global dan harus kembali ke sana; pernyataan :keyword:`nonlocal` menunjukkan bahwa variabel tertentu hidup dalam cakupan terlampir dan harus dikembalikan ke sana.

source: Scopes and Namespaces Example
id: Contoh Lingkup *Scopes* dan Ruang Nama *Namespaces*

source: This is an example demonstrating how to reference the different scopes and namespaces, and how :keyword:`global` and :keyword:`nonlocal` affect variable binding::
id: Ini adalah contoh yang menunjukkan cara mereferensikan lingkup *scopes* dan ruang nama *namespaces* yang berbeda, dan bagaimana :keyword:`global` dan :keyword:`nonlocal` memengaruhi pengikatan variabel::

source: The output of the example code is:
id: Keluaran dari contoh kode adalah:

source: Note how the *local* assignment (which is default) didn't change *scope_test*\'s binding of *spam*. The :keyword:`nonlocal` assignment changed *scope_test*\'s binding of *spam*, and the :keyword:`global` assignment changed the module-level binding.
id: Perhatikan bagaimana pemberian nilai *local* (yang bawaan) tidak mengubah *scope_test*\s pengikatan *spam*. Pemberian nilai :keyword:`nonlocal` mengubah *scope_test*\'s pengikatan *spam*, dan pemberian nilai :keyword:`global` mengubah pengikatan level modul.

source: You can also see that there was no previous binding for *spam* before the :keyword:`global` assignment.
id: Anda juga dapat melihat bahwa tidak ada pengikatan sebelumnya untuk *spam* sebelum pemberian nilai :keyword:`global`.

source: A First Look at Classes
id: Pandangan Pertama tentang Kelas

source: Classes introduce a little bit of new syntax, three new object types, and some new semantics.
id: Kelas memperkenalkan sedikit sintaks baru, tiga tipe objek baru, dan beberapa semantik baru.

source: Class Definition Syntax
id: Sintaks Definisi Kelas

source: The simplest form of class definition looks like this::
id: Bentuk definisi kelas paling sederhana terlihat seperti ini::

source: Class definitions, like function definitions (:keyword:`def` statements) must be executed before they have any effect. (You could conceivably place a class definition in a branch of an :keyword:`if` statement, or inside a function.)
id: Definisi kelas, seperti definisi fungsi (pernyataan :keyword:`def`) harus dieksekusi sebelum mereka memiliki efek. (Anda dapat menempatkan definisi kelas di cabang dari pernyataan :keyword:`if`, atau di dalam suatu fungsi.)

source: In practice, the statements inside a class definition will usually be function definitions, but other statements are allowed, and sometimes useful --- we'll come back to this later. The function definitions inside a class normally have a peculiar form of argument list, dictated by the calling conventions for methods --- again, this is explained later.
id: Dalam praktiknya, pernyataan di dalam definisi kelas biasanya akan menjadi definisi fungsi, tetapi pernyataan lain diizinkan, dan terkadang berguna --- kami akan kembali ke sini nanti. Definisi fungsi di dalam kelas biasanya memiliki bentuk khusus daftar argumen, didikte oleh konvensi pemanggilan untuk metode --- sekali lagi, ini dijelaskan nanti.

source: When a class definition is entered, a new namespace is created, and used as the local scope --- thus, all assignments to local variables go into this new namespace. In particular, function definitions bind the name of the new function here.
id: Ketika definisi kelas dimasukkan, *namespace* baru dibuat, dan digunakan sebagai lingkup *scope* lokal --- dengan demikian, semua tugas untuk variabel lokal masuk ke *namespace* baru ini. Secara khusus, definisi fungsi mengikat nama fungsi baru di sini.

source: When a class definition is left normally (via the end), a *class object* is created. This is basically a wrapper around the contents of the namespace created by the class definition; we'll learn more about class objects in the next section. The original local scope (the one in effect just before the class definition was entered) is reinstated, and the class object is bound here to the class name given in the class definition header (:class:`ClassName` in the example).
id: Ketika definisi kelas dibiarkan normal (melalui akhir), *class object* dibuat. Ini pada dasarnya adalah pembungkus di sekitar isi *namespace* yang dibuat oleh definisi kelas; kita akan belajar lebih banyak tentang objek kelas di bagian selanjutnya. Lingkup *scope* lokal asli (yang berlaku tepat sebelum definisi kelas dimasukkan) diaktifkan kembali, dan objek kelas terikat di sini dengan nama kelas yang diberikan dalam header definisi kelas (:class:`ClassName` dalam contoh).

source: Class Objects
id: Objek Kelas *Class Objects*

source: Class objects support two kinds of operations: attribute references and instantiation.
id: Objek kelas mendukung dua jenis operasi: referensi atribut dan instansiasi.

source: *Attribute references* use the standard syntax used for all attribute references in Python: ``obj.name``. Valid attribute names are all the names that were in the class's namespace when the class object was created. So, if the class definition looked like this::
id: *Attribute references* menggunakan sintaks standar yang digunakan untuk semua referensi atribut dalam Python: ``obj.name``. Nama atribut yang valid adalah semua nama yang ada di *namespace* kelas saat objek kelas dibuat. Jadi, jika definisi kelas tampak seperti ini::
