Repository: python/python-docs-id
Catalog: python-newest.c-api--function/*.po
Languages: id

source: Function Objects
id: Objek Fungsi

source: There are a few functions specific to Python functions.
id: Terdapat beberapa fungsi spesifik untuk fungsi Python.

source: The C structure used for functions.
id: Struktur C yang digunakan untuk fungsi.

source: This is an instance of :c:type:`PyTypeObject` and represents the Python function type. It is exposed to Python programmers as ``types.FunctionType``.
id: Ini adalah instance dari :c:type:`PyTypeObject` dan mewakili jenis fungsi Python. Itu diekspos ke programmer Python sebagai ``types.FunctionType``.

source: Return true if *o* is a function object (has type :c:data:`PyFunction_Type`). The parameter must not be ``NULL``. This function always succeeds.
id: Mengembalikan nilai true jika *o* adalah objek fungsi (memiliki tipe :c:data:`PyFunction_Type`). Parameter tidak boleh ``NULL``. Fungsi ini selalu sukses.

source: Return a new function object associated with the code object *code*. *globals* must be a dictionary with the global variables accessible to the function.
id: Mengembalikan objek fungsi baru yang terkait dengan objek kode *code*. *global* harus berupa dictionary dengan variabel global yang dapat diakses oleh fungsi tersebut.

source: The function's docstring and name are retrieved from the code object. *__module__* is retrieved from *globals*. The argument defaults, annotations and closure are set to ``NULL``. *__qualname__* is set to the same value as the function's name.
id: Docstring dan nama fungsi diambil dari objek kode. *__module__* diambil dari *global*. Default argumen, anotasi dan penutupan diatur ke ``NULL``. *__qualname__* diatur ke nilai yang sama dengan nama fungsi.

source: As :c:func:`PyFunction_New`, but also allows setting the function object's ``__qualname__`` attribute. *qualname* should be a unicode object or ``NULL``; if ``NULL``, the ``__qualname__`` attribute is set to the same value as its ``__name__`` attribute.
id: Seperti :c:func:`PyFunction_New`, tetapi juga memungkinkan pengaturan atribut ``__qualname__`` pada objek fungsi. *qualname* harus berupa objek unicode atau ``NULL``; jika ``NULL``, atribut ``__qualname__`` diatur ke nilai yang sama dengan atribut ``__name__``.

source: Return the code object associated with the function object *op*.
id: Mengembalikan objek kode yang terkait dengan objek fungsi *op*.

source: Return the globals dictionary associated with the function object *op*.
id: Mengembalikan dictionary global yang terkait dengan objek fungsi *op*.

source: Return the *__module__* attribute of the function object *op*. This is normally a string containing the module name, but can be set to any other object by Python code.
id: Mengembalikan atribut *__module__* dari objek fungsi *op*. Ini biasanya berupa string yang berisi nama modul, tetapi dapat diatur ke objek lain dengan kode Python.

source: Return the argument default values of the function object *op*. This can be a tuple of arguments or ``NULL``.
id: Mengembalikan nilai argumen default dari objek fungsi *op*. Ini bisa berupa argumen tuple atau ``NULL``.

source: Set the argument default values for the function object *op*. *defaults* must be ``Py_None`` or a tuple.
id: Menetapkan nilai argumen default untuk objek fungsi *op*. *default* harus ``Py_None`` atau tuple.

source: Raises :exc:`SystemError` and returns ``-1`` on failure.
id: Menimbulkan :exc:`SystemError` dan mengembalikan ``-1`` jika gagal.

source: Return the closure associated with the function object *op*. This can be ``NULL`` or a tuple of cell objects.
id: Mengembalikan penutupan yang terkait dengan objek fungsi *op*. Ini bisa berupa ``NULL`` atau tuple objek sel.

source: Set the closure associated with the function object *op*. *closure* must be ``Py_None`` or a tuple of cell objects.
id: Mengatur penutupan yang terkait dengan objek fungsi *op*. *closure* harus berupa ``Py_None`` atau tuple objek sel.

source: Return the annotations of the function object *op*. This can be a mutable dictionary or ``NULL``.
id: Kembalikan anotasi objek fungsi *op*. Ini bisa berupa dictionary yang bisa berubah atau ``NULL``.

source: Set the annotations for the function object *op*. *annotations* must be a dictionary or ``Py_None``.
id: Mengatur anotasi untuk objek fungsi *op*. *annotations* harus berupa dictionary atau ``Py_None``.
