Repository: python/python-docs-id
Catalog: python-newest.tutorial--inputoutput/*.po
Languages: id

source: Saving structured data with :mod:`json`
id: Menyimpan data terstruktur dengan :mod:`json`

source: Strings can easily be written to and read from a file. Numbers take a bit more effort, since the :meth:`read` method only returns strings, which will have to be passed to a function like :func:`int`, which takes a string like ``'123'`` and returns its numeric value 123. When you want to save more complex data types like nested lists and dictionaries, parsing and serializing by hand becomes complicated.
id: String dapat dengan mudah ditulis dan dibaca dari file. Angka membutuhkan sedikit usaha, karena metode :meth:`read` hanya mengembalikan string, yang harus diteruskan ke fungsi seperti :func:`int`, yang mengambil string seperti ``'123'`` dan mengembalikan nilai numerik 123. Ketika Anda ingin menyimpan tipe data yang lebih kompleks seperti daftar *list* dan *dictionary* bersarang, penguraian dan pembuatan serialisasi dengan tangan menjadi rumit.

source: Rather than having users constantly writing and debugging code to save complicated data types to files, Python allows you to use the popular data interchange format called `JSON (JavaScript Object Notation) <http://json.org>`_. The standard module called :mod:`json` can take Python data hierarchies, and convert them to string representations; this process is called :dfn:`serializing`. Reconstructing the data from the string representation is called :dfn:`deserializing`. Between serializing and deserializing, the string representing the object may have been stored in a file or data, or sent over a network connection to some distant machine.
id: Alih-alih membuat pengguna terus-menerus menulis dan men-debug kode untuk menyimpan tipe data yang rumit ke berkas, Python memungkinkan Anda untuk menggunakan format pertukaran data populer yang disebut `JSON (JavaScript Object Notation) <http://json.org>`_. Modul standar bernama :mod:`json` dapat mengambil hierarki data Python, dan mengubahnya menjadi representasi string; proses ini disebut :dfn:`serializing`. Merekonstruksi data dari representasi string disebut :dfn:`deserializing`. Antara *serializing* dan *deserializing*, string yang mewakili objek mungkin telah disimpan dalam berkas atau data, atau dikirim melalui koneksi jaringan ke beberapa mesin yang jauh.

source: The JSON format is commonly used by modern applications to allow for data exchange. Many programmers are already familiar with it, which makes it a good choice for interoperability.
id: Format JSON umumnya digunakan oleh aplikasi modern untuk memungkinkan pertukaran data. Banyak programmer sudah terbiasa dengannya, yang membuatnya menjadi pilihan yang baik untuk interoperabilitas.

source: If you have an object ``x``, you can view its JSON string representation with a simple line of code::
id: Jika Anda memiliki objek ``x``, Anda dapat melihat representasi string JSON dengan baris kode sederhana::

source: Another variant of the :func:`~json.dumps` function, called :func:`~json.dump`, simply serializes the object to a :term:`text file`. So if ``f`` is a :term:`text file` object opened for writing, we can do this::
id: Varian lain dari fungsi :func:`~json.dumps`, disebut :func:`~json.dump`, dengan mudah membuat serialisasi objek menjadi :term: `text file`. Jadi jika ``f`` adalah objek :term:`text file` dibuka untuk menulis, kita dapat melakukan ini::

source: To decode the object again, if ``f`` is a :term:`text file` object which has been opened for reading::
id: Untuk menerjemahkan *decode* objek lagi, jika ``f`` adalah objek :term:`text file` yang telah dibuka untuk membaca::

source: This simple serialization technique can handle lists and dictionaries, but serializing arbitrary class instances in JSON requires a bit of extra effort. The reference for the :mod:`json` module contains an explanation of this.
id: Teknik serialisasi sederhana ini dapat menangani daftar *list* dan *dictionary*, tetapi membuat serialisasi *instance* kelas yang berubah-ubah *arbitrary* di JSON membutuhkan sedikit usaha ekstra. Referensi untuk modul :mod:`json` berisi penjelasan tentang ini.

source: :mod:`pickle` - the pickle module
id: :mod:`Pickle` - modul *pickle*

source: Contrary to :ref:`JSON <tut-json>`, *pickle* is a protocol which allows the serialization of arbitrarily complex Python objects. As such, it is specific to Python and cannot be used to communicate with applications written in other languages. It is also insecure by default: deserializing pickle data coming from an untrusted source can execute arbitrary code, if the data was crafted by a skilled attacker.
id: Berlawanan dengan :ref:`JSON <tut-json>`, *pickle* adalah protokol yang memungkinkan serialisasi objek Python yang semena-mena *arbitrarily* kompleks. Dengan demikian, ini khusus untuk Python dan tidak dapat digunakan untuk berkomunikasi dengan aplikasi yang ditulis dalam bahasa lain. Ini juga tidak aman secara bawaan: *deserializing* *pickle* data yang berasal dari sumber yang tidak dipercaya dapat mengeksekusi kode semena-mena *arbitrary*, jika data dibuat oleh penyerang yang terampil.
