Repository: python/python-docs-id
Catalog: python-newest.tutorial--modules/*.po
Languages: id

source: The :file:`__init__.py` files are required to make Python treat directories containing the file as packages. This prevents directories with a common name, such as ``string``, unintentionally hiding valid modules that occur later on the module search path. In the simplest case, :file:`__init__.py` can just be an empty file, but it can also execute initialization code for the package or set the ``__all__`` variable, described later.
id: Berkas :file:`__init__.py` diperlukan untuk membuat Python memperlakukan direktori yang berisi file sebagai paket. Ini mencegah direktori dengan nama umum, seperti ``string``, menyembunyikan modul valid yang muncul kemudian pada jalur pencarian modul. Dalam kasus yang paling sederhana, :file: `__init__.py` dapat berupa file kosong, tetapi juga dapat menjalankan kode inisialisasi untuk paket atau mengatur variabel ``__all__``, dijelaskan nanti.

source: Users of the package can import individual modules from the package, for example::
id: Pengguna paket dapat mengimpor modul individual dari paket, misalnya::

source: This loads the submodule :mod:`sound.effects.echo`. It must be referenced with its full name. ::
id: Ini memuat submodule :mod:`sound.effects.echo`. Itu harus dirujuk dengan nama lengkapnya. ::

source: An alternative way of importing the submodule is::
id: Cara alternatif mengimpor submodule adalah::

source: This also loads the submodule :mod:`echo`, and makes it available without its package prefix, so it can be used as follows::
id: Ini juga memuat submodul :mod: `echo`, dan membuatnya tersedia tanpa awalan paketnya, sehingga dapat digunakan sebagai berikut::

source: Yet another variation is to import the desired function or variable directly::
id: Namun variasi lain adalah mengimpor fungsi atau variabel yang diinginkan secara langsung::

source: Again, this loads the submodule :mod:`echo`, but this makes its function :func:`echofilter` directly available::
id: Sekali lagi, ini memuat submodul :mod:`echo`, tetapi ini membuat fungsinya :func:`echofilter` langsung tersedia::

source: Note that when using ``from package import item``, the item can be either a submodule (or subpackage) of the package, or some other name defined in the package, like a function, class or variable. The ``import`` statement first tests whether the item is defined in the package; if not, it assumes it is a module and attempts to load it. If it fails to find it, an :exc:`ImportError` exception is raised.
id: Perhatikan bahwa ketika menggunakan ``from package import item``, item tersebut dapat berupa submodul (atau subpaket) dari paket, atau beberapa nama lain yang ditentukan dalam paket, seperti fungsi, kelas atau variabel. Pernyataan ``import`` pertama menguji apakah item tersebut didefinisikan dalam paket; jika tidak, ini dianggap sebagai modul dan mencoba memuatnya. Jika gagal menemukannya, pengecualian :exc:`ImportError` dimunculkan.

source: Contrarily, when using syntax like ``import item.subitem.subsubitem``, each item except for the last must be a package; the last item can be a module or a package but can't be a class or function or variable defined in the previous item.
id: Sebaliknya, ketika menggunakan sintaksis seperti ``import item.subitem.subsubitem``, setiap item kecuali yang terakhir harus berupa paket; item terakhir dapat berupa modul atau paket tetapi tidak bisa berupa kelas atau fungsi atau variabel yang didefinisikan dalam item sebelumnya.

source: Importing \* From a Package
id: Mengimpor \* Dari Paket

source: Now what happens when the user writes ``from sound.effects import *``? Ideally, one would hope that this somehow goes out to the filesystem, finds which submodules are present in the package, and imports them all. This could take a long time and importing sub-modules might have unwanted side-effects that should only happen when the sub-module is explicitly imported.
id: Sekarang apa yang terjadi ketika pengguna menulis ``from sound.effects import *``? Idealnya, orang akan berharap bahwa ini entah bagaimana keluar ke sistem file, menemukan submodul mana yang ada dalam paket, dan mengimpor semuanya. Ini bisa memakan waktu lama dan mengimpor submodul mungkin memiliki efek samping yang tidak diinginkan yang seharusnya hanya terjadi ketika submodul diimpor secara eksplisit.

source: The only solution is for the package author to provide an explicit index of the package. The :keyword:`import` statement uses the following convention: if a package's :file:`__init__.py` code defines a list named ``__all__``, it is taken to be the list of module names that should be imported when ``from package import *`` is encountered. It is up to the package author to keep this list up-to-date when a new version of the package is released. Package authors may also decide not to support it, if they don't see a use for importing \* from their package. For example, the file :file:`sound/effects/__init__.py` could contain the following code::
id: Satu-satunya solusi adalah bagi pembuat paket untuk memberikan indeks paket secara eksplisit. Pernyataan :keyword:`import` menggunakan konvensi berikut: jika suatu paket punya kode :file:`__init __.py` yang mendefinisikan daftar bernama ``__all__``, itu diambil sebagai daftar nama modul yang harus diimpor ketika ``from package import *`` ditemukan. Terserah pembuat paket untuk tetap memperbarui daftar ini ketika versi baru dari paket dirilis. Pembuat paket juga dapat memutuskan untuk tidak mendukungnya, jika mereka tidak melihat penggunaan untuk mengimpor \* dari paket mereka. Sebagai contoh, berkas :file:`sound/effects/__init__.py` dapat berisi kode berikut::

source: This would mean that ``from sound.effects import *`` would import the three named submodules of the :mod:`sound` package.
id: Ini berarti bahwa ``from sound.effects import *`` akan mengimpor tiga submodul bernama dari paket :mod:`sound`.

source: If ``__all__`` is not defined, the statement ``from sound.effects import *`` does *not* import all submodules from the package :mod:`sound.effects` into the current namespace; it only ensures that the package :mod:`sound.effects` has been imported (possibly running any initialization code in :file:`__init__.py`) and then imports whatever names are defined in the package. This includes any names defined (and submodules explicitly loaded) by :file:`__init__.py`. It also includes any submodules of the package that were explicitly loaded by previous :keyword:`import` statements. Consider this code::
id: Jika ``__all__`` tidak didefinisikan, pernyataan ``from sound.effects import *`` *tidak* impor semua submodul dari paket :mod:`sound.effects` ke *namespace* saat ini; itu hanya memastikan bahwa paket :mod:`sound.effects` telah diimpor (mungkin menjalankan kode inisialisasi apa pun di :file:`__init__.py`) dan kemudian mengimpor nama apa pun yang didefinisikan dalam paket. Ini termasuk semua nama yang didefinisikan (dan submodul yang dimuat secara eksplisit) oleh :file:`__init__.py`. Itu juga termasuk semua submodul dari paket yang secara eksplisit dimuat oleh sebelumnya pernyataan :keyword:`import`. Pertimbangkan kode ini ::

source: In this example, the :mod:`echo` and :mod:`surround` modules are imported in the current namespace because they are defined in the :mod:`sound.effects` package when the ``from...import`` statement is executed. (This also works when ``__all__`` is defined.)
id: Dalam contoh ini, modul :mod:`echo` dan :mod:`surround` diimpor dalam *namespace* saat ini karena mereka didefinisikan dalam paket :mod:`sound.effects` ketika paket ``from...import`` Pernyataan dieksekusi. (Ini juga berfungsi ketika ``__all__`` didefinisikan.)

source: Although certain modules are designed to export only names that follow certain patterns when you use ``import *``, it is still considered bad practice in production code.
id: Meskipun modul-modul tertentu dirancang hanya untuk mengekspor nama-nama yang mengikuti pola tertentu ketika Anda menggunakan ``import *``, itu masih dianggap praktik buruk dalam lingkungan kode produksi *production*.

source: Remember, there is nothing wrong with using ``from package import specific_submodule``! In fact, this is the recommended notation unless the importing module needs to use submodules with the same name from different packages.
id: Ingat, tidak ada yang salah dengan menggunakan ``from package import specific_submodule``! Sebenarnya, ini adalah notasi yang disarankan kecuali modul impor perlu menggunakan submodul dengan nama yang sama dari paket yang berbeda.

source: Intra-package References
id: Referensi Intra-paket

source: When packages are structured into subpackages (as with the :mod:`sound` package in the example), you can use absolute imports to refer to submodules of siblings packages. For example, if the module :mod:`sound.filters.vocoder` needs to use the :mod:`echo` module in the :mod:`sound.effects` package, it can use ``from sound.effects import echo``.
id: Ketika paket disusun menjadi subpaket (seperti pada paket :mod:`sound` pada contoh), Anda dapat menggunakan impor absolut untuk merujuk pada submodul paket saudara kandung. Misalnya, jika modul :mod:`sound.filters.vocoder` perlu menggunakan modul :mod:`echo` dalam paket :mod:`sound.effects`, ia dapat menggunakan ``from sound.effects import echo``.

source: You can also write relative imports, with the ``from module import name`` form of import statement. These imports use leading dots to indicate the current and parent packages involved in the relative import. From the :mod:`surround` module for example, you might use::
id: Anda juga dapat menulis impor relatif, dengan bentuk ``from module import name`` pada pernyataan impor. Impor ini menggunakan titik-titik di awalan untuk menunjukkan paket saat ini dan induk yang terlibat dalam impor relatif. Dari modul :mod:`surround` misalnya, Anda dapat menggunakan::

source: Note that relative imports are based on the name of the current module. Since the name of the main module is always ``"__main__"``, modules intended for use as the main module of a Python application must always use absolute imports.
id: Perhatikan bahwa impor relatif didasarkan pada nama modul saat ini. Karena nama modul utama selalu ``"__main__"``, modul yang dimaksudkan untuk digunakan sebagai modul utama aplikasi Python harus selalu menggunakan impor absolut.

source: Packages in Multiple Directories
id: Paket di Beberapa Direktori

source: Packages support one more special attribute, :attr:`__path__`. This is initialized to be a list containing the name of the directory holding the package's :file:`__init__.py` before the code in that file is executed. This variable can be modified; doing so affects future searches for modules and subpackages contained in the package.
id: Paket mendukung satu atribut khusus lagi, :attr:`__path__`. Ini diinisialisasi menjadi daftar yang berisi nama direktori yang menyimpan file paket: `__init__.py` sebelum kode dalam file tersebut dieksekusi. Variabel ini dapat dimodifikasi; hal itu memengaruhi pencarian modul dan subpackage di masa depan yang terkandung dalam paket.

source: While this feature is not often needed, it can be used to extend the set of modules found in a package.
id: Meskipun fitur ini tidak sering dibutuhkan, fitur ini dapat digunakan untuk memperluas rangkaian modul yang ditemukan dalam suatu paket.

source: Footnotes
id: Catatan kaki

source: In fact function definitions are also 'statements' that are 'executed'; the execution of a module-level function definition enters the function name in the module's global symbol table.
id: Bahkan definisi fungsi juga 'statements' yang 'executed'; eksekusi dari definisi fungsi level-modul memasukkan nama fungsi di tabel simbol global modul.
