Repository: python/python-docs-id
Catalog: python-newest.tutorial--modules/*.po
Languages: id

source: Modules
id: Modul-Modul

source: If you quit from the Python interpreter and enter it again, the definitions you have made (functions and variables) are lost. Therefore, if you want to write a somewhat longer program, you are better off using a text editor to prepare the input for the interpreter and running it with that file as input instead. This is known as creating a *script*. As your program gets longer, you may want to split it into several files for easier maintenance. You may also want to use a handy function that you've written in several programs without copying its definition into each program.
id: Jika Anda berhenti dari *interpreter* Python dan memasukkannya lagi, definisi yang Anda buat (fungsi dan variabel) akan hilang. Karena itu, jika Anda ingin menulis program yang agak lebih panjang, Anda lebih baik menggunakan editor teks untuk menyiapkan input bagi penerjemah dan menjalankannya dengan file itu sebagai input. Ini dikenal sebagai membuat *script*. Saat program Anda menjadi lebih panjang, Anda mungkin ingin membaginya menjadi beberapa file untuk pengelolaan yang lebih mudah. Anda mungkin juga ingin menggunakan fungsi praktis yang Anda tulis di beberapa program tanpa menyalin definisi ke setiap program.

source: To support this, Python has a way to put definitions in a file and use them in a script or in an interactive instance of the interpreter. Such a file is called a *module*; definitions from a module can be *imported* into other modules or into the *main* module (the collection of variables that you have access to in a script executed at the top level and in calculator mode).
id: Untuk mendukung ini, Python memiliki cara untuk meletakkan definisi dalam file dan menggunakannya dalam skrip atau dalam contoh interaktif dari *interpreter*. File seperti itu disebut *module*; definisi dari modul dapat *imported* ke modul lain atau ke modul *main* (kumpulan variabel yang Anda memiliki akses ke dalam skrip yang dieksekusi di tingkat atas dan dalam mode kalkulator).

source: A module is a file containing Python definitions and statements. The file name is the module name with the suffix :file:`.py` appended. Within a module, the module's name (as a string) is available as the value of the global variable ``__name__``. For instance, use your favorite text editor to create a file called :file:`fibo.py` in the current directory with the following contents::
id: Modul adalah file yang berisi definisi dan pernyataan Python. Nama berkas adalah nama modul dengan akhiran :file:`.py` diakhirnya. Dalam sebuah modul, nama modul (sebagai string) tersedia sebagai nilai variabel global ``__name__``. Misalnya, gunakan editor teks favorit Anda untuk membuat bernama bernama :file:`fibo.py` di direktori saat ini dengan konten berikut ::

source: Now enter the Python interpreter and import this module with the following command::
id: Sekarang masukkan interpreter Python dan impor modul ini dengan perintah berikut::

source: This does not enter the names of the functions defined in ``fibo`` directly in the current symbol table; it only enters the module name ``fibo`` there. Using the module name you can access the functions::
id: Ini tidak memasukkan nama fungsi yang didefinisikan dalam ``fibo`` secara langsung dalam tabel simbol saat ini; itu hanya memasukkan nama modul ``fibo`` di sana. Menggunakan nama modul Anda dapat mengakses fungsi::

source: If you intend to use a function often you can assign it to a local name::
id: Jika Anda sering ingin menggunakan suatu fungsi, Anda dapat menetapkannya ke nama lokal::

source: More on Modules
id: Lebih lanjut tentang Modul

source: A module can contain executable statements as well as function definitions. These statements are intended to initialize the module. They are executed only the *first* time the module name is encountered in an import statement. [#]_ (They are also run if the file is executed as a script.)
id: Modul dapat berisi pernyataan yang dapat dieksekusi serta definisi fungsi. Pernyataan ini dimaksudkan untuk menginisialisasi modul. Mereka dieksekusi hanya *first* kali nama modul ditemui dalam pernyataan impor. [#]_ (Mereka juga dijalankan jika file dieksekusi sebagai skrip.)

source: Each module has its own private symbol table, which is used as the global symbol table by all functions defined in the module. Thus, the author of a module can use global variables in the module without worrying about accidental clashes with a user's global variables. On the other hand, if you know what you are doing you can touch a module's global variables with the same notation used to refer to its functions, ``modname.itemname``.
id: Setiap modul memiliki tabel simbol pribadi sendiri, yang digunakan sebagai tabel simbol global oleh semua fungsi yang didefinisikan dalam modul. Dengan demikian, penulis modul dapat menggunakan variabel global dalam modul tanpa khawatir tentang bentrokan tidak disengaja dengan variabel global pengguna. Di sisi lain, jika Anda tahu apa yang Anda lakukan, Anda dapat menyentuh variabel global modul dengan notasi yang sama yang digunakan untuk merujuk ke fungsinya, ``modname.itemname``.

source: Modules can import other modules. It is customary but not required to place all :keyword:`import` statements at the beginning of a module (or script, for that matter). The imported module names are placed in the importing module's global symbol table.
id: Modul dapat mengimpor modul lain. Biasanya, tetapi tidak diperlukan untuk menempatkan semua pernyataan :keyword:`import` di awal modul (atau skrip, dalam hal ini). Nama-nama modul yang diimpor ditempatkan di tabel simbol global modul impor.

source: There is a variant of the :keyword:`import` statement that imports names from a module directly into the importing module's symbol table. For example::
id: Ada varian dari pernyataan :keyword:`import` yang mengimpor nama dari modul langsung ke tabel simbol modul impor. Sebagai contoh::

source: This does not introduce the module name from which the imports are taken in the local symbol table (so in the example, ``fibo`` is not defined).
id: Ini tidak memperkenalkan nama modul dari mana impor diambil dalam tabel simbol lokal (jadi dalam contoh, ``fibo`` tidak didefinisikan).

source: There is even a variant to import all names that a module defines::
id: Bahkan ada varian untuk mengimpor semua nama yang didefinisikan oleh modul::

source: This imports all names except those beginning with an underscore (``_``). In most cases Python programmers do not use this facility since it introduces an unknown set of names into the interpreter, possibly hiding some things you have already defined.
id: Ini mengimpor semua nama kecuali yang dimulai dengan garis bawah (``_``). Dalam kebanyakan kasus, programmer Python tidak menggunakan fasilitas ini karena ia memperkenalkan sekumpulan nama yang tidak diketahui ke dalam *interpreter*, mungkin menyembunyikan beberapa hal yang sudah Anda definisikan.

source: Note that in general the practice of importing ``*`` from a module or package is frowned upon, since it often causes poorly readable code. However, it is okay to use it to save typing in interactive sessions.
id: Perhatikan bahwa secara umum praktik mengimpor ``*`` dari modul atau paket tidak disukai, karena sering menyebabkan kode yang kurang dapat dibaca. Namun, boleh saja menggunakannya untuk menghemat pengetikan di sesi interaktif.

source: If the module name is followed by :keyword:`!as`, then the name following :keyword:`!as` is bound directly to the imported module.
id: Jika nama modul diikuti oleh :keyword:`!as`, maka nama setelah :keyword:`!as` terikat langsung ke modul yang diimpor.

source: This is effectively importing the module in the same way that ``import fibo`` will do, with the only difference of it being available as ``fib``.
id: Ini secara efektif mengimpor modul dengan cara yang sama dengan ``import fibo`` akan dilakukan, dengan satu-satunya perbedaan adalah sebagai ``fib``.

source: It can also be used when utilising :keyword:`from` with similar effects::
id: Itu juga dapat digunakan ketika menggunakan :keyword:`from` dengan efek yang sama::

source: For efficiency reasons, each module is only imported once per interpreter session. Therefore, if you change your modules, you must restart the interpreter -- or, if it's just one module you want to test interactively, use :func:`importlib.reload`, e.g. ``import importlib; importlib.reload(modulename)``.
id: Untuk alasan efisiensi, setiap modul hanya diimpor satu kali per sesi *interpreter*. Karenanya, jika Anda mengubah modul, Anda harus memulai ulang *interpreter* -- atau, jika hanya satu modul yang ingin Anda uji secara interaktif, gunakan :func:`importlib.reload`, mis. ``import importlib; importlib.reload(modulename)``.

source: Executing modules as scripts
id: Mengoperasikan modul sebagai skrip

source: When you run a Python module with ::
id: Ketika Anda mengoperasikan modul Python dengan ::

source: the code in the module will be executed, just as if you imported it, but with the ``__name__`` set to ``"__main__"``. That means that by adding this code at the end of your module::
id: kode dalam modul akan dieksekusi, sama seperti jika Anda mengimpornya, tetapi dengan ``__name__`` diatur ke ``"__main__"``. Itu berarti bahwa dengan menambahkan kode ini di akhir modul Anda ::

source: you can make the file usable as a script as well as an importable module, because the code that parses the command line only runs if the module is executed as the "main" file:
id: Anda dapat membuat berkas dapat digunakan sebagai skrip dan juga modul yang dapat diimpor, karena kode yang mengurai *parsing* baris perintah hanya beroperasi jika modul dieksekusi sebagai berkas "main":

source: If the module is imported, the code is not run::
id: Jika modul diimpor, kode ini tidak dioperasikan ::

source: This is often used either to provide a convenient user interface to a module, or for testing purposes (running the module as a script executes a test suite).
id: Ini sering digunakan baik untuk menyediakan antarmuka pengguna yang nyaman ke modul, atau untuk tujuan pengujian (menjalankan modul sebagai skrip mengeksekusi rangkaian pengujian).

source: The Module Search Path
id: Jalur Pencarian Modul

source: When a module named :mod:`spam` is imported, the interpreter first searches for a built-in module with that name. If not found, it then searches for a file named :file:`spam.py` in a list of directories given by the variable :data:`sys.path`. :data:`sys.path` is initialized from these locations:
id: Ketika sebuah modul bernama :mod:`spam` diimpor, *interpreter* pertama-tama mencari modul bawaan dengan nama itu. Jika tidak ditemukan, ia kemudian mencari berkas bernama :file:`spam.py` dalam daftar direktori yang diberikan oleh variabel :data:`sys.path`. :data:`sys.path` diinisialisasi dari lokasi ini:

source: The directory containing the input script (or the current directory when no file is specified).
id: Direktori yang berisi skrip masukan (atau direktori saat ini ketika tidak ada file ditentukan).

source: :envvar:`PYTHONPATH` (a list of directory names, with the same syntax as the shell variable :envvar:`PATH`).
id: :envvar:`PYTHONPATH` (daftar nama direktori, dengan sintaksis yang sama dengan variabel shell :envvar:`PATH`).

source: The installation-dependent default.
id: Bawaan yang bergantung pada instalasi.

source: On file systems which support symlinks, the directory containing the input script is calculated after the symlink is followed. In other words the directory containing the symlink is **not** added to the module search path.
id: Pada sistem file yang mendukung symlink, direktori yang berisi skrip masukan dihitung setelah symlink diikuti. Dengan kata lain direktori yang berisi symlink **not** ditambahkan ke jalur pencarian modul.

source: After initialization, Python programs can modify :data:`sys.path`. The directory containing the script being run is placed at the beginning of the search path, ahead of the standard library path. This means that scripts in that directory will be loaded instead of modules of the same name in the library directory. This is an error unless the replacement is intended. See section :ref:`tut-standardmodules` for more information.
id: Setelah inisialisasi, program Python dapat memodifikasi: data :`sys.path`. Direktori yang berisi skrip yang dijalankan ditempatkan di awal jalur pencarian, di depan jalur pustaka standar. Ini berarti bahwa skrip dalam direktori itu akan dimuat bukan modul dengan nama yang sama di direktori pustaka. Ini adalah kesalahan kecuali penggantian memang diharapkan. Lihat bagian :ref:`tut-standardmodules` untuk informasi lebih lanjut.

source: "Compiled" Python files
id: Berkas Python "Compiled"

source: To speed up loading modules, Python caches the compiled version of each module in the ``__pycache__`` directory under the name :file:`module.{version}.pyc`, where the version encodes the format of the compiled file; it generally contains the Python version number. For example, in CPython release 3.3 the compiled version of spam.py would be cached as ``__pycache__/spam.cpython-33.pyc``. This naming convention allows compiled modules from different releases and different versions of Python to coexist.
id: Untuk mempercepat memuat modul, Python menyimpan *cache* versi terkompilasi dari setiap modul di direktori ``__pycache__`` dengan nama :file:`module. {version}.pyc`, di mana versi menyandikan format berkas terkompilasi; umumnya berisi nomor versi Python. Misalnya, dalam rilis CPython 3.3 versi yang dikompilasi dari spam.py akan di-*cache* sebagai ``__pycache__/spam.cpython-33.pyc``. Konvensi penamaan ini memungkinkan modul yang dikompilasi dari rilis yang beragam dan versi Python yang berbeda untuk hidup berdampingan.

source: Python checks the modification date of the source against the compiled version to see if it's out of date and needs to be recompiled. This is a completely automatic process. Also, the compiled modules are platform-independent, so the same library can be shared among systems with different architectures.
id: Python memeriksa tanggal modifikasi sumber terhadap versi yang dikompilasi untuk melihat apakah itu kedaluwarsa dan perlu dikompilasi ulang. Ini adalah proses yang sepenuhnya otomatis. Juga, modul yang dikompilasi adalah platform-independen, sehingga perpustakaan yang sama dapat dibagi di antara sistem dengan arsitektur yang berbeda.

source: Python does not check the cache in two circumstances. First, it always recompiles and does not store the result for the module that's loaded directly from the command line. Second, it does not check the cache if there is no source module. To support a non-source (compiled only) distribution, the compiled module must be in the source directory, and there must not be a source module.
id: Python tidak memeriksa *cache* dalam dua keadaan. Pertama, selalu mengkompilasi ulang dan tidak menyimpan hasil untuk modul yang dimuat langsung dari baris perintah. Kedua, itu tidak memeriksa *cache* jika tidak ada modul sumber. Untuk mendukung distribusi non-sumber (dikompilasi saja), modul yang dikompilasi harus ada di direktori sumber, dan tidak boleh ada modul sumber.

source: Some tips for experts:
id: Beberapa tips untuk para ahli:

source: You can use the :option:`-O` or :option:`-OO` switches on the Python command to reduce the size of a compiled module. The ``-O`` switch removes assert statements, the ``-OO`` switch removes both assert statements and __doc__ strings. Since some programs may rely on having these available, you should only use this option if you know what you're doing. "Optimized" modules have an ``opt-`` tag and are usually smaller. Future releases may change the effects of optimization.
id: Anda dapat menggunakan :option:`-O` atau :option:`-OO` mengaktifkan perintah Python untuk mengurangi ukuran modul yang dikompilasi. Saklar ``-O`` menghapus pernyataan tegas *assert*, saklar ``-OO`` menghapus pernyataan tegas *assert* dan string __doc__. Karena beberapa program bergantung pada ketersediaannya, Anda hanya boleh menggunakan opsi ini jika Anda tahu apa yang Anda lakukan. Modul "Optimized" memiliki tag ``opt-`` dan biasanya lebih kecil. Rilis di masa depan dapat mengubah efek pengoptimalan.

source: A program doesn't run any faster when it is read from a ``.pyc`` file than when it is read from a ``.py`` file; the only thing that's faster about ``.pyc`` files is the speed with which they are loaded.
id: Suatu program tidak berjalan lebih cepat ketika itu dibaca dari file ``.pyc`` daripada ketika itu dibaca dari file ``.py``; satu-satunya hal yang lebih cepat tentang berkas ``.pyc`` adalah kecepatan memuatnya.

source: The module :mod:`compileall` can create .pyc files for all modules in a directory.
id: Modul :mod:`compileall` dapat membuat berkas .pyc untuk semua modul dalam direktori.

source: There is more detail on this process, including a flow chart of the decisions, in :pep:`3147`.
id: Ada detail lebih lanjut tentang proses ini, termasuk bagan alur keputusan, di :pep:`3147`.

source: Standard Modules
id: Modul Standar

source: Python comes with a library of standard modules, described in a separate document, the Python Library Reference ("Library Reference" hereafter). Some modules are built into the interpreter; these provide access to operations that are not part of the core of the language but are nevertheless built in, either for efficiency or to provide access to operating system primitives such as system calls. The set of such modules is a configuration option which also depends on the underlying platform. For example, the :mod:`winreg` module is only provided on Windows systems. One particular module deserves some attention: :mod:`sys`, which is built into every Python interpreter. The variables ``sys.ps1`` and ``sys.ps2`` define the strings used as primary and secondary prompts::
id: Python dilengkapi dengan pustaka modul standar, yang dijelaskan dalam dokumen terpisah, Referensi Pustaka Python ("Library Reference" selanjutnya). Beberapa modul dibangun ke dalam interpreter; ini menyediakan akses ke operasi yang bukan bagian dari inti bahasa tetapi tetap dibangun, baik untuk efisiensi atau untuk menyediakan akses ke sistem operasi primitif seperti pemanggilan sistem. Himpunan modul tersebut adalah opsi konfigurasi yang juga tergantung pada platform yang mendasarinya. Sebagai contoh, modul :mod:`winreg` hanya disediakan pada sistem Windows. Satu modul tertentu patut mendapat perhatian: :mod:`sys`, yang dibangun ke dalam setiap interpreter Python. Variabel ``sys.ps1`` dan ``sys.ps2`` menentukan string yang digunakan sebagai prompt primer dan sekunder ::

source: These two variables are only defined if the interpreter is in interactive mode.
id: Kedua variabel ini hanya ditentukan jika interpreter dalam mode interaktif.

source: The variable ``sys.path`` is a list of strings that determines the interpreter's search path for modules. It is initialized to a default path taken from the environment variable :envvar:`PYTHONPATH`, or from a built-in default if :envvar:`PYTHONPATH` is not set. You can modify it using standard list operations::
id: Variabel ``sys.path`` adalah daftar string yang menentukan jalur pencarian *interpreter* untuk modul. Ini diinisialisasi ke jalur default yang diambil dari variabel lingkungan :envvar:`PYTHONPATH`, atau dari bawaan bawaan jika :envvar:`PYTHONPATH` tidak disetel. Anda dapat memodifikasinya menggunakan operasi standar untuk *list*::

source: The :func:`dir` Function
id: Fungsi :func:`dir`

source: The built-in function :func:`dir` is used to find out which names a module defines. It returns a sorted list of strings::
id: Fungsi bawaan :func:`dir` digunakan untuk mencari tahu nama-nama yang ditentukan oleh modul. Ia mengembalikan *list* string yang diurutkan::

source: Without arguments, :func:`dir` lists the names you have defined currently::
id: Tanpa argumen, :func:`dir` mencantumkan nama yang telah Anda tentukan saat ini::

source: Note that it lists all types of names: variables, modules, functions, etc.
id: Perhatikan bahwa ini mencantumkan semua jenis nama: variabel, modul, fungsi, dll.

source: :func:`dir` does not list the names of built-in functions and variables. If you want a list of those, they are defined in the standard module :mod:`builtins`::
id: :func:`dir` tidak mencantumkan nama fungsi dan variabel bawaan. Jika Anda ingin daftar itu, mereka didefinisikan dalam modul standar :mod:`builtins`::

source: Packages
id: Paket

source: Packages are a way of structuring Python's module namespace by using "dotted module names". For example, the module name :mod:`A.B` designates a submodule named ``B`` in a package named ``A``. Just like the use of modules saves the authors of different modules from having to worry about each other's global variable names, the use of dotted module names saves the authors of multi-module packages like NumPy or Pillow from having to worry about each other's module names.
id: Paket adalah cara penataan *namespace* modul Python dengan menggunakan "dotted module names". Sebagai contoh, nama modul :mod:`A.B` menetapkan submodule bernama ``B`` dalam sebuah paket bernama ``A``. Sama seperti penggunaan modul menyelamatkan penulis modul yang berbeda dari harus khawatir tentang nama variabel global masing-masing, penggunaan nama modul bertitik menyelamatkan penulis paket multi-modul seperti NumPy atau Pillow dari harus khawatir tentang nama modul masing-masing .

source: Suppose you want to design a collection of modules (a "package") for the uniform handling of sound files and sound data. There are many different sound file formats (usually recognized by their extension, for example: :file:`.wav`, :file:`.aiff`, :file:`.au`), so you may need to create and maintain a growing collection of modules for the conversion between the various file formats. There are also many different operations you might want to perform on sound data (such as mixing, adding echo, applying an equalizer function, creating an artificial stereo effect), so in addition you will be writing a never-ending stream of modules to perform these operations. Here's a possible structure for your package (expressed in terms of a hierarchical filesystem):
id: Misalkan Anda ingin merancang koleksi modul ("paket") untuk penanganan berkas suara dan data suara yang seragam. Ada banyak format berkas suara yang berbeda (biasanya dikenali oleh ekstensi mereka, misalnya: :file:`.wav`, :file:`.aiff`, :file:`.au`), jadi Anda mungkin perlu membuat dan memelihara koleksi modul yang terus bertambah untuk konversi antara berbagai format file. Ada juga banyak operasi berbeda yang mungkin ingin Anda lakukan pada data suara (seperti mencampur, menambahkan gema, menerapkan fungsi equalizer, menciptakan efek stereo buatan), jadi selain itu Anda akan menulis aliran modul tanpa henti untuk melakukan operasi ini. Berikut adalah struktur yang mungkin untuk paket Anda (dinyatakan dalam hierarki sistem file):

source: When importing the package, Python searches through the directories on ``sys.path`` looking for the package subdirectory.
id: Saat mengimpor paket, Python mencari melalui direktori pada ``sys.path`` mencari subdirektori paket.
