Repository: python/python-docs-id
Catalog: python-newest.library--glob/*.po
Languages: id

source: :mod:`glob` --- Unix style pathname pattern expansion
id: :mod:`glob` --- Ekspansi pola nama jalur bergaya Unix

source: **Source code:** :source:`Lib/glob.py`
id: **Kode sumber:** :source:`Lib/glob.py`

source: The :mod:`glob` module finds all the pathnames matching a specified pattern according to the rules used by the Unix shell, although results are returned in arbitrary order. No tilde expansion is done, but ``*``, ``?``, and character ranges expressed with ``[]`` will be correctly matched. This is done by using the :func:`os.scandir` and :func:`fnmatch.fnmatch` functions in concert, and not by actually invoking a subshell. Note that unlike :func:`fnmatch.fnmatch`, :mod:`glob` treats filenames beginning with a dot (``.``) as special cases. (For tilde and shell variable expansion, use :func:`os.path.expanduser` and :func:`os.path.expandvars`.)
id: Modul :mod:`glob` menemukan semua nama lokasi yang cocok dengan pola yang ditentukan sesuai dengan aturan yang digunakan oleh shell Unix, meskipun hasilnya dikembalikan dalam urutan arbitrer. Tidak ada ekspansi tilde yang dilakukan, tetapi ``*``, ``?``, Dan rentang karakter yang diekspresikan dengan ``[]`` akan dicocokkan dengan benar. Ini dilakukan dengan menggunakan fungsi :func:`os.scandir` dan :func:`fnmatch.fnmatch` secara bersamaan, dan bukan dengan benar-benar memanggil subshell. Perhatikan bahwa tidak seperti :func:`fnmatch.fnmatch`, :mod:`glob` memperlakukan nama file yang dimulai dengan titik (``.``) sebagai kasus khusus. (Untuk ekspansi variabel tilde dan shell, gunakan :func:`os.path.expanduser` dan :func:`os.path.expandvars`.)

source: For a literal match, wrap the meta-characters in brackets. For example, ``'[?]'`` matches the character ``'?'``.
id: Untuk mencocokan literal, bungkus karakter meta dalam tanda kurung. Misalnya, ``'[?]'`` cocok dengan karakter ``'?'``.

source: The :mod:`pathlib` module offers high-level path objects.
id: Modul :mod:`pathlib` menawarkan objek jalur tingkat tinggi.

source: Return a possibly-empty list of path names that match *pathname*, which must be a string containing a path specification. *pathname* can be either absolute (like :file:`/usr/src/Python-1.5/Makefile`) or relative (like :file:`../../Tools/\*/\*.gif`), and can contain shell-style wildcards. Broken symlinks are included in the results (as in the shell). Whether or not the results are sorted depends on the file system. If a file that satisfies conditions is removed or added during the call of this function, whether a path name for that file be included is unspecified.
id: Mengembalikan daftar nama jalur yang mungkin kosong yang cocok dengan *nama jalur*, yang harus berupa string yang berisi spesifikasi jalur. *nama jalur* dapat berupa absolut (seperti :file:`/usr/src/Python-1.5/Makefile`) atau relatif (seperti :file:`../../Tools/\*/\*.gif`), dan dapat berisi karakter pengganti bergaya shell. Symlink yang rusak disertakan dalam hasil (seperti di shell). Apakah hasil diurutkan atau tidak tergantung pada sistem file. Jika file yang memenuhi kondisi dihapus atau ditambahkan selama panggilan fungsi ini, apakah nama jalur untuk file tersebut disertakan tidak ditentukan.

source: If *recursive* is true, the pattern "``**``" will match any files and zero or more directories, subdirectories and symbolic links to directories. If the pattern is followed by an :data:`os.sep` or :data:`os.altsep` then files will not match.
id: Jika *rekursif* benar, pola "``**``" akan cocok dengan semua file dan nol atau lebih direktori, subdirektori, dan tautan simbolis ke direktori. Jika pola diikuti oleh :data:`os.sep` atau :data:`os.altsep` maka file tidak akan cocok.

source: Raises an :ref:`auditing event <auditing>` ``glob.glob`` with arguments ``pathname``, ``recursive``.
id: Memunculkan :ref:`auditing event <auditing>` ``glob.glob`` dengan argument ``pathname``, ``recursive``.

source: Using the "``**``" pattern in large directory trees may consume an inordinate amount of time.
id: Menggunakan pola "``**``" di pohon direktori yang besar dapat menghabiskan banyak waktu.

source: Support for recursive globs using "``**``".
id: Dukungan untuk glob rekursif menggunakan "``**``".

source: Return an :term:`iterator` which yields the same values as :func:`glob` without actually storing them all simultaneously.
id: Mengembalikan sebuah :term:`iterator` yang menghasilkan nilai yang sama dengan :func:`glob` tanpa benar-benar menyimpan semuanya secara bersamaan.

source: Escape all special characters (``'?'``, ``'*'`` and ``'['``). This is useful if you want to match an arbitrary literal string that may have special characters in it. Special characters in drive/UNC sharepoints are not escaped, e.g. on Windows ``escape('//?/c:/Quo vadis?.txt')`` returns ``'//?/c:/Quo vadis[?].txt'``.
id: Escape semua karakter khusus (``'?'``, ``'*'`` dan ``'['``). Ini berguna jika Anda ingin mencocokkan string literal arbitrer yang mungkin memiliki karakter khusus di dalamnya. Karakter khusus dalam drive/titik berbagi UNC tidak di-escape, mis. pada Windows ``escape('//?/c:/Quo vadis?.txt')`` mengembalikan ``'//?/c:/Quo vadis[?].txt'``.

source: For example, consider a directory containing the following files: :file:`1.gif`, :file:`2.txt`, :file:`card.gif` and a subdirectory :file:`sub` which contains only the file :file:`3.txt`. :func:`glob` will produce the following results. Notice how any leading components of the path are preserved. ::
id: Misalnya, pertimbangkan direktori yang berisi file-file berikut: :file:`1.gif`, :file:`2.txt`, :file:`card.gif` dan subdirektori :file:`sub` yang hanya berisi file :file: `3.txt`. :func:`glob` akan memberikan hasil sebagai berikut. Perhatikan bagaimana komponen utama jalur dipertahankan. ::

source: If the directory contains files starting with ``.`` they won't be matched by default. For example, consider a directory containing :file:`card.gif` and :file:`.card.gif`::
id: Jika direktori berisi file yang dimulai dengan ``.`` mereka tidak akan dicocokkan secara default. Misalnya, pertimbangkan direktori yang berisi :file:`card.gif` dan :file:`.card.gif` ::

source: Module :mod:`fnmatch`
id: Modul :mod:`fnmatch`

source: Shell-style filename (not path) expansion
id: Ekspansi nama file bergaya shell (bukan jalur)
