Repository: python/python-docs-id
Catalog: python-newest.distributing--index/*.po
Languages: id

source: Distributing Python Modules
id: Mendistribusikan Modul Python

source: As a popular open source development project, Python has an active supporting community of contributors and users that also make their software available for other Python developers to use under open source license terms.
id: Sebagai proyek pengembangan open source yang populer, Python memiliki komunitas pendukung aktif dan pengguna yang juga membuat perangkat lunak mereka tersedia untuk pengembang Python lain untuk digunakan di bawah persyaratan lisensi sumber terbuka.

source: This allows Python users to share and collaborate effectively, benefiting from the solutions others have already created to common (and sometimes even rare!) problems, as well as potentially contributing their own solutions to the common pool.
id: Hal ini memungkinkan pengguna Python untuk berbagi dan berkolaborasi secara efektif, mendapatkan manfaat dari solusi yang telah dibuat oleh orang lain untuk masalah umum (dan kadang-kadang bahkan langka!), Serta berpotensi memberikan kontribusi solusi mereka sendiri ke kumpulan umum.

source: This guide covers the distribution part of the process. For a guide to installing other Python projects, refer to the :ref:`installation guide <installing-index>`.
id: Panduan ini mencakup bagian distribusi dari proses. Untuk panduan untuk melakukan instalasi proyek Python lainnya, lihat: ref: `panduan instalasi`.

source: For corporate and other institutional users, be aware that many organisations have their own policies around using and contributing to open source software. Please take such policies into account when making use of the distribution and installation tools provided with Python.
id: Untuk pengguna korporat dan institusi lainnya, sadarilah bahwa banyak organisasi memiliki kebijakan mereka sendiri tentang penggunaan dan kontribusi untuk perangkat lunak sumber terbuka. Harap pertimbangkan kebijakan tersebut saat menggunakan alat distribusi dan instalasi yang disediakan dengan Python.

source: Key terms
id: Istilah utama

source: the `Python Packaging Index <https://pypi.org>`__ is a public repository of open source licensed packages made available for use by other Python users
id: `Python Packaging Index <https://pypi.org>`__ adalah repositori publik dari paket berlisensi open source yang dibuat tersedia untuk digunakan oleh pengguna Python lain

source: the `Python Packaging Authority <https://www.pypa.io/>`__ are the group of developers and documentation authors responsible for the maintenance and evolution of the standard packaging tools and the associated metadata and file format standards. They maintain a variety of tools, documentation and issue trackers on both `GitHub <https://github.com/pypa>`__ and `Bitbucket <https://bitbucket.org/pypa/>`__.
id: `Python Packaging Authority <https://www.pypa.io/>`__ adalah kelompok pengembang dan penulis dokumentasi yang bertanggung jawab atas pemeliharaan dan evolusi alat pengemasan standar serta standar metadata dan format berkas terkait. Mereka memelihara berbagai alat, dokumentasi dan pelacak isu di `GitHub <https://github.com/pypa>`__ dan `Bitbucket <https://bitbucket.org/pypa/>`__.

source: :mod:`distutils` is the original build and distribution system first added to the Python standard library in 1998. While direct use of :mod:`distutils` is being phased out, it still laid the foundation for the current packaging and distribution infrastructure, and it not only remains part of the standard library, but its name lives on in other ways (such as the name of the mailing list used to coordinate Python packaging standards development).
id: :mod: `distutils` adalah sistem bangun dan distribusi orisinal yang pertama kali ditambahkan ke pustaka standar Python pada tahun 1998. Sementara penggunaan langsung dari :mod: `distutils` sedang dihapus, itu masih meletakkan fondasi untuk pemaketan dan distribusi infrastruktur saat ini , dan itu tidak hanya tetap menjadi bagian dari pustaka standar, tetapi namanya hidup dengan cara lain (seperti nama milis yang digunakan untuk mengkoordinasikan pengembangan paket standar Python).

source: `setuptools`_ is a (largely) drop-in replacement for :mod:`distutils` first published in 2004. Its most notable addition over the unmodified :mod:`distutils` tools was the ability to declare dependencies on other packages. It is currently recommended as a more regularly updated alternative to :mod:`distutils` that offers consistent support for more recent packaging standards across a wide range of Python versions.
id: `setuptools`_ adalah pengganti (sebagian besar) langsung untuk :mod: `distutils` yang pertama kali diterbitkan pada tahun 2004. Penambahannya yang paling penting di atas mod yang tidak dimodifikasi alat :mod: `distutils` adalah kemampuan untuk mendeklarasikan dependensi pada paket-paket lain. Saat ini direkomendasikan sebagai alternatif yang lebih teratur diperbarui untuk :mod: `distutils` yang menawarkan dukungan konsisten untuk standar kemasan yang lebih baru di berbagai versi Python.

source: `wheel`_ (in this context) is a project that adds the ``bdist_wheel`` command to :mod:`distutils`/`setuptools`_. This produces a cross platform binary packaging format (called "wheels" or "wheel files" and defined in :pep:`427`) that allows Python libraries, even those including binary extensions, to be installed on a system without needing to be built locally.
id: `wheel`_ (dalam konteks ini) adalah proyek yang menambahkan perintah ``bdist_wheel`` ke :mod:`distutils`/`setuptools`_. Ini menghasilkan format paket biner lintas platform (disebut "wheels" atau "wheels" dan didefinisikan dalam :pep:`427`) yang memungkinkan pustaka Python, bahkan yang termasuk ekstensi biner, untuk dipasang pada sistem tanpa perlu dibangun secara lokal.

source: Open source licensing and collaboration
id: Lisensi dan kolaborasi sumber terbuka

source: In most parts of the world, software is automatically covered by copyright. This means that other developers require explicit permission to copy, use, modify and redistribute the software.
id: Di sebagian besar dunia, perangkat lunak secara otomatis dilindungi oleh hak cipta. Ini berarti bahwa pengembang lain memerlukan izin eksplisit untuk menyalin, menggunakan, memodifikasi, dan mendistribusikan ulang perangkat lunak.

source: Open source licensing is a way of explicitly granting such permission in a relatively consistent way, allowing developers to share and collaborate efficiently by making common solutions to various problems freely available. This leaves many developers free to spend more time focusing on the problems that are relatively unique to their specific situation.
id: Lisensi sumber terbuka adalah cara untuk secara eksplisit memberikan izin seperti itu dengan cara yang relatif konsisten, memungkinkan pengembang untuk berbagi dan berkolaborasi secara efisien dengan membuat solusi umum untuk berbagai masalah yang tersedia secara bebas. Ini membuat banyak pengembang bebas menghabiskan lebih banyak waktu berfokus pada masalah yang relatif unik untuk situasi khusus mereka.

source: The distribution tools provided with Python are designed to make it reasonably straightforward for developers to make their own contributions back to that common pool of software if they choose to do so.
id: Alat distribusi yang disediakan dengan Python dirancang untuk memudahkan pengembang untuk membuat kontribusi mereka sendiri kembali ke kumpulan perangkat lunak umum jika mereka memilih untuk melakukannya.

source: The same distribution tools can also be used to distribute software within an organisation, regardless of whether that software is published as open source software or not.
id: Alat distribusi yang sama juga dapat digunakan untuk mendistribusikan perangkat lunak dalam suatu organisasi, terlepas dari apakah perangkat lunak tersebut dipublikasikan sebagai perangkat lunak sumber terbuka atau tidak.

source: Installing the tools
id: Instalasi alat

source: The standard library does not include build tools that support modern Python packaging standards, as the core development team has found that it is important to have standard tools that work consistently, even on older versions of Python.
id: Pustaka standar tidak termasuk alat bangun yang mendukung standar pemaketan Python modern, sebagaimana tim pengembang inti telah menemukan bahwa penting untuk memiliki alat standar yang bekerja secara konsisten, bahkan pada versi Python yang terdahulu.

source: The currently recommended build and distribution tools can be installed by invoking the ``pip`` module at the command line::
id: Alat bangun dan distribusi yang direkomendasikan saat ini dapat diinstal dengan menjalankan modul ``pip`` pada baris perintah ::

source: For POSIX users (including Mac OS X and Linux users), these instructions assume the use of a :term:`virtual environment`.
id: Untuk pengguna POSIX (termasuk pengguna Mac OS X dan Linux), petunjuk ini mengasumsikan penggunaan :term: `lingkungan virtual`.

source: For Windows users, these instructions assume that the option to adjust the system PATH environment variable was selected when installing Python.
id: Untuk pengguna Windows, petunjuk ini mengasumsikan bahwa opsi untuk menyesuaikan variabel lingkungan PATH sistem dipilih ketika melakukan instalasi Python.

source: The Python Packaging User Guide includes more details on the `currently recommended tools`_.
id: Panduan Pengguna *Python Packaging* menyertakan lebih banyak rincian tentang `alat yang direkomendasikan saat ini`_.

source: Reading the Python Packaging User Guide
id: Membaca Panduan Pengguna *Python Packaging*

source: The Python Packaging User Guide covers the various key steps and elements involved in creating and publishing a project:
id: Panduan Pengguna *Python Packaging* mencakup berbagai langkah kunci dan elemen yang terlibat dalam membuat dan menerbitkan sebuah proyek:

source: `Project structure`_
id: `Struktur proyek`_

source: `Building and packaging the project`_
id: `Membangun dan memaketkan proyek`_

source: `Uploading the project to the Python Packaging Index`_
id: `Mengunggah proyek ke Indeks Pemaketan Python`_

source: `The .pypirc file`_
id: File ``.pypirc``

source: How do I...?
id: Bagaimana saya...?

source: These are quick answers or links for some common tasks.
id: Ini adalah jawaban cepat atau tautan untuk beberapa tugas umum.

source: ... choose a name for my project?
id: ... pilih nama untuk proyek saya?

source: This isn't an easy topic, but here are a few tips:
id: Ini bukan topik yang mudah, tetapi berikut beberapa kiatnya:

source: check the Python Packaging Index to see if the name is already in use
id: periksa Indeks Pemaketan Python untuk melihat apakah nama tersebut sudah digunakan

source: check popular hosting sites like GitHub, Bitbucket, etc to see if there is already a project with that name
id: periksa situs hosting populer seperti GitHub, Bitbucket, dll untuk melihat apakah sudah ada proyek dengan nama itu

source: check what comes up in a web search for the name you're considering
id: periksa apa yang muncul dalam pencarian web untuk nama yang Anda pertimbangkan

source: avoid particularly common words, especially ones with multiple meanings, as they can make it difficult for users to find your software when searching for it
id: hindari kata-kata yang sangat umum, terutama yang memiliki banyak makna, karena dapat menyulitkan pengguna untuk menemukan perangkat lunak Anda ketika menelusurinya

source: ... create and distribute binary extensions?
id: ... membuat dan mendistribusikan ekstensi biner?

source: This is actually quite a complex topic, with a variety of alternatives available depending on exactly what you're aiming to achieve. See the Python Packaging User Guide for more information and recommendations.
id: Ini sebenarnya adalah topik yang cukup rumit, dengan berbagai alternatif yang tersedia tergantung pada apa yang ingin Anda capai. Lihat Panduan Pengguna *Python Packaging* untuk informasi dan rekomendasi lebih lanjut.

source: `Python Packaging User Guide: Binary Extensions <https://packaging.python.org/guides/packaging-binary-extensions/>`__
id: `Panduan Pengguna *Python Packaging*: Ekstensi Biner <https://packaging.python.org/guides/packaging-binary-extensions/>`__
