Repository: python/python-docs-id
Catalog: library/functions.po
Languages: id

source: *level* specifies whether to use absolute or relative imports. ``0`` (the default) means only perform absolute imports. Positive values for *level* indicate the number of parent directories to search relative to the directory of the module calling :func:`__import__` (see :pep:`328` for the details).
id: *level* menentukan apakah akan menggunakan impor absolut atau relatif. ``0`` (bawaan) berarti hanya melakukan impor absolut. Nilai positif untuk *level* menunjukkan jumlah direktori induk untuk mencari relatif ke direktori pemanggilan modul :func:`__import__` (lihat :pep:`328` untuk detailnya).

source: When the *name* variable is of the form ``package.module``, normally, the top-level package (the name up till the first dot) is returned, *not* the module named by *name*. However, when a non-empty *fromlist* argument is given, the module named by *name* is returned.
id: Ketika variabel *name* dalam bentuk ``package.module``, biasanya, paket tingkat atas (nama hingga titik pertama) dikembalikan, *not* modul dinamai dengan *name*. Namun, ketika argumen tidak-kosong *fromlist * diberikan, modul bernama oleh *name* dikembalikan.

source: For example, the statement ``import spam`` results in bytecode resembling the following code::
id: Sebagai contoh, pernyataan ``import spam`` menghasilkan bytecode yang menyerupai kode berikut::

source: The statement ``import spam.ham`` results in this call::
id: Pernyataan ``import spam.ham`` menghasilkan panggilan ini::

source: Note how :func:`__import__` returns the toplevel module here because this is the object that is bound to a name by the :keyword:`import` statement.
id: Perhatikan caranya :func:`__import__` mengembalikan modul tingkat atas di sini karena ini adalah objek yang terikat pada nama oleh pernyataan :keyword:`import`.

source: On the other hand, the statement ``from spam.ham import eggs, sausage as saus`` results in ::
id: Di sisi lain, pernyataan ``from spam.ham import eggs, sausage as saus`` menghasilkan ::

source: Here, the ``spam.ham`` module is returned from :func:`__import__`. From this object, the names to import are retrieved and assigned to their respective names.
id: Di sini, modul ``spam.ham`` dikembalikan dari :func:`__import__`. Dari objek ini, nama yang akan diimpor diambil dan diisikan ke nama masing-masing.

source: If you simply want to import a module (potentially within a package) by name, use :func:`importlib.import_module`.
id: Jika Anda hanya ingin mengimpor sebuah modul (berpotensi dalam suatu paket) dengan nama, gunakan :func:`importlib.import_module`.

source: Negative values for *level* are no longer supported (which also changes the default value to 0).
id: Nilai negatif untuk *level* tidak lagi didukung (juga mengubah nilai default menjadi 0).

source: Footnotes
id: Catatan kaki

source: Note that the parser only accepts the Unix-style end of line convention. If you are reading the code from a file, make sure to use newline conversion mode to convert Windows or Mac-style newlines.
id: Perhatikan bahwa pengurai hanya menerima konvensi akhir garis *end of line* gaya Unix. Jika Anda membaca kode dari sebuah berkas, pastikan untuk menggunakan mode konversi baris baru untuk mengkonversi baris baru gaya Windows atau Mac.
