Repository: python/python-docs-id
Catalog: library/functions.po
Languages: id

source: Return an integer object constructed from a number or string *x*, or return ``0`` if no arguments are given. If *x* defines :meth:`__int__`, ``int(x)`` returns ``x.__int__()``. If *x* defines :meth:`__index__`, it returns ``x.__index__()``. If *x* defines :meth:`__trunc__`, it returns ``x.__trunc__()``. For floating point numbers, this truncates towards zero.
id: Kembalikan objek integer yang dibangun dari angka atau string *x*, atau kembalikan ``0`` jika tidak ada argumen yang diberikan. Jika *x* mendefinisikan :meth:`__int__`, ``int(x)`` mengembalikan ``x.__int__()``. Jika *x* mendefinisikan :meth:`__index__`, ia mengembalikan ``x.__index__()``. Jika *x* mendefinisikan :meth:`__trunc__`, ia mengembalikan ``x.__trunc__()``. Untuk angka *floating point*, ini memotong menuju nol.

source: If *x* is not a number or if *base* is given, then *x* must be a string, :class:`bytes`, or :class:`bytearray` instance representing an :ref:`integer literal <integers>` in radix *base*. Optionally, the literal can be preceded by ``+`` or ``-`` (with no space in between) and surrounded by whitespace. A base-n literal consists of the digits 0 to n-1, with ``a`` to ``z`` (or ``A`` to ``Z``) having values 10 to 35. The default *base* is 10. The allowed values are 0 and 2--36. Base-2, -8, and -16 literals can be optionally prefixed with ``0b``/``0B``, ``0o``/``0O``, or ``0x``/``0X``, as with integer literals in code. Base 0 means to interpret exactly as a code literal, so that the actual base is 2, 8, 10, or 16, and so that ``int('010', 0)`` is not legal, while ``int('010')`` is, as well as ``int('010', 8)``.
id: Jika *x* bukan angka atau jika *base* diberikan, maka *x* harus berupa string, :class:`bytes`, atau :class:`bytearray` *instance* mewakili :ref:`integer literal <integers>` dalam radix *base*. Secara opsional, literal dapat didahului oleh ``+`` atau ``-`` (tanpa ada ruang di antaranya) dan dikelilingi oleh spasi *whitespace*. Basis-n literal terdiri dari digit 0 hingga n-1, dengan ``a`` hingga ``z`` (atau ``A`` hingga ``Z``) memiliki nilai 10 hingga 35. Nilai bawaan *base* adalah 10. Nilai yang diizinkan adalah 0 dan 2--36. Basis-2, -8, dan -16 literal dapat secara opsional diawali dengan ``0b``/``0B``, ``0o``/``0O``, atau ``0x``/``0X``, seperti halnya literal integer dalam kode. Basis 0 berarti menafsirkan secara tepat sebagai kode literal, sehingga basis aktualnya adalah 2, 8, 10, atau 16, dan sehingga ``int('010', 0)`` tidak sah, sedangkan ``int('010')`` adalah sah, serta ``int('010', 8)``.

source: The integer type is described in :ref:`typesnumeric`.
id: Tipe integer dijelaskan dalam :ref:`typesnumeric`.

source: If *base* is not an instance of :class:`int` and the *base* object has a :meth:`base.__index__ <object.__index__>` method, that method is called to obtain an integer for the base. Previous versions used :meth:`base.__int__ <object.__int__>` instead of :meth:`base.__index__ <object.__index__>`.
id: Jika *base* bukan turunan dari :class:`int` dan objek *base* memiliki metode :meth:`base.__index__ <objek .__ index __>`, metode itu dipanggil untuk mendapatkan integer untuk basis. Versi sebelumnya digunakan :meth:`base.__int__<objek.__int__>` alih-alih :meth: `base.__index__ <objek .__ index __>`.

source: Falls back to :meth:`__index__` if :meth:`__int__` is not defined.
id: Dialihkan ke :meth:`__index__` jika :meth:`__int__` tidak terdefinisi.

source: Return ``True`` if the *object* argument is an instance of the *classinfo* argument, or of a (direct, indirect or :term:`virtual <abstract base class>`) subclass thereof. If *object* is not an object of the given type, the function always returns ``False``. If *classinfo* is a tuple of type objects (or recursively, other such tuples), return ``True`` if *object* is an instance of any of the types. If *classinfo* is not a type or tuple of types and such tuples, a :exc:`TypeError` exception is raised.
id: Kembalikan nilai ``True`` jika argumen *object* adalah instansi dari argumen *classinfo*, atau dari sebuah subkelasnya (langsung, tidak langsung atau :term:`virtual <abstract base class>`). Jika *object* bukan objek dari tipe yang diberikan, fungsi selalu mengembalikan ``False``. Jika *classinfo* adalah *tuple* dari objek tipe (atau secara rekursif, tuple lain semacam itu), kembalikan ``True`` jika *object* adalah instansi dari salah satu tipe. Jika *classinfo* bukan tipe atau tuple dari tipe dan *tuple* semacam itu, eksepsi :exc:`TypeError` dimunculkan.

source: Return ``True`` if *class* is a subclass (direct, indirect or :term:`virtual <abstract base class>`) of *classinfo*. A class is considered a subclass of itself. *classinfo* may be a tuple of class objects, in which case every entry in *classinfo* will be checked. In any other case, a :exc:`TypeError` exception is raised.
id: Kembalikan ``True`` jika *class* adalah sebuah subkelas (langsung, tidak langsung atau :term:`virtual <abstract base class>`) dari *classinfo*. Kelas dianggap sebagai subkelas dari dirinya sendiri. *classinfo* dapat berupa *tuple* dari objek kelas, dalam hal ini setiap entri dalam *classinfo* akan diperiksa. Dalam kasus lain, eksepsi :exc:`TypeError` akan dimunculkan.

source: Return an :term:`iterator` object. The first argument is interpreted very differently depending on the presence of the second argument. Without a second argument, *object* must be a collection object which supports the iteration protocol (the :meth:`__iter__` method), or it must support the sequence protocol (the :meth:`__getitem__` method with integer arguments starting at ``0``). If it does not support either of those protocols, :exc:`TypeError` is raised. If the second argument, *sentinel*, is given, then *object* must be a callable object. The iterator created in this case will call *object* with no arguments for each call to its :meth:`~iterator.__next__` method; if the value returned is equal to *sentinel*, :exc:`StopIteration` will be raised, otherwise the value will be returned.
id: Kembalikan objek :term:`iterator`. Argumen pertama ditafsirkan sangat berbeda tergantung pada keberadaan argumen kedua. Tanpa argumen kedua, *object* harus berupa objek koleksi yang mendukung protokol iterasi (metode :meth:`__iter__`), atau objek tersebut harus mendukung protokol urutan (metode :meth:`__getitem__` dengan argumen integer mulai dari ``0``). Jika tidak mendukung salah satu dari protokol itu, :exc:`TypeError` akan dimunculkan. Jika argumen kedua, *sentinel*, diberikan, maka *object* harus menjadi objek yang bisa dipanggil. *Iterator* yang dibuat dalam kasus ini akan memanggil *object* tanpa argumen untuk setiap panggilan ke :meth:`~iterator.__next__` metode; jika nilai yang dikembalikan sama dengan *sentinel*, :exc: `StopIteration` akan ditimbulkan, jika tidak nilai akan dikembalikan.

source: See also :ref:`typeiter`.
id: Lihat juga :ref:`typeiter`.

source: One useful application of the second form of :func:`iter` is to build a block-reader. For example, reading fixed-width blocks from a binary database file until the end of file is reached::
id: Salah satu kegunaan dari bentuk kedua dari :func:`iter` adalah untuk membangun pembaca blok. Misalnya, membaca blok dengan lebar tetap dari berkas basis data biner hingga akhir file tercapai::

source: Return the length (the number of items) of an object. The argument may be a sequence (such as a string, bytes, tuple, list, or range) or a collection (such as a dictionary, set, or frozen set).
id: Mengembalikan panjang (jumlah item) suatu objek. Argumennya bisa berupa urutan (seperti string, byte, *tuple*, *list*, atau *range*) atau koleksi (seperti *dictionary*, set, atau *frozen set*).

source: Rather than being a function, :class:`list` is actually a mutable sequence type, as documented in :ref:`typesseq-list` and :ref:`typesseq`.
id: Alih-alih menjadi sebuah fungsi, :class:`list` sebenarnya adalah tipe urutan yang bisa berubah *mutable*, seperti yang didokumentasikan dalam :ref:`typesseq-list` dan :ref: `typesseq`.

source: Update and return a dictionary representing the current local symbol table. Free variables are returned by :func:`locals` when it is called in function blocks, but not in class blocks. Note that at the module level, :func:`locals` and :func:`globals` are the same dictionary.
id: Perbarui dan kembalikan *dictionary* yang mewakili tabel simbol lokal saat ini. Variabel bebas dikembalikan oleh :func:`locals` saat dipanggil dalam blok fungsi, tetapi tidak di blok kelas. Perhatikan bahwa pada tingkat modul, :func:`locals` dan :func:`globals` adalah *dictionary* yang sama.

source: The contents of this dictionary should not be modified; changes may not affect the values of local and free variables used by the interpreter.
id: Isi *dictionary* ini tidak boleh dimodifikasi; perubahan mungkin tidak mempengaruhi nilai variabel lokal dan bebas yang digunakan oleh interpreter.

source: Return an iterator that applies *function* to every item of *iterable*, yielding the results. If additional *iterable* arguments are passed, *function* must take that many arguments and is applied to the items from all iterables in parallel. With multiple iterables, the iterator stops when the shortest iterable is exhausted. For cases where the function inputs are already arranged into argument tuples, see :func:`itertools.starmap`\.
id: Kembalikan iterator yang berlaku *function* untuk setiap item *iterable*, menghasilkan *yielding* hasilnya. Jika argumen *iterable* tambahan disahkan, *fungsi* harus menerima banyak argumen dan diterapkan ke item dari semua *iterables* secara paralel. Dengan beberapa iterables, iterator berhenti ketika *iterable* terpendek habis. Untuk kasus-kasus di mana input fungsi sudah diatur ke dalam argumen *tuples*, lihat :func:`itertools.starmap`.

source: Return the largest item in an iterable or the largest of two or more arguments.
id: Kembalikan item terbesar dalam iterable atau yang terbesar dari dua atau lebih argumen.

source: If one positional argument is provided, it should be an :term:`iterable`. The largest item in the iterable is returned. If two or more positional arguments are provided, the largest of the positional arguments is returned.
id: Jika satu argumen posisi disediakan, itu harus berupa :term:`iterable`. Item terbesar di *iterable* dikembalikan. Jika dua atau lebih argumen posisi disediakan, argumen posisi terbesar dikembalikan.

source: There are two optional keyword-only arguments. The *key* argument specifies a one-argument ordering function like that used for :meth:`list.sort`. The *default* argument specifies an object to return if the provided iterable is empty. If the iterable is empty and *default* is not provided, a :exc:`ValueError` is raised.
id: Ada dua opsional hanya argumen kata kunci *keyword arguments*. Argumen *key* menentukan fungsi pengurutan satu argumen seperti yang digunakan untuk :meth:`list.sort`. Argumen *default* menentukan objek yang akan dikembalikan jika yang disediakan itu kosong. Jika iterable kosong dan *default* tidak disediakan, :exc:`ValueError` akan dimunculkan.

source: If multiple items are maximal, the function returns the first one encountered. This is consistent with other sort-stability preserving tools such as ``sorted(iterable, key=keyfunc, reverse=True)[0]`` and ``heapq.nlargest(1, iterable, key=keyfunc)``.
id: Jika beberapa item maksimal, fungsi mengembalikan item pertama yang ditemui. Ini konsisten dengan alat pengawet *preserving* sortir yang stabil lain seperti ``sorted(iterable, key=keyfunc, reverse=True)[0]`` dan ``heapq.nlargest(1, iterable, key=keyfunc)``.

source: The *default* keyword-only argument.
id: *default* hanya argumen kata kunci *keyword argument*.

source: The *key* can be ``None``.
id: *key* bisa jadi ``None``.

source: Return a "memory view" object created from the given argument. See :ref:`typememoryview` for more information.
id: Kembalikan objek "memory view" yang dibuat dari argumen yang diberikan. Lihat :ref:`typememoryview` untuk informasi lebih lanjut.

source: Return the smallest item in an iterable or the smallest of two or more arguments.
id: Kembalikan item terkecil dalam *iterable* atau terkecil dari dua atau lebih argumen.

source: If one positional argument is provided, it should be an :term:`iterable`. The smallest item in the iterable is returned. If two or more positional arguments are provided, the smallest of the positional arguments is returned.
id: Jika satu argumen posisi disediakan, itu harus berupa :term:`iterable`. Item terkecil di *iterable* dikembalikan. Jika dua atau lebih argumen posisional disediakan, argumen posisional terkecil akan dikembalikan.

source: If multiple items are minimal, the function returns the first one encountered. This is consistent with other sort-stability preserving tools such as ``sorted(iterable, key=keyfunc)[0]`` and ``heapq.nsmallest(1, iterable, key=keyfunc)``.
id: Jika beberapa item minimal, fungsi mengembalikan item pertama yang ditemui. Ini konsisten dengan alat pengawet *preserving* sortir yang stabil lain seperti ``sorted(iterable, key=keyfunc)[0]`` dan ``heapq.nsmallest(1, iterable, key=keyfunc)``.

source: Retrieve the next item from the *iterator* by calling its :meth:`~iterator.__next__` method. If *default* is given, it is returned if the iterator is exhausted, otherwise :exc:`StopIteration` is raised.
id: Ambil item berikutnya dari *iterator* dengan memanggil metode :meth:`~iterator.__next__`. Jika *default* diberikan, itu dikembalikan jika *iterator* habis, jika tidak :exc:`StopIteration` akan dimunculkan.

source: Return a new featureless object. :class:`object` is a base for all classes. It has the methods that are common to all instances of Python classes. This function does not accept any arguments.
id: Kembalikan objek tanpa fitur baru. :class:`object` adalah basis untuk semua kelas. Ini memiliki metode yang umum untuk semua contoh kelas Python. Fungsi ini tidak menerima argumen apa pun.

source: :class:`object` does *not* have a :attr:`~object.__dict__`, so you can't assign arbitrary attributes to an instance of the :class:`object` class.
id: :class:`object` *not* memiliki :attr:`~objek.__dict__`, jadi Anda tidak dapat menetapkan atribut *arbitrary* ke turunan dari kelas :class:`object`.

source: Convert an integer number to an octal string prefixed with "0o". The result is a valid Python expression. If *x* is not a Python :class:`int` object, it has to define an :meth:`__index__` method that returns an integer. For example:
id: Ubah angka integer menjadi string oktal yang diawali dengan "0o". Hasilnya adalah ekspresi Python yang valid. Jika *x* bukan objek Python :class: `int`, ia harus mendefinisikan metode :meth:`__index__` yang mengembalikan integer. Sebagai contoh:

source: If you want to convert an integer number to octal string either with prefix "0o" or not, you can use either of the following ways.
id: Jika Anda ingin mengonversi bilangan bulat menjadi string oktal baik dengan awalan "0o" atau tidak, Anda dapat menggunakan salah satu dari cara berikut.

source: Open *file* and return a corresponding :term:`file object`. If the file cannot be opened, an :exc:`OSError` is raised. See :ref:`tut-files` for more examples of how to use this function.
id: Buka *file* dan mengembalikan yang sesuai dengan :term:`file object`. Jika file tersebut tidak dapat dibuka, sebuah :exc:`OSError` akan dinaikkan. Lihat :ref:`tut-files` untuk contoh yang lebih banyak terkait bagaimana menggunakan fungsi ini.

source: *file* is a :term:`path-like object` giving the pathname (absolute or relative to the current working directory) of the file to be opened or an integer file descriptor of the file to be wrapped. (If a file descriptor is given, it is closed when the returned I/O object is closed, unless *closefd* is set to ``False``.)
id: *file* adalah :term:`path-like object` yang memberikan jalur nama *pathname* (absolut atau relatif terhadap direktori kerja saat ini) dari berkas yang akan dibuka atau deskriptor berkas integer dari berkas yang akan dibungkus. (Jika deskriptor berkas diberikan, itu ditutup ketika objek I/O yang dikembalikan ditutup, kecuali *closefd* diatur ke ``False``.)

source: *mode* is an optional string that specifies the mode in which the file is opened. It defaults to ``'r'`` which means open for reading in text mode. Other common values are ``'w'`` for writing (truncating the file if it already exists), ``'x'`` for exclusive creation and ``'a'`` for appending (which on *some* Unix systems, means that *all* writes append to the end of the file regardless of the current seek position). In text mode, if *encoding* is not specified the encoding used is platform dependent: ``locale.getpreferredencoding(False)`` is called to get the current locale encoding. (For reading and writing raw bytes use binary mode and leave *encoding* unspecified.) The available modes are:
id: *mode* adalah string opsional yang menentukan mode di mana berkas dibuka. Bawaannya adalah ``'r'`` yang artinya terbuka untuk membaca dalam mode teks. Nilai umum lainnya adalah ``'w'`` untuk penulisan (mengosongkan berkas jika sudah ada), ``'x'`` untuk pembuatan eksklusif dan ``'a'`` untuk menambahkan (yang pada *beberapa* sistem Unix, berarti bahwa *all* penulisan ditambahkan ke akhir file terlepas dari posisi pencarian saat ini). Dalam mode teks, jika *encoding* tidak ditentukan, penyandian *encoding* yang digunakan bergantung pada platform: ``locale.getpreferredencoding(False)`` dipanggil untuk mendapatkan penyandian lokal *locale encoding* saat ini. (Untuk membaca dan menulis byte *raw*, gunakan mode biner dan biarkan *encoding* tidak ditentukan.) Mode yang tersedia adalah:

source: Character
id: Karakter

source: Meaning
id: Artinya

source: open for reading (default)
id: terbuka untuk membaca (bawaan)

source: open for writing, truncating the file first
id: buka untuk menulis, mengosongkan berkas terlebih dahulu

source: open for exclusive creation, failing if the file already exists
id: terbuka untuk pembuatan eksklusif, gagal jika file sudah ada

source: open for writing, appending to the end of the file if it exists
id: terbuka untuk menulis, menambahkan di bagian akhir berkas jika ada

source: binary mode
id: mode biner

source: text mode (default)
id: mode teks (bawaan)

source: open for updating (reading and writing)
id: terbuka untuk memperbarui (membaca dan menulis)

source: The default mode is ``'r'`` (open for reading text, synonym of ``'rt'``). Modes ``'w+'`` and ``'w+b'`` open and truncate the file. Modes ``'r+'`` and ``'r+b'`` open the file with no truncation.
id: Mode bawaan adalah ``'r'`` (terbuka untuk membaca teks, sinonim dari ``'rt'``). Mode ``'w+'`` dan ``'w+b'`` membuka dan mengosongkan berkas. Mode ``'r+'`` dan ``'r+b'`` membuka file tanpa mengosongkan.

source: As mentioned in the :ref:`io-overview`, Python distinguishes between binary and text I/O. Files opened in binary mode (including ``'b'`` in the *mode* argument) return contents as :class:`bytes` objects without any decoding. In text mode (the default, or when ``'t'`` is included in the *mode* argument), the contents of the file are returned as :class:`str`, the bytes having been first decoded using a platform-dependent encoding or using the specified *encoding* if given.
id: Seperti disebutkan dalam :ref:`io-overview`, Python membedakan antara biner dan teks I/O. Berkas dibuka dalam mode biner (termasuk ``'b'`` dalam argumen *mode*) mengembalikan konten sebagai objek :class:`bytes` tanpa *decoding*. Dalam mode teks (bawaan, atau ketika ``'t'`` termasuk dalam argumen *mode*), isi file dikembalikan sebagai :class:`str`, byte yang pertama kali diterjemahkan *decoded* menggunakan *encoding* bergantung-platform atau menggunakan *encoding* yang ditentukan jika diberikan.

source: There is an additional mode character permitted, ``'U'``, which no longer has any effect, and is considered deprecated. It previously enabled :term:`universal newlines` in text mode, which became the default behaviour in Python 3.0. Refer to the documentation of the :ref:`newline <open-newline-parameter>` parameter for further details.
id: Ada karakter mode tambahan yang diizinkan, ``'U'``, yang tidak lagi memiliki efek apa pun, dan dianggap sudah usang. Ini sebelumnya diaktifkan :term:`universal newlines` dalam mode teks, yang menjadi perilaku bawaan di Python 3.0. Rujuk ke dokumentasi parameter :ref:`newline <open-newline-parameter>` untuk rincian lebih lanjut.

source: Python doesn't depend on the underlying operating system's notion of text files; all the processing is done by Python itself, and is therefore platform-independent.
id: Python tidak tergantung pada gagasan sistem operasi yang mendasari file teks; semua pemrosesan dilakukan oleh Python sendiri, dan oleh karena itu tidak bergantung platform.

source: *buffering* is an optional integer used to set the buffering policy. Pass 0 to switch buffering off (only allowed in binary mode), 1 to select line buffering (only usable in text mode), and an integer > 1 to indicate the size in bytes of a fixed-size chunk buffer. When no *buffering* argument is given, the default buffering policy works as follows:
id: *buffering* adalah integer opsional yang digunakan untuk mengatur kebijakan *buffering*. Berikan nilai 0 untuk menonaktifkan *buffering* (hanya diizinkan dalam mode biner), 1 untuk memilih *line buffering* (hanya dapat digunakan dalam mode teks), dan integer > 1 untuk menunjukkan ukuran dalam byte penyangga potongan *chunk* berukuran tetap. Ketika tidak ada argumen *buffering* yang diberikan, kebijakan *buffering* bawaan berfungsi sebagai berikut:

source: Binary files are buffered in fixed-size chunks; the size of the buffer is chosen using a heuristic trying to determine the underlying device's "block size" and falling back on :attr:`io.DEFAULT_BUFFER_SIZE`. On many systems, the buffer will typically be 4096 or 8192 bytes long.
id: File biner disangga *buffered* dalam potongan ukuran tetap; ukuran penyangga dipilih menggunakan heuristik yang mencoba menentukan "block size" perangkat yang mendasarinya dan bergantung pada :attr:`io.DEFAULT_BUFFER_SIZE`. Pada banyak sistem, panjang penyangga biasanya adalah 4096 atau 8192 byte.

source: "Interactive" text files (files for which :meth:`~io.IOBase.isatty` returns ``True``) use line buffering. Other text files use the policy described above for binary files.
id: Berkas teks "interactive" (berkas yang :meth:`~io.IOBase.isatty` mengembalikan ``True``) menggunakan *line buffering*. File teks lainnya menggunakan kebijakan yang dijelaskan di atas untuk file biner.

source: *encoding* is the name of the encoding used to decode or encode the file. This should only be used in text mode. The default encoding is platform dependent (whatever :func:`locale.getpreferredencoding` returns), but any :term:`text encoding` supported by Python can be used. See the :mod:`codecs` module for the list of supported encodings.
id: *encoding* adalah nama penyandian *encoding* yang digunakan untuk menerjemahkan *decode* atau menyandikan *encode* berkas. Ini hanya digunakan dalam mode teks. *encoding* bawaan bergantung pada platform (apa pun kembalian :func:`locale.getpreferredencoding`), tetapi apa pun :term:`text encoding` yang didukung oleh Python dapat digunakan. Lihat modul :mod:`codecs` untuk daftar penyandian *encoding* yang didukung.
