Repository: python/python-docs-id
Catalog: library/functions.po
Languages: id

source: Take two (non complex) numbers as arguments and return a pair of numbers consisting of their quotient and remainder when using integer division. With mixed operand types, the rules for binary arithmetic operators apply. For integers, the result is the same as ``(a // b, a % b)``. For floating point numbers the result is ``(q, a % b)``, where *q* is usually ``math.floor(a / b)`` but may be 1 less than that. In any case ``q * b + a % b`` is very close to *a*, if ``a % b`` is non-zero it has the same sign as *b*, and ``0 <= abs(a % b) < abs(b)``.
id: Ambil dua angka (bukan kompleks) sebagai argumen dan kembalikan sepasang angka yang terdiri dari hasil bagi dan sisanya ketika menggunakan divisi integer. Dengan tipe operan campuran, aturan untuk operator aritmatika biner berlaku. Untuk bilangan bulat, hasilnya sama dengan ``(a // b, a % b)``. Untuk angka pecahan *floating point* hasilnya adalah ``(q, a % b)``, di mana *q* biasanya ``math.floor(a / b)`` tetapi mungkin 1 kurang dari itu. Bagaimanapun, ``q * b + a % b`` sangat dekat dengan *a*, jika ``a % b`` adalah bukan nol, ia memiliki tanda yang sama dengan *b*, dan ``0 <= abs(a % b) < abs(b)``.

source: Return an enumerate object. *iterable* must be a sequence, an :term:`iterator`, or some other object which supports iteration. The :meth:`~iterator.__next__` method of the iterator returned by :func:`enumerate` returns a tuple containing a count (from *start* which defaults to 0) and the values obtained from iterating over *iterable*.
id: Kembalikan objek enumerasi. *iterable* harus berupa urutan, sebuah :term:`iterator`, atau objek lain yang mendukung iterasi. The :meth:`~iterator.__next__` metode iterator dikembalikan oleh :func:`enumerate` mengembalikan tuple yang berisi hitungan (dari *start* yang bawaan ke 0) dan nilai yang diperoleh dari mengelilingi *iterable*.

source: Equivalent to::
id: Setara dengan::

source: The arguments are a string and optional globals and locals. If provided, *globals* must be a dictionary. If provided, *locals* can be any mapping object.
id: Argumennya adalah string dan opsional global dan lokal. Jika disediakan, *globals* harus berupa *dictionary*. Jika disediakan, *locals* dapat berupa objek pemetaan apa pun.

source: The return value is the result of the evaluated expression. Syntax errors are reported as exceptions. Example:
id: Nilai kembalian adalah hasil dari ekspresi yang dievaluasi. Kesalahan sintaks dilaporkan sebagai pengecualian. Contoh:

source: This function can also be used to execute arbitrary code objects (such as those created by :func:`compile`). In this case pass a code object instead of a string. If the code object has been compiled with ``'exec'`` as the *mode* argument, :func:`eval`\'s return value will be ``None``.
id: Fungsi ini juga dapat digunakan untuk mengeksekusi objek kode *arbitrary* (seperti yang dibuat oleh :func:`compile`). Dalam hal ini, berikan objek kode alih-alih string. Jika objek kode telah dikompilasi dengan ``'exec'`` sebagai argumen *mode*, :func:`eval` nilai kembaliannya akan menjadi ``None``.

source: Hints: dynamic execution of statements is supported by the :func:`exec` function. The :func:`globals` and :func:`locals` functions returns the current global and local dictionary, respectively, which may be useful to pass around for use by :func:`eval` or :func:`exec`.
id: Petunjuk: eksekusi dinamis dari pernyataan didukung oleh fungsi :func:`exec`. Fungsi :func:`globals` dan :func:`locals` mengembalikan kamus global dan lokal saat ini, masing-masing, yang mungkin berguna untuk diedarkan untuk digunakan oleh :func:`eval` atau :func:`exec`.

source: See :func:`ast.literal_eval` for a function that can safely evaluate strings with expressions containing only literals.
id: Lihat :func:`ast.literal_eval` untuk fungsi yang dapat dengan aman mengevaluasi string dengan ekspresi yang hanya mengandung literal.

source: Raises an :ref:`auditing event <auditing>` ``exec`` with argument ``code_object``.
id: Memunculkan :ref:`auditing event <auditing>` ``exec`` dengan argumen ``code_object``.

source: Raises an :ref:`auditing event <auditing>` ``exec`` with the code object as the argument. Code compilation events may also be raised.
id: Memunculkan :ref:`auditing event <auditing>` ``exec`` dengan objek kode sebagai argumen. Kompilasi kode *events* juga dapat dimunculkan.

source: This function supports dynamic execution of Python code. *object* must be either a string or a code object. If it is a string, the string is parsed as a suite of Python statements which is then executed (unless a syntax error occurs). [#]_ If it is a code object, it is simply executed. In all cases, the code that's executed is expected to be valid as file input (see the section "File input" in the Reference Manual). Be aware that the :keyword:`return` and :keyword:`yield` statements may not be used outside of function definitions even within the context of code passed to the :func:`exec` function. The return value is ``None``.
id: Fungsi ini mendukung eksekusi dinamis kode Python. *object* harus berupa string atau objek kode. Jika itu adalah string, string tersebut diuraikan sebagai paket pernyataan Python yang kemudian dieksekusi (kecuali terjadi kesalahan sintaksis). [#]_ Jika itu adalah objek kode, itu hanya dieksekusi. Dalam semua kasus, kode yang dieksekusi diharapkan valid sebagai input file (lihat bagian "Input file" dalam Manual Referensi). Perlu diketahui bahwa pernyataan :keyword:`return` dan :keyword:`yield` tidak boleh digunakan di luar definisi fungsi bahkan dalam konteks kode yang diteruskan ke fungsi :func:`exec`. Nilai kembalian adalah ``None``.

source: In all cases, if the optional parts are omitted, the code is executed in the current scope. If only *globals* is provided, it must be a dictionary (and not a subclass of dictionary), which will be used for both the global and the local variables. If *globals* and *locals* are given, they are used for the global and local variables, respectively. If provided, *locals* can be any mapping object. Remember that at module level, globals and locals are the same dictionary. If exec gets two separate objects as *globals* and *locals*, the code will be executed as if it were embedded in a class definition.
id: Dalam semua kasus, jika bagian-bagian opsional dihilangkan, kode dieksekusi dalam lingkup saat ini. Jika hanya *globals* disediakan, itu harus berupa *dictionary* (dan bukan subkelas *dictionary*), yang akan digunakan untuk variabel global dan lokal. Jika *globals* dan *locals* diberikan, masing-masing digunakan untuk variabel global dan lokal. Jika disediakan, *locals* dapat berupa objek pemetaan apa pun. Ingat bahwa pada level modul, global dan lokal adalah kamus yang sama. Jika exec mendapat dua objek terpisah sebagai *globals* dan *lokals*, kode akan dieksekusi seolah-olah itu tertanam dalam definisi kelas.

source: If the *globals* dictionary does not contain a value for the key ``__builtins__``, a reference to the dictionary of the built-in module :mod:`builtins` is inserted under that key. That way you can control what builtins are available to the executed code by inserting your own ``__builtins__`` dictionary into *globals* before passing it to :func:`exec`.
id: Jika *dictionary* *globals* tidak mengandung nilai untuk kunci ``__builtins__``, referensi ke *dictionary* modul bawaan :mod:`builtins` dimasukkan di bawah kunci itu. Dengan begitu Anda dapat mengontrol bawaan apa yang tersedia untuk kode yang dieksekusi dengan memasukkan *dictionary* ``__builtins__`` Anda sendiri ke *globals* sebelum meneruskannya ke :func:`exec`.

source: The built-in functions :func:`globals` and :func:`locals` return the current global and local dictionary, respectively, which may be useful to pass around for use as the second and third argument to :func:`exec`.
id: Fungsi bawaan :func: `globals` dan :func:`locals` masing-masing mengembalikan *dictionary* global dan lokal, yang mungkin berguna untuk digunakan sebagai argumen kedua dan ketiga untuk :func:`exec` .

source: The default *locals* act as described for function :func:`locals` below: modifications to the default *locals* dictionary should not be attempted. Pass an explicit *locals* dictionary if you need to see effects of the code on *locals* after function :func:`exec` returns.
id: Bawaan *locals* bertindak seperti yang dijelaskan untuk fungsi :func:`locals` di bawah: modifikasi ke *dictionary* *locals* default tidak boleh dicoba. Melewatkan *dictionary *locals* eksplisit jika Anda perlu melihat efek kode pada *locals* setelah fungsi :func:`exec` mengembalikan.

source: Construct an iterator from those elements of *iterable* for which *function* returns true. *iterable* may be either a sequence, a container which supports iteration, or an iterator. If *function* is ``None``, the identity function is assumed, that is, all elements of *iterable* that are false are removed.
id: Bangun sebuah *iterator* dari elemen-elemen *iterable* yang *functions* mengembalikan benar. *iterable* dapat berupa urutan, wadah *container* yang mendukung iterasi, atau *iterator*. Jika *function* adalah ``None``, fungsi identitas diasumsikan, yaitu, semua elemen *iterable* yang salah dihapus.

source: Note that ``filter(function, iterable)`` is equivalent to the generator expression ``(item for item in iterable if function(item))`` if function is not ``None`` and ``(item for item in iterable if item)`` if function is ``None``.
id: Perhatikan bahwa ``filter(function, iterable)`` setara dengan ekspresi generator ``(item for item in iterable if function(item))`` jika *function* tidak ``None`` dan ``(item for item in iterable if item)`` if *function* adalah ``None``.

source: See :func:`itertools.filterfalse` for the complementary function that returns elements of *iterable* for which *function* returns false.
id: Lihat :func:`itertools.filterfalse` untuk fungsi komplementer yang mengembalikan elemen *iterable* yang berfungsi *function* mengembalikan salah.

source: Return a floating point number constructed from a number or string *x*.
id: Kembalikan angka pecahan *floating point* yang dibangun dari angka atau string *x*.

source: If the argument is a string, it should contain a decimal number, optionally preceded by a sign, and optionally embedded in whitespace. The optional sign may be ``'+'`` or ``'-'``; a ``'+'`` sign has no effect on the value produced. The argument may also be a string representing a NaN (not-a-number), or a positive or negative infinity. More precisely, the input must conform to the following grammar after leading and trailing whitespace characters are removed:
id: Jika argumennya berupa string, harus berisi angka desimal, secara opsional didahului oleh tanda, dan secara opsional tertanam di spasi *whitespace*. Tanda opsional mungkin ``'+'`` atau ``'-'``; tanda ``'+'`` tidak memengaruhi nilai yang dihasilkan. Argumen juga dapat berupa string yang mewakili NaN (bukan angka), atau tak terhingga positif atau negatif. Lebih tepatnya, masukan harus sesuai dengan tata bahasa berikut karakter spasi awalan dan akhiran dihapus:

source: Here ``floatnumber`` is the form of a Python floating-point literal, described in :ref:`floating`. Case is not significant, so, for example, "inf", "Inf", "INFINITY" and "iNfINity" are all acceptable spellings for positive infinity.
id: Di sini ``floatnumber`` adalah bentuk Python *floating-point* literal, dijelaskan dalam :ref:`floating`. Kasus tidak signifikan, jadi, misalnya, "inf", "Inf", "INFINITY" dan "iNfINity" adalah semua ejaan yang dapat diterima untuk infinity positif.

source: Otherwise, if the argument is an integer or a floating point number, a floating point number with the same value (within Python's floating point precision) is returned. If the argument is outside the range of a Python float, an :exc:`OverflowError` will be raised.
id: Kalau tidak, jika argumennya adalah bilangan bulat atau angka pecahan *floating point*, angka pecahan dengan nilai yang sama (dalam presisi *floating point* Python) dikembalikan. Jika argumen di luar kisaran *float* Python, :exc:`OverflowError` akan dimunculkan.

source: For a general Python object ``x``, ``float(x)`` delegates to ``x.__float__()``. If ``__float__()`` is not defined then it falls back to :meth:`__index__`.
id: Untuk objek Python umum ``x``, ``float(x)`` didelegasikan ke ``x.__float__()``. Jika ``__float__()`` tidak terdefinisi maka beralih ke :meth:`__index__`.

source: If no argument is given, ``0.0`` is returned.
id: Jika tidak ada argumen yang diberikan, dikembalikan sebagai ``0.0``.

source: Examples::
id: Contoh::

source: The float type is described in :ref:`typesnumeric`.
id: Tipe float dijelaskan dalam :ref:`typesnumeric`.

source: Falls back to :meth:`__index__` if :meth:`__float__` is not defined.
id: Dialihkan ke :meth:`__index__` jika :meth:`__float__` tidak terdefinisi.

source: Convert a *value* to a "formatted" representation, as controlled by *format_spec*. The interpretation of *format_spec* will depend on the type of the *value* argument, however there is a standard formatting syntax that is used by most built-in types: :ref:`formatspec`.
id: Konversi *value* ke representasi "formatted", sebagaimana dikendalikan oleh *format_spec*. Interpretasi *format_spec* akan tergantung pada jenis argumen *value*, namun ada sintaks pemformatan standar yang digunakan oleh sebagian besar tipe bawaan: :ref:`formatpec`.

source: The default *format_spec* is an empty string which usually gives the same effect as calling :func:`str(value) <str>`.
id: Default *format_spec* adalah string kosong yang biasanya memberikan efek yang sama dengan memanggil :func:`str(value) <str>`.

source: A call to ``format(value, format_spec)`` is translated to ``type(value).__format__(value, format_spec)`` which bypasses the instance dictionary when searching for the value's :meth:`__format__` method. A :exc:`TypeError` exception is raised if the method search reaches :mod:`object` and the *format_spec* is non-empty, or if either the *format_spec* or the return value are not strings.
id: Pemanggilan ke ``format(value, format_spec)`` diterjemahkan ke ``type(value).__format__(value, format_spec)`` yang memintas *instance* *dictionary* saat mencari nilai dari methode :met:`__format__`. Pengecualian *exception* :exc:`TypeError` dimunculkan jika pencarian metode mencapai :mod:`object` dan *format_spec* tidak kosong, atau jika *format_spec* atau nilai kembalian bukan string.

source: ``object().__format__(format_spec)`` raises :exc:`TypeError` if *format_spec* is not an empty string.
id: ``object().__format__(format_spec)`` menimbulkan :exc:`TypeError` jika *format_spec* bukan string kosong.

source: Return a new :class:`frozenset` object, optionally with elements taken from *iterable*. ``frozenset`` is a built-in class. See :class:`frozenset` and :ref:`types-set` for documentation about this class.
id: Kembalikan objek baru :class:`frozenset`, secara opsional dengan elemen yang diambil dari *iterable*. ``frozenset`` adalah kelas bawaan. Lihat :class:`frozenset` dan :ref:`types-set` untuk dokumentasi tentang kelas ini.

source: For other containers see the built-in :class:`set`, :class:`list`, :class:`tuple`, and :class:`dict` classes, as well as the :mod:`collections` module.
id: Untuk wadah *containers* lain lihat kelas-kelas bawaan :class:`set`, :class:`list`,: class: `tuple`, dan :class:`dict`, serta modul :mod:`collections`.

source: Return the value of the named attribute of *object*. *name* must be a string. If the string is the name of one of the object's attributes, the result is the value of that attribute. For example, ``getattr(x, 'foobar')`` is equivalent to ``x.foobar``. If the named attribute does not exist, *default* is returned if provided, otherwise :exc:`AttributeError` is raised.
id: Kembalikan nilai atribut bernama dari *object*. *name* harus berupa string. Jika string adalah nama salah satu atribut objek, hasilnya adalah nilai atribut itu. Misalnya, ``getattr(x, 'foobar')`` setara dengan ``x.foobar``. Jika atribut yang disebutkan tidak ada, *default* dikembalikan jika disediakan, jika tidak :exc:`AttributeError` dimunculkan.

source: Return a dictionary representing the current global symbol table. This is always the dictionary of the current module (inside a function or method, this is the module where it is defined, not the module from which it is called).
id: Kembalikan dictionary yang mewakili tabel simbol global saat ini. Ini selalu merupakan dictionary dari modul saat ini (di dalam suatu fungsi atau metode, ini adalah modul di mana ia didefinisikan, bukan modul dari mana ia dipanggil).

source: The arguments are an object and a string. The result is ``True`` if the string is the name of one of the object's attributes, ``False`` if not. (This is implemented by calling ``getattr(object, name)`` and seeing whether it raises an :exc:`AttributeError` or not.)
id: Argumen adalah objek dan string. Hasilnya adalah ``True`` jika string adalah nama salah satu atribut objek, ``False`` jika tidak. (Ini diimplementasikan dengan memanggil ``getattr(object, name)`` dan melihat apakah itu memunculkan :exc:`AttributeError` atau tidak.)

source: Return the hash value of the object (if it has one). Hash values are integers. They are used to quickly compare dictionary keys during a dictionary lookup. Numeric values that compare equal have the same hash value (even if they are of different types, as is the case for 1 and 1.0).
id: Kembalikan nilai hash objek (jika ada). Nilai hash adalah bilangan bulat. Mereka digunakan untuk dengan cepat membandingkan kunci kamus *dictionary keys* selama pencarian dictionary. Nilai numerik yang membandingkan sama memiliki nilai hash yang sama (bahkan jika mereka dari jenis yang berbeda, seperti halnya untuk 1 dan 1.0).

source: For objects with custom :meth:`__hash__` methods, note that :func:`hash` truncates the return value based on the bit width of the host machine. See :meth:`__hash__` for details.
id: Untuk objek dengan metode ubahsuai *custom* :meth:`__hash__`, perhatikan bahwa :func:`hash` memotong atau mengosongkan kembali nilai berdasarkan lebar bit mesin *host*. Lihat :meth:`__hash__` untuk detailnya.

source: Invoke the built-in help system. (This function is intended for interactive use.) If no argument is given, the interactive help system starts on the interpreter console. If the argument is a string, then the string is looked up as the name of a module, function, class, method, keyword, or documentation topic, and a help page is printed on the console. If the argument is any other kind of object, a help page on the object is generated.
id: Meminta sistem bantuan bawaan. (Fungsi ini dimaksudkan untuk penggunaan interaktif.) Jika tidak ada argumen yang diberikan, sistem bantuan interaktif dimulai pada konsol interpreter. Jika argumennya adalah string, maka string tersebut dicari sebagai nama modul, fungsi, kelas, metode, kata kunci, atau topik dokumentasi, dan halaman bantuan dicetak pada konsol. Jika argumennya adalah objek jenis apa pun, halaman bantuan tentang objek tersebut dihasilkan.

source: Note that if a slash(/) appears in the parameter list of a function, when invoking :func:`help`, it means that the parameters prior to the slash are positional-only. For more info, see :ref:`the FAQ entry on positional-only parameters <faq-positional-only-arguments>`.
id: Perhatikan bahwa jika garis miring (/) muncul di daftar parameter suatu fungsi, ketika menjalankan :func:`help`, itu berarti bahwa parameter sebelum garis miring adalah hanya posisional. Untuk info lebih lanjut, lihat :ref:`the FAQ entry on positional-only parameters <faq-positional-only-arguments>`.

source: This function is added to the built-in namespace by the :mod:`site` module.
id: Fungsi ini ditambahkan ke *namespace* bawaan dengan modul :mod:`site`.

source: Changes to :mod:`pydoc` and :mod:`inspect` mean that the reported signatures for callables are now more comprehensive and consistent.
id: Perubahan ke :mod:`pydoc` dan :mod:`inspect` berarti bahwa tanda tangan *signatures* yang dilaporkan untuk *callables* sekarang lebih komprehensif dan konsisten.

source: Convert an integer number to a lowercase hexadecimal string prefixed with "0x". If *x* is not a Python :class:`int` object, it has to define an :meth:`__index__` method that returns an integer. Some examples:
id: Ubah angka integer menjadi string heksadesimal huruf kecil yang diawali dengan "0x". Jika *x* bukan objek Python :class:`int`, ia harus mendefinisikan metode :meth:`__index__` yang mengembalikan integer. Beberapa contoh:

source: If you want to convert an integer number to an uppercase or lower hexadecimal string with prefix or not, you can use either of the following ways:
id: Jika Anda ingin mengonversi bilangan bulat menjadi string heksadesimal huruf besar atau huruf kecil dengan awalan atau tidak, Anda dapat menggunakan salah satu dari cara berikut:

source: See also :func:`int` for converting a hexadecimal string to an integer using a base of 16.
id: Lihat juga :func:`int` untuk mengonversi string heksadesimal menjadi integer menggunakan basis 16.

source: To obtain a hexadecimal string representation for a float, use the :meth:`float.hex` method.
id: Untuk mendapatkan representasi string heksadesimal untuk float, gunakan metode :meth:`float.hex`.

source: Return the "identity" of an object. This is an integer which is guaranteed to be unique and constant for this object during its lifetime. Two objects with non-overlapping lifetimes may have the same :func:`id` value.
id: Kembalikan "identity" suatu objek. Ini adalah bilangan bulat yang dijamin unik dan konstan untuk objek ini selama masa pakainya. Dua objek dengan masa hidup yang tidak tumpang tindih mungkin memiliki nilai yang sama :func:`id`.

source: Raises an :ref:`auditing event <auditing>` ``builtins.id`` with argument ``id``.
id: Memunculkan sebuah :ref:`auditing event` ``builtins.id`` dengan argumen ``id``.

source: If the *prompt* argument is present, it is written to standard output without a trailing newline. The function then reads a line from input, converts it to a string (stripping a trailing newline), and returns that. When EOF is read, :exc:`EOFError` is raised. Example::
id: Jika argumen *prompt* ada, ini ditulis ke keluaran standar tanpa baris tambahan. Fungsi ini kemudian membaca sebuah baris dari masukan, mengubahnya menjadi sebuah string (menghapus baris baru yang tertinggal), dan mengembalikannya. Ketika EOF dibaca, :exc:`EOFError` dimunculkan. Contoh::

source: If the :mod:`readline` module was loaded, then :func:`input` will use it to provide elaborate line editing and history features.
id: Jika modul :mod:`readline` dimuat, maka :func:`input` akan menggunakannya untuk menyediakan fitur pengeditan baris dan riwayat.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input`` with argument ``prompt``.
id: Memunculkan :ref:`auditing event <auditing>` ``builtins.input`` dengan argumen ``prompt``.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input`` with argument ``prompt`` before reading input
id: Memunculkan :ref:`auditing event <auditing>` ``builtins.input`` dengan argumen ``prompt`` sebelum membaca masukan

source: Raises an :ref:`auditing event <auditing>` ``builtins.input/result`` with argument ``result``.
id: Memunculkan :ref:`auditing event <auditing>` ``builtins.input/result`` dengan argumen ``result``.

source: Raises an auditing event ``builtins.input/result`` with the result after successfully reading input.
id: Menimbulkan audit *event* ``builtins.input/result`` dengan hasil setelah berhasil membaca masukan.
