Repository: python/python-docs-id
Catalog: library/functions.po
Languages: id

source: Return a new :class:`set` object, optionally with elements taken from *iterable*. ``set`` is a built-in class. See :class:`set` and :ref:`types-set` for documentation about this class.
id: Kembalikan objek baru :class:`set`, secara opsional dengan elemen yang diambil dari *iterable*. ``set`` adalah kelas bawaan. Lihat: class:`set` dan :ref:`types-set` untuk dokumentasi tentang kelas ini.

source: For other containers see the built-in :class:`frozenset`, :class:`list`, :class:`tuple`, and :class:`dict` classes, as well as the :mod:`collections` module.
id: Untuk wadah *containers* lain lihat kelas-kelas bawaan :class:`frozenset`, :class:`list`, :class:`tuple`, dan :class:`dict`, juga modul :mod:`collections`.

source: This is the counterpart of :func:`getattr`. The arguments are an object, a string and an arbitrary value. The string may name an existing attribute or a new attribute. The function assigns the value to the attribute, provided the object allows it. For example, ``setattr(x, 'foobar', 123)`` is equivalent to ``x.foobar = 123``.
id: Ini adalah bagian dari :func:`getattr`. Argumen adalah objek, string dan nilai yang berubah-ubah *arbitrary*. String dapat memberi nama atribut yang ada atau atribut baru. Fungsi memberikan nilai ke atribut, asalkan objek memungkinkannya. Misalnya, ``setattr(x, 'foobar', 123)`` setara dengan ``x.foobar = 123``.

source: Return a :term:`slice` object representing the set of indices specified by ``range(start, stop, step)``. The *start* and *step* arguments default to ``None``. Slice objects have read-only data attributes :attr:`~slice.start`, :attr:`~slice.stop` and :attr:`~slice.step` which merely return the argument values (or their default). They have no other explicit functionality; however they are used by Numerical Python and other third party extensions. Slice objects are also generated when extended indexing syntax is used. For example: ``a[start:stop:step]`` or ``a[start:stop, i]``. See :func:`itertools.islice` for an alternate version that returns an iterator.
id: Kembali sebuah objek :term:`slice` yang mewakili sekumpulan indeks yang ditentukan oleh ``range(start, stop, step)``. The *start* dan *step* argumen bawaannya ``None``. Objek Slice memiliki atribut data hanya baca *read-only* :attr:`~slice.start`, :attr:`~slice.stop` dan :attr:`~slice.step` yang hanya mengembalikan nilai argumen (atau bawaannya). Mereka tidak memiliki fungsi eksplisit lainnya; namun mereka digunakan oleh Numerical Python dan ekstensi pihak ketiga lainnya. Objek slice juga dihasilkan ketika sintaks pengindeksan yang diperbesar digunakan. Misalnya: ``a[start:stop:step]`` atau ``a[start:stop, i]``. Lihat :func:`itertools.islice` untuk versi alternatif yang mengembalikan sebuah *iterator*.

source: Return a new sorted list from the items in *iterable*.
id: Kembalikan daftar baru yang diurutkan dari item di *iterable*.

source: Has two optional arguments which must be specified as keyword arguments.
id: Memiliki dua argumen opsional yang harus ditentukan sebagai argumen kata kunci.

source: *key* specifies a function of one argument that is used to extract a comparison key from each element in *iterable* (for example, ``key=str.lower``). The default value is ``None`` (compare the elements directly).
id: *key* menentukan sebuah fungsi dari satu argumen yang digunakan untuk mengekstrak kunci perbandingan dari setiap elemen di *iterable* (misalnya, ``key=str.lower``). Nilai bawaannya adalah ``None`` (bandingkan elemen secara langsung).

source: *reverse* is a boolean value. If set to ``True``, then the list elements are sorted as if each comparison were reversed.
id: *reverse* adalah nilai *boolean*. Jika diatur ke ``True``, maka elemen list atau daftar diurutkan seolah-olah setiap perbandingan dibalik.

source: Use :func:`functools.cmp_to_key` to convert an old-style *cmp* function to a *key* function.
id: Gunakan :func:`functools.cmp_to_key` untuk mengubah fungsi *cmp* gaya lama menjadi fungsi *key*.

source: The built-in :func:`sorted` function is guaranteed to be stable. A sort is stable if it guarantees not to change the relative order of elements that compare equal --- this is helpful for sorting in multiple passes (for example, sort by department, then by salary grade).
id: Fungsi bawaan :func:`sorted` dijamin stabil. Semacam stabil jika menjamin tidak mengubah urutan relatif elemen yang membandingkan kesamaan --- ini berguna untuk menyortir dalam beberapa langkah (misalnya, urutkan berdasarkan departemen, lalu dengan tingkat gaji).

source: For sorting examples and a brief sorting tutorial, see :ref:`sortinghowto`.
id: Untuk contoh pengurutan dan tutorial singkat pengurutan, lihat :ref: `sortinghowto`.

source: Transform a method into a static method.
id: Ubah sebuah metode menjadi sebuah metode statis.

source: A static method does not receive an implicit first argument. To declare a static method, use this idiom::
id: Metode statis tidak menerima argumen implisit pertama. Untuk mendeklarasikan metode statis, gunakan idiom ini::

source: The ``@staticmethod`` form is a function :term:`decorator` -- see :ref:`function` for details.
id: Bentuk ``@staticmethod`` adalah fungsi :term:`decorator` -- lihat :ref:`function` untuk detail.

source: A static method can be called either on the class (such as ``C.f()``) or on an instance (such as ``C().f()``).
id: Metode statis dapat dipanggil baik di kelas (seperti ``C.f()``) atau pada instance (seperti ``C().f()``).

source: Static methods in Python are similar to those found in Java or C++. Also see :func:`classmethod` for a variant that is useful for creating alternate class constructors.
id: Metode statis di Python mirip dengan yang ditemukan di Java atau C++. Juga lihat :func:`classmethod` untuk varian yang berguna untuk membuat konstruktor kelas alternatif.

source: Like all decorators, it is also possible to call ``staticmethod`` as a regular function and do something with its result. This is needed in some cases where you need a reference to a function from a class body and you want to avoid the automatic transformation to instance method. For these cases, use this idiom::
id: Seperti semua dekorator, dimungkinkan juga untuk memanggil ``staticmethod`` sebagai fungsi biasa dan melakukan sesuatu dengan hasilnya. Ini diperlukan dalam beberapa kasus di mana Anda memerlukan referensi ke fungsi dari badan kelas dan Anda ingin menghindari transformasi otomatis ke metode *instance*. Untuk kasus ini, gunakan idiom ini::

source: For more information on static methods, see :ref:`types`.
id: Untuk informasi lebih lanjut tentang metode statis, lihat :ref:`types`.

source: Return a :class:`str` version of *object*. See :func:`str` for details.
id: Kembalikan sebuah versi :class:`str` dari *objek*. Lihat :func:`str` untuk detailnya.

source: ``str`` is the built-in string :term:`class`. For general information about strings, see :ref:`textseq`.
id: ``str`` adalah string bawaan :term:`class`. Untuk informasi umum tentang string, lihat :ref:`textseq`.

source: Sums *start* and the items of an *iterable* from left to right and returns the total. The *iterable*'s items are normally numbers, and the start value is not allowed to be a string.
id: Jumlah *start* dan item dari *iterable* dari kiri ke kanan dan mengembalikan total. Item *iterable* biasanya berupa angka, dan nilai awal tidak boleh berupa string.

source: For some use cases, there are good alternatives to :func:`sum`. The preferred, fast way to concatenate a sequence of strings is by calling ``''.join(sequence)``. To add floating point values with extended precision, see :func:`math.fsum`\. To concatenate a series of iterables, consider using :func:`itertools.chain`.
id: Untuk beberapa kasus penggunaan, ada alternatif yang baik untuk :func:`sum`. Cara yang disukai dan cepat untuk menggabungkan rangkaian string adalah dengan memanggil ``''.join(sequence)``. Untuk menambahkan nilai pecahan *floating point* dengan presisi yang diperluas, lihat :func:`math.fsum`. Untuk menggabungkan serangkaian iterables, coba gunakan :func:`itertools.chain`.

source: The *start* parameter can be specified as a keyword argument.
id: Parameter *mulai* dapat ditentukan sebagai argumen kata kunci.

source: Return a proxy object that delegates method calls to a parent or sibling class of *type*. This is useful for accessing inherited methods that have been overridden in a class.
id: Kembalikan objek proxy yang mendelegasikan panggilan metode ke kelas orang tua atau saudara dari *type*. Ini berguna untuk mengakses metode yang diwariskan yang telah ditimpa di suatu kelas.

source: The *object-or-type* determines the :term:`method resolution order` to be searched. The search starts from the class right after the *type*.
id: *object-or-type* menentukan :term:`method resolution order` yang akan dicari. Pencarian dimulai dari kelas tepat setelah *type*.

source: For example, if :attr:`~class.__mro__` of *object-or-type* is ``D -> B -> C -> A -> object`` and the value of *type* is ``B``, then :func:`super` searches ``C -> A -> object``.
id: Sebagai contoh, jika :attr:`~class .__ mro__` dari *object-or-type* adalah ``D -> B -> C -> A -> object`` dan nilai *type* adalah ``B``, lalu :func:`super` mencari ``C -> A -> object``.

source: The :attr:`~class.__mro__` attribute of the *object-or-type* lists the method resolution search order used by both :func:`getattr` and :func:`super`. The attribute is dynamic and can change whenever the inheritance hierarchy is updated.
id: Atribut :attr:`~class.__ mro__` dari *object-or-type* mencantumkan urutan metode pencarian resolusi yang digunakan oleh kedua :func:`getattr` dan :func:`super`. Atributnya dinamis dan dapat berubah setiap kali hierarki warisan diperbarui.

source: If the second argument is omitted, the super object returned is unbound. If the second argument is an object, ``isinstance(obj, type)`` must be true. If the second argument is a type, ``issubclass(type2, type)`` must be true (this is useful for classmethods).
id: Jika argumen kedua dihilangkan, objek super yang dikembalikan tidak terikat *unbound*. Jika argumen kedua adalah objek, ``isinstance(obj, type)`` harus benar. Jika argumen kedua adalah tipe, ``issubclass(type2, type)`` harus benar (ini berguna untuk metode-metode kelas).

source: There are two typical use cases for *super*. In a class hierarchy with single inheritance, *super* can be used to refer to parent classes without naming them explicitly, thus making the code more maintainable. This use closely parallels the use of *super* in other programming languages.
id: Ada dua kasus penggunaan khas untuk *super*. Dalam hierarki kelas dengan pewarisan tunggal *single inheritance*, *super* dapat digunakan untuk merujuk ke kelas induk tanpa menyebutkannya secara eksplisit, sehingga membuat kode lebih mudah dikelola. Penggunaan ini sangat mirip dengan penggunaan *super* dalam bahasa pemrograman lain.

source: The second use case is to support cooperative multiple inheritance in a dynamic execution environment. This use case is unique to Python and is not found in statically compiled languages or languages that only support single inheritance. This makes it possible to implement "diamond diagrams" where multiple base classes implement the same method. Good design dictates that this method have the same calling signature in every case (because the order of calls is determined at runtime, because that order adapts to changes in the class hierarchy, and because that order can include sibling classes that are unknown prior to runtime).
id: Kasus penggunaan kedua adalah untuk mendukung *multiple inheritance* kooperatif dalam lingkungan eksekusi yang dinamis. Kasus penggunaan ini unik untuk Python dan tidak ditemukan dalam bahasa yang dikompilasi secara statis atau bahasa yang hanya mendukung pewarisan tunggal *single inheritance*. Ini memungkinkan untuk mengimplementasikan "diagram berlian" di mana beberapa kelas dasar menerapkan metode yang sama. Desain yang baik menentukan bahwa metode ini memiliki tanda tangan *signature* panggilan yang sama dalam setiap kasus (karena urutan panggilan ditentukan pada saat *runtime*, karena urutan itu menyesuaikan dengan perubahan dalam hierarki kelas, dan karena urutan itu dapat mencakup kelas saudara yang tidak diketahui sebelum *runtime*).

source: For both use cases, a typical superclass call looks like this::
id: Untuk kedua kasus penggunaan, pemanggilan *superclass* yang khas terlihat seperti ini::

source: In addition to method lookups, :func:`super` also works for attribute lookups. One possible use case for this is calling :term:`descriptors <descriptor>` in a parent or sibling class.
id: Selain pencarian metode, :func:`super` juga berfungsi untuk pencarian atribut. Salah satu kemungkinan kasus penggunaan ini adalah pemanggilan :term:`descriptors <descriptor>` di kelas induk atau saudara kandung.

source: Note that :func:`super` is implemented as part of the binding process for explicit dotted attribute lookups such as ``super().__getitem__(name)``. It does so by implementing its own :meth:`__getattribute__` method for searching classes in a predictable order that supports cooperative multiple inheritance. Accordingly, :func:`super` is undefined for implicit lookups using statements or operators such as ``super()[name]``.
id: Perhatikan bahwa :func:`super` diimplementasikan sebagai bagian dari proses pengikatan *binding* untuk pencarian atribut eksplisit bertitik *dotted* seperti ``super().__getitem__(name)``. Itu melakukannya dengan menerapkan sendiri metode :meth:`__getattribute__` untuk mencari kelas dalam urutan terprediksi yang mendukung *multiple inheritance* kooperatif. Dengan demikian, :func:`super` tidak ditentukan untuk pencarian implisit menggunakan pernyataan atau operator seperti ``super()[name]``.

source: Also note that, aside from the zero argument form, :func:`super` is not limited to use inside methods. The two argument form specifies the arguments exactly and makes the appropriate references. The zero argument form only works inside a class definition, as the compiler fills in the necessary details to correctly retrieve the class being defined, as well as accessing the current instance for ordinary methods.
id: Juga perhatikan bahwa, selain dari bentuk tanpa argumen, :func:`super` tidak terbatas untuk menggunakan metode di dalam. Bentuk dua argumen menentukan argumen dengan tepat dan membuat referensi yang sesuai. Bentuk tanpa argumen hanya bekerja di dalam definisi kelas, karena *compiler* mengisi rincian yang diperlukan untuk mengambil kelas yang didefinisikan dengan benar, serta mengakses *instance* saat ini untuk metode biasa.

source: For practical suggestions on how to design cooperative classes using :func:`super`, see `guide to using super() <https://rhettinger.wordpress.com/2011/05/26/super-considered-super/>`_.
id: Untuk saran praktis tentang bagaimana merancang kelas kooperatif menggunakan :func:`super`, lihat `guide to using super() <https://rhettinger.wordpress.com/2011/05/26/super-considered-super/>`_.

source: Rather than being a function, :class:`tuple` is actually an immutable sequence type, as documented in :ref:`typesseq-tuple` and :ref:`typesseq`.
id: Alih-alih menjadi fungsi, :class:`tuple` sebenarnya merupakan tipe urutan yang tidak dapat diubah atau disebut *immutable*, seperti yang didokumentasikan dalam :ref:`typesseq-tuple` dan :ref:`typesseq`.

source: With one argument, return the type of an *object*. The return value is a type object and generally the same object as returned by :attr:`object.__class__ <instance.__class__>`.
id: Dengan satu argumen, kembalikan tipe dari sebuah *object*. Nilai kembaliannya adalah sebuah tipe objek dan umumnya objek yang sama seperti yang dikembalikan oleh :attr:`object.__class__ <instance.__class__>`.

source: The :func:`isinstance` built-in function is recommended for testing the type of an object, because it takes subclasses into account.
id: Fungsi bawaan :func:`isinstance` direkomendasikan untuk menguji jenis objek, karena ia memperhitungkan subkelas.

source: With three arguments, return a new type object. This is essentially a dynamic form of the :keyword:`class` statement. The *name* string is the class name and becomes the :attr:`~definition.__name__` attribute; the *bases* tuple itemizes the base classes and becomes the :attr:`~class.__bases__` attribute; and the *dict* dictionary is the namespace containing definitions for class body and is copied to a standard dictionary to become the :attr:`~object.__dict__` attribute. For example, the following two statements create identical :class:`type` objects:
id: Dengan tiga argumen, kembalikan objek tipe baru. Ini pada dasarnya adalah bentuk dinamis dari pernyataan :keyword:`class`. String *name* adalah nama kelas dan menjadi atribut :attr:`~definition.__ name__`; tuple *bases* memerinci kelas-kelas dasar dan menjadi atribut :attr:`~class.__ bases__`; dan *dictionary* *dict* adalah *namespace* yang mengandung definisi untuk badan kelas dan disalin ke *dictionary* standar untuk menjadi atribut :attr:`~object.__ dict__`. Sebagai contoh, dua pernyataan berikut membuat objek :class:`type` indentik:

source: See also :ref:`bltin-type-objects`.
id: Lihat juga :ref:`bltin-type-objects`.

source: Subclasses of :class:`type` which don't override ``type.__new__`` may no longer use the one-argument form to get the type of an object.
id: Subkelas dari :class:`type` yang tidak menimpa ``type.__new__`` mungkin tidak lagi menggunakan bentuk satu argumen untuk mendapatkan tipe dari suatu objek.

source: Return the :attr:`~object.__dict__` attribute for a module, class, instance, or any other object with a :attr:`~object.__dict__` attribute.
id: Kembalikan atribut: attr:`~object.__ dict__` untuk modul, kelas, *instance*, atau objek lainnya yang memiliki atribut :attr:`~object.__ dict__`.

source: Objects such as modules and instances have an updateable :attr:`~object.__dict__` attribute; however, other objects may have write restrictions on their :attr:`~object.__dict__` attributes (for example, classes use a :class:`types.MappingProxyType` to prevent direct dictionary updates).
id: Objek seperti modul dan *instance* memiliki atribut yang dapat diperbarui :attr:`~object.__dict__`; namun, objek lain mungkin memiliki batasan penulisan pada atribut :attr:`~object.__dict__` (misalnya, kelas menggunakan sebuah :class:`types.MappingProxyType` untuk mencegah pembaruan kamus secara langsung).

source: Without an argument, :func:`vars` acts like :func:`locals`. Note, the locals dictionary is only useful for reads since updates to the locals dictionary are ignored.
id: Tanpa argumen, :func:`vars` bertindak seperti :func:`locals`. Catatan, *dictionary* lokal hanya berguna untuk dibaca karena pembaruan ke *dictionary* lokal diabaikan.

source: A :exc:`TypeError` exception is raised if an object is specified but it doesn't have a :attr:`~object.__dict__` attribute (for example, if its class defines the :attr:`~object.__slots__` attribute).
id: Sebuah pengecualian untuk :exc:`TypeError` akan muncul jika suatu objek yang ditentukan tetapi tidak memiliki sebuah atribut :attr:`~object.__dict__` (contohnya, jika suatu kelas didefinisikan sebagai atribut :attr:`~object.__slots__`).

source: Make an iterator that aggregates elements from each of the iterables.
id: Membuat *iterator* yang mengumpulkan elemen dari masing-masing *iterables*.

source: Returns an iterator of tuples, where the *i*-th tuple contains the *i*-th element from each of the argument sequences or iterables. The iterator stops when the shortest input iterable is exhausted. With a single iterable argument, it returns an iterator of 1-tuples. With no arguments, it returns an empty iterator. Equivalent to::
id: Kembalikan *iterator* dari *tuples*, di mana tuple ke-*i* berisi elemen ke-*i* dari masing-masing urutan argumen atau *iterables*. Iterator berhenti ketika masukan terpendek *iterable* habis. Dengan argumen *iterable* tunggal, ia mengembalikan iterator 1-tupel. Tanpa argumen, ia mengembalikan *iterator* kosong. Setara dengan::

source: The left-to-right evaluation order of the iterables is guaranteed. This makes possible an idiom for clustering a data series into n-length groups using ``zip(*[iter(s)]*n)``. This repeats the *same* iterator ``n`` times so that each output tuple has the result of ``n`` calls to the iterator. This has the effect of dividing the input into n-length chunks.
id: Urutan evaluasi *iterables* dari kiri ke kanan dijamin. Hal ini memungkinkan idiom untuk mengelompokkan seri data ke dalam grup panjang-n menggunakan ``zip(*[iter(s)]*n)``. Ini mengulangi iterator yang sama *same* ``n`` kali sehingga setiap tuple keluaran memiliki hasil panggilan ``n`` ke *iterator*. Ini memiliki efek membagi input menjadi potongan panjang-n.

source: :func:`zip` should only be used with unequal length inputs when you don't care about trailing, unmatched values from the longer iterables. If those values are important, use :func:`itertools.zip_longest` instead.
id: :func:`zip` hanya boleh digunakan dengan masukan yang panjangnya tidak sama ketika Anda tidak peduli tentang bagian akhirnya, nilai yang tidak cocok dari *iterables* yang lebih panjang. Jika nilai-nilai itu penting, gunakan :func:`itertools.zip_longest` sebagai gantinya.

source: :func:`zip` in conjunction with the ``*`` operator can be used to unzip a list::
id: :func:`zip` bersama dengan operator ``*`` dapat digunakan untuk *unzip* sebuah list atau daftar::

source: This is an advanced function that is not needed in everyday Python programming, unlike :func:`importlib.import_module`.
id: Ini adalah fungsi lanjutan yang tidak diperlukan dalam pemrograman Python sehari-hari, tidak seperti :func:`importlib.import_module`.

source: This function is invoked by the :keyword:`import` statement. It can be replaced (by importing the :mod:`builtins` module and assigning to ``builtins.__import__``) in order to change semantics of the :keyword:`!import` statement, but doing so is **strongly** discouraged as it is usually simpler to use import hooks (see :pep:`302`) to attain the same goals and does not cause issues with code which assumes the default import implementation is in use. Direct use of :func:`__import__` is also discouraged in favor of :func:`importlib.import_module`.
id: Fungsi ini dipanggil oleh pernyataan :keyword:`import`. Itu dapat diganti (dengan mengimpor modul :mod:`builtins` dan mengisi ke ``builtins.__import__``) untuk mengubah semantik pernyataan :keyword:`!import`, tetapi melakukannya **strongly** atau tidak disarankan karena biasanya lebih mudah menggunakan kait impor (lihat: pep:`302`) untuk mencapai tujuan yang sama dan tidak menyebabkan masalah dengan kode yang mengasumsikan implementasi impor standar sedang digunakan. Penggunaan langsung :func:`__import__` juga tidak disarankan untuk kepentingan :func:`importlib.import_module`.

source: The function imports the module *name*, potentially using the given *globals* and *locals* to determine how to interpret the name in a package context. The *fromlist* gives the names of objects or submodules that should be imported from the module given by *name*. The standard implementation does not use its *locals* argument at all, and uses its *globals* only to determine the package context of the :keyword:`import` statement.
id: Fungsi ini mengimpor modul *name*, berpotensi menggunakan *globals* dan *locals* yang diberikan untuk menentukan cara menafsirkan nama dalam konteks paket. *fromlist* memberikan nama-nama objek atau submodul yang harus diimpor dari modul yang diberikan oleh *name*. Implementasi standar sama sekali tidak menggunakan argumen *locals*, dan hanya menggunakan *globals* untuk menentukan konteks paket dari pernyataan :keyword:`import`.
