Repository: python/python-docs-id
Catalog: library/functions.po
Languages: id

source: *errors* is an optional string that specifies how encoding and decoding errors are to be handled—this cannot be used in binary mode. A variety of standard error handlers are available (listed under :ref:`error-handlers`), though any error handling name that has been registered with :func:`codecs.register_error` is also valid. The standard names include:
id: *errors* adalah string opsional yang menentukan bagaimana kesalahan *encoding* dan *decoding* ditangani — ini tidak dapat digunakan dalam mode biner. Berbagai penangan kesalahan standar tersedia (terdaftar di bawah :ref:`error-handlers`), meskipun nama penanganan kesalahan yang telah terdaftar dengan :func:`codecs.register_error` juga valid. Nama standar meliputi:

source: ``'strict'`` to raise a :exc:`ValueError` exception if there is an encoding error. The default value of ``None`` has the same effect.
id: ``'strict'`` untuk memunculkan pengecualian :exc:`ValueError` jika ada kesalahan penyandian *encoding*. Nilai bawaan dari ``None`` memiliki efek yang sama.

source: ``'ignore'`` ignores errors. Note that ignoring encoding errors can lead to data loss.
id: ``'ignore'`` mengabaikan kesalahan. Perhatikan bahwa mengabaikan kesalahan penyandian *encoding* dapat menyebabkan hilangnya data.

source: ``'replace'`` causes a replacement marker (such as ``'?'``) to be inserted where there is malformed data.
id: ``'replace'`` menyebabkan penanda pengganti (seperti ``'?'``) disisipkan di mana ada data yang tidak sesuai format.

source: ``'surrogateescape'`` will represent any incorrect bytes as code points in the Unicode Private Use Area ranging from U+DC80 to U+DCFF. These private code points will then be turned back into the same bytes when the ``surrogateescape`` error handler is used when writing data. This is useful for processing files in an unknown encoding.
id: ``'surrogateescape'`` akan mewakili byte yang salah sebagai titik kode di Area Penggunaan Pribadi Unicode mulai dari U+DC80 hingga U+DCFF. Poin kode pribadi ini kemudian akan kembali menjadi byte yang sama ketika penangan kesalahan ``surrogateescape`` digunakan saat menulis data. Ini berguna untuk memproses berkas dalam penyandian *encoding* yang tidak dikenal.

source: ``'xmlcharrefreplace'`` is only supported when writing to a file. Characters not supported by the encoding are replaced with the appropriate XML character reference ``&#nnn;``.
id: ``'xmlcharrefreplace'`` hanya didukung saat menulis ke berkas. Karakter yang tidak didukung oleh penyandian *encoding* diganti dengan referensi karakter XML yang sesuai ``&#nnn;``.

source: ``'backslashreplace'`` replaces malformed data by Python's backslashed escape sequences.
id: ``'backslashreplace'`` menggantikan data yang salah dengan urutan pemisahan dengan *backslash* dari Python.

source: ``'namereplace'`` (also only supported when writing) replaces unsupported characters with ``\N{...}`` escape sequences.
id: ``'namereplace'`` (juga hanya didukung saat menulis) menggantikan karakter yang tidak didukung dengan ``\N{...}`` urutan pemisahan.

source: *newline* controls how :term:`universal newlines` mode works (it only applies to text mode). It can be ``None``, ``''``, ``'\n'``, ``'\r'``, and ``'\r\n'``. It works as follows:
id: *newline* mengontrol bagaimana mode :term:`universal newlines` bekerja (ini hanya berlaku untuk mode teks). Itu bisa ``None``, ``''``, ``'\n'``, ``'\r'``, dan ``'\r\n'``. Ia bekerja sebagai berikut:

source: When reading input from the stream, if *newline* is ``None``, universal newlines mode is enabled. Lines in the input can end in ``'\n'``, ``'\r'``, or ``'\r\n'``, and these are translated into ``'\n'`` before being returned to the caller. If it is ``''``, universal newlines mode is enabled, but line endings are returned to the caller untranslated. If it has any of the other legal values, input lines are only terminated by the given string, and the line ending is returned to the caller untranslated.
id: Saat membaca masukan dari aliran *stream*, jika *newline* adalah ``None``, mode universal baris baru diaktifkan. Baris dalam masukan dapat diakhiri dengan ``'\n'``, ``'\r'``, atau ``'\r\n'``, dan ini diterjemahkan ke dalam ``'\n'`` sebelum dikembalikan ke pemanggil. Jika ``''``, mode baris baru universal diaktifkan, tetapi akhir baris dikembalikan ke pemanggil yang tidak diterjemahkan. Jika memiliki salah satu nilai legal lainnya, jalur masukan hanya diakhiri oleh string yang diberikan, dan akhir baris dikembalikan ke pemanggil yang tidak diterjemahkan.

source: When writing output to the stream, if *newline* is ``None``, any ``'\n'`` characters written are translated to the system default line separator, :data:`os.linesep`. If *newline* is ``''`` or ``'\n'``, no translation takes place. If *newline* is any of the other legal values, any ``'\n'`` characters written are translated to the given string.
id: Saat menulis keluaran ke aliran *stream*, jika *newline* adalah ``None``, setiap karakter ``'\n'`` yang ditulis diterjemahkan ke pemisah garis bawaan sistem, :data:`os.linesep`. Jika *newline* adalah ``''`` atau ``'\n'``, tidak ada terjemahan yang terjadi. Jika *newline* adalah salah satu dari nilai legal lainnya, setiap karakter ``'\n'`` yang ditulis diterjemahkan ke string yang diberikan.

source: If *closefd* is ``False`` and a file descriptor rather than a filename was given, the underlying file descriptor will be kept open when the file is closed. If a filename is given *closefd* must be ``True`` (the default) otherwise an error will be raised.
id: Jika *closefd* bernilai ``False`` dan diberikan deskriptor berkas daripada nama berkas, deskriptor berkas yang mendasarinya akan tetap terbuka ketika berkas ditutup. Jika nama berkas diberikan *closefd* harus bernilai ``True`` (bawaan) jika tidak kesalahan akan dimunculkan.

source: A custom opener can be used by passing a callable as *opener*. The underlying file descriptor for the file object is then obtained by calling *opener* with (*file*, *flags*). *opener* must return an open file descriptor (passing :mod:`os.open` as *opener* results in functionality similar to passing ``None``).
id: Pembuka khusus dapat digunakan dengan melewatkan *callable* sebagai *opener*. Deskriptor berkas yang mendasari untuk objek berkas kemudian diperoleh dengan memanggil *opener* dengan (*file*, *flags*). *opener* harus mengembalikan deskriptor berkas terbuka (lewat :mod:`os.open` sebagai *opener* menghasilkan fungsionalitas yang mirip dengan melewatkan ``None``).

source: The newly created file is :ref:`non-inheritable <fd_inheritance>`.
id: Berkas yang baru dibuat adalah :ref:`non-inheritable <fd_inheritance>`.

source: The following example uses the :ref:`dir_fd <dir_fd>` parameter of the :func:`os.open` function to open a file relative to a given directory::
id: Contoh berikut menggunakan parameter :ref:`dir_fd <dir_fd>` dari fungsi :func:`os.open` untuk membuka berkas relatif ke direktori yang diberikan::

source: The type of :term:`file object` returned by the :func:`open` function depends on the mode. When :func:`open` is used to open a file in a text mode (``'w'``, ``'r'``, ``'wt'``, ``'rt'``, etc.), it returns a subclass of :class:`io.TextIOBase` (specifically :class:`io.TextIOWrapper`). When used to open a file in a binary mode with buffering, the returned class is a subclass of :class:`io.BufferedIOBase`. The exact class varies: in read binary mode, it returns an :class:`io.BufferedReader`; in write binary and append binary modes, it returns an :class:`io.BufferedWriter`, and in read/write mode, it returns an :class:`io.BufferedRandom`. When buffering is disabled, the raw stream, a subclass of :class:`io.RawIOBase`, :class:`io.FileIO`, is returned.
id: Tipe :term:`file object` yang dikembalikan oleh fungsi :func:`open` tergantung pada mode. Ketika :func:`open` digunakan untuk membuka berkas dalam mode teks (``'w'``, ``'r'``, ``'wt'``, ``'rt'``, dll.), ia mengembalikan subkelas dari :class:`io.TextIOBase` (khusus :class:`io.TextIOWrapper`). Ketika digunakan untuk membuka file dalam mode biner dengan *buffering*, kelas yang dikembalikan adalah subkelas dari :class:`io.BufferedIOBase`. Kelas yang tepat bervariasi: dalam mode baca biner, ia mengembalikan :class:`io.BufferedReader`; dalam mode tulis biner dan *append* biner, ia mengembalikan sebuah :class:`io.BufferedWriter`, dan dalam mode baca/tulis, ia mengembalikan sebuah :class:`io.BufferedRandom`. Ketika *buffering* dinonaktifkan, aliran tak diproses *raw stream*, subkelas dari :class:`io.RawIOBase`, :class:`io.FileIO`, dikembalikan.

source: See also the file handling modules, such as, :mod:`fileinput`, :mod:`io` (where :func:`open` is declared), :mod:`os`, :mod:`os.path`, :mod:`tempfile`, and :mod:`shutil`.
id: Lihat juga modul penanganan berkas, seperti, :mod:`fileinput`, :mod:`io` (di mana :func:`open` dideklarasikan), :mod:`os`, :mod:`os.path`, :mod:`tempfile`, dan :mod:`shutil`.

source: Raises an :ref:`auditing event <auditing>` ``open`` with arguments ``file``, ``mode``, ``flags``.
id: Memunculkan :ref:`auditing event <auditing>` ``open`` dengan argumen ``file``, ``mode``, ``flags``.

source: The ``mode`` and ``flags`` arguments may have been modified or inferred from the original call.
id: Argumen ``mode`` dan ``flags`` mungkin telah dimodifikasi atau disimpulkan dari pemanggilan asli.

source: The *opener* parameter was added.
id: Parameter *opener* telah ditambahkan.

source: The ``'x'`` mode was added.
id: Mode ``'x'`` telah ditambahkan.

source: :exc:`IOError` used to be raised, it is now an alias of :exc:`OSError`.
id: :exc:`IOError` sebelumnya ditimbulkan, sekarang merupakan alias dari :exc:`OSError`.

source: :exc:`FileExistsError` is now raised if the file opened in exclusive creation mode (``'x'``) already exists.
id: :exc:`FileExistsError` sekarang ditimbulkan jika berkas yang dibuka dalam mode pembuatan eksklusif (``'x'``) sudah ada.

source: The file is now non-inheritable.
id: Berkas sekarang tidak dapat diwariskan.

source: The ``'U'`` mode.
id: Mode ``'U'``.

source: If the system call is interrupted and the signal handler does not raise an exception, the function now retries the system call instead of raising an :exc:`InterruptedError` exception (see :pep:`475` for the rationale).
id: Jika panggilan sistem terganggu dan penangan sinyal tidak menimbulkan pengecualian, fungsi sekarang mencoba ulang panggilan sistem alih-alih menimbulkan pengecualian :exc:`InterruptedError` (lihat :pep:`475` untuk penjelasannya).

source: The ``'namereplace'`` error handler was added.
id: Penangan kesalahan ``'namereplace'`` telah ditambahkan.

source: Support added to accept objects implementing :class:`os.PathLike`.
id: Dukungan ditambahkan untuk menerima objek yang mengimplementasikan :class:`os.PathLike`.

source: On Windows, opening a console buffer may return a subclass of :class:`io.RawIOBase` other than :class:`io.FileIO`.
id: Di Windows, membuka penyangga *buffer* konsol dapat mengembalikan subclass dari :class:`io.RawIOBase` selain :class:`io.FileIO`.

source: Given a string representing one Unicode character, return an integer representing the Unicode code point of that character. For example, ``ord('a')`` returns the integer ``97`` and ``ord('€')`` (Euro sign) returns ``8364``. This is the inverse of :func:`chr`.
id: Diberikan string yang mewakili satu karakter Unicode, kembalikan integer yang mewakili titik kode Unicode dari karakter itu. Misalnya, ``ord('a')`` mengembalikan integer ``97`` dan ``ord('€')`` (tanda Euro) mengembalikan ``8364``. Ini adalah kebalikan dari :func:`chr`.

source: Return *base* to the power *exp*; if *mod* is present, return *base* to the power *exp*, modulo *mod* (computed more efficiently than ``pow(base, exp) % mod``). The two-argument form ``pow(base, exp)`` is equivalent to using the power operator: ``base**exp``.
id: Kembalikan *base* ke *power* *exp*; jika *mod* ada, kembalikan *base* ke *power* *exp*, *modulo* *mod* (dihitung lebih efisien daripada ``pow(base, exp) % mod``). Bentuk dua argumen ``pow(base, exp)`` setara dengan menggunakan operator *power*: ``base**exp``.

source: The arguments must have numeric types. With mixed operand types, the coercion rules for binary arithmetic operators apply. For :class:`int` operands, the result has the same type as the operands (after coercion) unless the second argument is negative; in that case, all arguments are converted to float and a float result is delivered. For example, ``10**2`` returns ``100``, but ``10**-2`` returns ``0.01``.
id: Argumen harus memiliki tipe numerik. Dengan tipe operan campuran, aturan paksaan untuk operator aritmatika biner berlaku. Untuk operan :class:`int`, hasilnya memiliki tipe yang sama dengan operan (setelah paksaan) kecuali argumen kedua negatif; dalam hal itu, semua argumen dikonversi menjadi pecahan *float* dan hasil pecahan *float* dikirimkan. Misalnya, ``10**2`` mengembalikan ``100``, tetapi ``10**-2`` mengembalikan ``0.01``.

source: For :class:`int` operands *base* and *exp*, if *mod* is present, *mod* must also be of integer type and *mod* must be nonzero. If *mod* is present and *exp* is negative, *base* must be relatively prime to *mod*. In that case, ``pow(inv_base, -exp, mod)`` is returned, where *inv_base* is an inverse to *base* modulo *mod*.
id: Untuk operan :class:`int` *base* dan *exp*, jika *mod* ada, *mod* juga harus bertipe integer dan *mod* harus bukan nol. Jika *mod* ada dan *exp* negatif, *basis* harus relatif prima ke *mod*. Dalam kasus itu, ``pow(inv_base, -exp, mod)`` dikembalikan, di mana *inv_base* adalah kebalikan dari *base* *modulo* *mod*.

source: Here's an example of computing an inverse for ``38`` modulo ``97``::
id: Berikut adalah contoh penghitungan kebalikan untuk ``38`` modulo ``97``::

source: For :class:`int` operands, the three-argument form of ``pow`` now allows the second argument to be negative, permitting computation of modular inverses.
id: Untuk operan :class:`int`, bentuk tiga argumen dari ``pow`` sekarang memungkinkan argumen kedua menjadi negatif, memungkinkan perhitungan *inverse* modular.

source: Allow keyword arguments. Formerly, only positional arguments were supported.
id: Izinkan argumen kata kunci *keyword arguments*. Sebelumnya, hanya argumen posisi yang didukung.

source: Print *objects* to the text stream *file*, separated by *sep* and followed by *end*. *sep*, *end*, *file* and *flush*, if present, must be given as keyword arguments.
id: Cetak *objects* ke aliran teks *file*, dipisahkan oleh *sep* dan diikuti oleh *end*. *sep*, *end*, *file* dan *flush*, jika ada, harus diberikan sebagai argumen kata kunci *keyword arguments*.

source: All non-keyword arguments are converted to strings like :func:`str` does and written to the stream, separated by *sep* and followed by *end*. Both *sep* and *end* must be strings; they can also be ``None``, which means to use the default values. If no *objects* are given, :func:`print` will just write *end*.
id: Semua argumen non-kata kunci dikonversi ke string seperti :func:`str` dan ditulis ke aliran *stream*, dipisahkan oleh *sep* dan diikuti oleh *end*. Baik *sep* dan *end* harus berupa string; mereka juga bisa ``None``, yang berarti menggunakan nilai bawaan. Jika tidak ada *objects* yang diberikan, :func:`print` hanya akan menulis *end*.

source: The *file* argument must be an object with a ``write(string)`` method; if it is not present or ``None``, :data:`sys.stdout` will be used. Since printed arguments are converted to text strings, :func:`print` cannot be used with binary mode file objects. For these, use ``file.write(...)`` instead.
id: Argumen *file* harus berupa objek dengan metode ``write(string)``; jika tidak ada atau ``None``, :data:`sys.stdout` akan digunakan. Karena argumen yang dicetak dikonversi ke string teks, :func:`print` tidak dapat digunakan dengan objek file mode biner. Untuk ini, gunakan ``file.write(...)`` sebagai gantinya.

source: Whether output is buffered is usually determined by *file*, but if the *flush* keyword argument is true, the stream is forcibly flushed.
id: Meski penyangga *buffer* keluaran biasanya ditentukan oleh *file*, tetapi jika argumen kata kunci *flush* bernilai benar, aliran *stream* dihapus *flushed* secara paksa.

source: Added the *flush* keyword argument.
id: Menambahkan argumen kata kunci *flush*.

source: Return a property attribute.
id: Kembalikan atribut properti.

source: *fget* is a function for getting an attribute value. *fset* is a function for setting an attribute value. *fdel* is a function for deleting an attribute value. And *doc* creates a docstring for the attribute.
id: *fget* adalah fungsi untuk mendapatkan nilai atribut. *fset* adalah fungsi untuk mengatur nilai atribut. *fdel* adalah fungsi untuk menghapus nilai atribut. Dan *doc* membuat docstring untuk atribut.

source: A typical use is to define a managed attribute ``x``::
id: Penggunaan khasnya untuk mendefinisikan atribut yang dikelola ``x``::

source: If *c* is an instance of *C*, ``c.x`` will invoke the getter, ``c.x = value`` will invoke the setter and ``del c.x`` the deleter.
id: Jika *c* adalah *instance* dari *C*, ``c.x`` akan memanggil *getter*, ``c.x = value`` akan memanggil *setter* dan ``del c.x`` memanggil deleter.

source: If given, *doc* will be the docstring of the property attribute. Otherwise, the property will copy *fget*'s docstring (if it exists). This makes it possible to create read-only properties easily using :func:`property` as a :term:`decorator`::
id: Jika diberikan, *doc* akan menjadi *docstring* dari atribut properti. Jika tidak, properti akan menyalin *docstring* dari *fget* (jika ada). Ini memungkinkan untuk membuat properti baca-saja *read-only* dengan mudah menggunakan :func:`property` sebagai :term:`decorator`::

source: The ``@property`` decorator turns the :meth:`voltage` method into a "getter" for a read-only attribute with the same name, and it sets the docstring for *voltage* to "Get the current voltage."
id: *Decorator* ``@property`` mengubah metode :meth:`voltage` menjadi "getter" untuk atribut baca-saja *read-only* dengan nama yang sama, dan mengatur *docstring* untuk *voltage* menjadi "Get the current voltage."

source: A property object has :attr:`~property.getter`, :attr:`~property.setter`, and :attr:`~property.deleter` methods usable as decorators that create a copy of the property with the corresponding accessor function set to the decorated function. This is best explained with an example::
id: Properti dari objek memiliki: attr:`~property.getter`, :attr:`~property.setter`, dan :attr:`~property.deleter` metode yang dapat digunakan sebagai dekorator yang membuat salinan properti dengan fungsi *accessor* yang sesuai. diatur ke fungsi yang didekorasi. Ini paling baik dijelaskan dengan contoh::

source: This code is exactly equivalent to the first example. Be sure to give the additional functions the same name as the original property (``x`` in this case.)
id: Kode ini persis sama dengan contoh pertama. Pastikan untuk memberi fungsi tambahan nama yang sama dengan properti asli (``x`` dalam kasus ini.)

source: The returned property object also has the attributes ``fget``, ``fset``, and ``fdel`` corresponding to the constructor arguments.
id: Properti dari objek yang dikembalikan juga memiliki atribut ``fget``, ``fset``, dan ``fdel`` yang sesuai dengan argumen pembangun *constructor*.

source: The docstrings of property objects are now writeable.
id: docstrings dari properti objek-objek sekarang dapat ditulisi.

source: Rather than being a function, :class:`range` is actually an immutable sequence type, as documented in :ref:`typesseq-range` and :ref:`typesseq`.
id: Alih-alih menjadi fungsi, :class:`range` sebenarnya merupakan tipe urutan yang tidak dapat diubah *immutable*, seperti yang didokumentasikan dalam :ref:`typesseq-range` dan :ref:`typesseq`.

source: Return a string containing a printable representation of an object. For many types, this function makes an attempt to return a string that would yield an object with the same value when passed to :func:`eval`, otherwise the representation is a string enclosed in angle brackets that contains the name of the type of the object together with additional information often including the name and address of the object. A class can control what this function returns for its instances by defining a :meth:`__repr__` method.
id: Mengembalikan string yang berisi representasi objek yang dapat dicetak. Untuk banyak tipe, fungsi ini berusaha untuk mengembalikan string yang akan menghasilkan objek dengan nilai yang sama ketika diteruskan ke :func:`eval`, jika tidak, representasi adalah string yang tertutup kurung sudut yang berisi nama jenis objek bersama dengan informasi tambahan seringkali termasuk nama dan alamat objek. Kelas dapat mengontrol apa fungsi ini yang dikembalikan untuk *instance*-nya dengan mendefinisikan metode :meth:`__repr__`.

source: Return a reverse :term:`iterator`. *seq* must be an object which has a :meth:`__reversed__` method or supports the sequence protocol (the :meth:`__len__` method and the :meth:`__getitem__` method with integer arguments starting at ``0``).
id: Kembalikan kebalikan dari :term:`iterator`. *seq* harus berupa objek yang memiliki :meth:`__reversed__` metode atau dukungan protokol urutan (metode :meth:`__len__` dan metode :meth:`__getitem__` dengan argumen integer mulai dari ``0`` ).

source: Return *number* rounded to *ndigits* precision after the decimal point. If *ndigits* is omitted or is ``None``, it returns the nearest integer to its input.
id: Kembalikan *number* dibulatkan ke *ndigits* presisi setelah titik desimal. Jika *ndigits* dihilangkan atau ``None``, ini akan mengembalikan integer terdekat ke masukannya.

source: For the built-in types supporting :func:`round`, values are rounded to the closest multiple of 10 to the power minus *ndigits*; if two multiples are equally close, rounding is done toward the even choice (so, for example, both ``round(0.5)`` and ``round(-0.5)`` are ``0``, and ``round(1.5)`` is ``2``). Any integer value is valid for *ndigits* (positive, zero, or negative). The return value is an integer if *ndigits* is omitted or ``None``. Otherwise the return value has the same type as *number*.
id: Untuk tipe bawaan yang mendukung :func:`round`, nilai dibulatkan ke kelipatan terdekat dari 10 dengan pangkat minus *ndigits*; jika dua kelipatan sama-sama dekat, pembulatan dilakukan menuju pilihan genap (jadi, misalnya, ``round(0.5)`` dan ``round(-0.5)`` adalah ``0``, dan ``round(1.5)`` adalah ``2``). Nilai integer apa pun berlaku untuk *ndigits* (positif, nol, atau negatif). Nilai kembaliannya adalah bilangan bulat jika *ndigits* dihilangkan atau ``None``. Kalau tidak, nilai kembaliannya memiliki jenis yang sama dengan *number*.

source: For a general Python object ``number``, ``round`` delegates to ``number.__round__``.
id: Untuk sebuah objek Python ``number`` secara umum, ``round`` mendelegasikan ke ``number.__round__``.

source: The behavior of :func:`round` for floats can be surprising: for example, ``round(2.675, 2)`` gives ``2.67`` instead of the expected ``2.68``. This is not a bug: it's a result of the fact that most decimal fractions can't be represented exactly as a float. See :ref:`tut-fp-issues` for more information.
id: Perilaku :func:`round` untuk pecahan *floats* bisa mengejutkan: misalnya, ``round(2.675, 2)`` memberikan ``2.67`` alih-alih yang diharapkan ``2.68``. Ini bukan bug: ini adalah hasil dari fakta bahwa sebagian besar pecahan desimal tidak dapat diwakili persis seperti pelampung *float*. Lihat :ref:`tut-fp-issues` untuk informasi lebih lanjut.
