Repository: python/python-docs-id
Catalog: library/functions.po
Languages: id

source: Built-in Functions
id: Fungsi Bawaan

source: The Python interpreter has a number of functions and types built into it that are always available. They are listed here in alphabetical order.
id: Interpreter Python memiliki sejumlah fungsi dan tipe bawaan di dalamnya yang selalu tersedia. Mereka terdaftar di sini dalam urutan abjad.

source: Return ``True`` if all elements of the *iterable* are true (or if the iterable is empty). Equivalent to::
id: Kembalikan ``True`` jika semua elemen dari *iterable* bernilai benar (atau jika *iterable* kosong). Setara dengan::

source: Return ``True`` if any element of the *iterable* is true. If the iterable is empty, return ``False``. Equivalent to::
id: Kembalikan ``True`` jika ada elemen dari *iterable* bernilai benar. Jika *iterable* kosong, kembalikan ``False``. Setara dengan::

source: As :func:`repr`, return a string containing a printable representation of an object, but escape the non-ASCII characters in the string returned by :func:`repr` using ``\x``, ``\u`` or ``\U`` escapes. This generates a string similar to that returned by :func:`repr` in Python 2.
id: Sebagai :func:`repr`, kembalikan string yang berisi representasi objek yang dapat dicetak, tetapi memisahkan karakter non-ASCII dalam string yang dikembalikan oleh :func:`repr` menggunakan pemisah ``\x``, ``\u`` atau ``\U``. Ini menghasilkan string yang mirip dengan yang dikembalikan oleh :func:`repr` di Python 2.

source: Convert an integer number to a binary string prefixed with "0b". The result is a valid Python expression. If *x* is not a Python :class:`int` object, it has to define an :meth:`__index__` method that returns an integer. Some examples:
id: Ubah angka bulat atau integer menjadi string biner yang diawali dengan "0b". Hasilnya adalah ekspresi Python yang valid. Jika *x* bukan objek Python :class: `int`, ia harus mendefinisikan metode :meth:`__index__` yang mengembalikan integer. Beberapa contoh:

source: If prefix "0b" is desired or not, you can use either of the following ways.
id: Jika awalan "0b" diinginkan atau tidak, Anda dapat menggunakan salah satu dari cara berikut.

source: See also :func:`format` for more information.
id: Lihat juga :func:`format` untuk informasi lebih lanjut.

source: Return a Boolean value, i.e. one of ``True`` or ``False``. *x* is converted using the standard :ref:`truth testing procedure <truth>`. If *x* is false or omitted, this returns ``False``; otherwise it returns ``True``. The :class:`bool` class is a subclass of :class:`int` (see :ref:`typesnumeric`). It cannot be subclassed further. Its only instances are ``False`` and ``True`` (see :ref:`bltin-boolean-values`).
id: Kembalikan nilai Boolean, mis. salah satu dari ``True`` atau ``False``. *x* dikonversi menggunakan standar :ref:`truth testing procedure <truth>`. Jika *x* salah atau dihilangkan, ini mengembalikan ``False``; sebaliknya mengembalikan ``True``. Kelas :class:`bool` adalah subkelas dari :class:`int` (lihat :ref:`typesnumeric`). Tidak dapat di-subkelas-kan lebih lanjut. Satu-satunya *instance* adalah ``False`` dan ``True`` (lihat :ref:`bltin-boolean-values`).

source: *x* is now a positional-only parameter.
id: *x* sekarang menjadi parameter sesuai-posisi.

source: This function drops you into the debugger at the call site. Specifically, it calls :func:`sys.breakpointhook`, passing ``args`` and ``kws`` straight through. By default, ``sys.breakpointhook()`` calls :func:`pdb.set_trace()` expecting no arguments. In this case, it is purely a convenience function so you don't have to explicitly import :mod:`pdb` or type as much code to enter the debugger. However, :func:`sys.breakpointhook` can be set to some other function and :func:`breakpoint` will automatically call that, allowing you to drop into the debugger of choice.
id: Fungsi ini mengarahkan Anda ke *debugger* di situs pemanggil. Secara khusus, ia memanggil :func:`sys.breakpointhook`, melewati ``args`` dan ``kws`` langsung. Secara default, ``sys.breakpointhook()`` memanggil :func:`pdb.set_trace()` tanpa mengharapkan argumen. Dalam hal ini, ini murni fungsi kenyamanan sehingga Anda tidak perlu mengimpor secara eksplisit :mod:`pdb` atau mengetikkan sebanyak mungkin kode untuk masuk ke debugger. Namun, :func:`sys.breakpointhook` dapat diatur ke beberapa fungsi lain dan :func:`breakpoint` secara otomatis akan memanggil itu, memungkinkan Anda untuk masuk ke debugger pilihan.

source: Raises an :ref:`auditing event <auditing>` ``builtins.breakpoint`` with argument ``breakpointhook``.
id: Memunculkan :ref:`auditing event <auditing>` ``builtins.breakpoint`` dengan argumen ``breakpointhook``.

source: Return a new array of bytes. The :class:`bytearray` class is a mutable sequence of integers in the range 0 <= x < 256. It has most of the usual methods of mutable sequences, described in :ref:`typesseq-mutable`, as well as most methods that the :class:`bytes` type has, see :ref:`bytes-methods`.
id: Kembalikan array byte baru. Kelas :class:`bytearray` adalah urutan bilangan bulat yang dapat berubah dalam kisaran 0 <= x <256. Ia memiliki sebagian besar metode urutan-urutan yang dapat berubah, yang dijelaskan dalam :ref:`typesseq-mutable`, dan juga sebagian besar metode yang dimiliki oleh :class:`bytes`, lihat :ref:`bytes-methods`.

source: The optional *source* parameter can be used to initialize the array in a few different ways:
id: Parameter opsional *source* dapat digunakan untuk menginisialisasi array dengan beberapa cara berbeda:

source: If it is a *string*, you must also give the *encoding* (and optionally, *errors*) parameters; :func:`bytearray` then converts the string to bytes using :meth:`str.encode`.
id: Jika ini adalah *string*, Anda juga harus memberikan parameter *encoding* (dan opsional, *errors*); :func:`bytearray` kemudian mengonversi string menjadi byte menggunakan :meth:`str.encode`.

source: If it is an *integer*, the array will have that size and will be initialized with null bytes.
id: Jika ini adalah *integer*, array akan memiliki ukuran itu dan akan diinisialisasi dengan *null bytes*.

source: If it is an object conforming to the :ref:`buffer interface <bufferobjects>`, a read-only buffer of the object will be used to initialize the bytes array.
id: Jika itu adalah objek yang sesuai dengan :ref:`buffer interface`, buffer yang hanya baca dari objek tersebut akan digunakan untuk menginisialisasi array byte.

source: If it is an *iterable*, it must be an iterable of integers in the range ``0 <= x < 256``, which are used as the initial contents of the array.
id: Jika ini adalah *iterable*, itu harus iterable dari bilangan bulat dalam kisaran ``0 <= x < 256``, yang digunakan sebagai konten awal array.

source: Without an argument, an array of size 0 is created.
id: Tanpa argumen, dibuat array berukuran 0.

source: See also :ref:`binaryseq` and :ref:`typebytearray`.
id: Lihat juga: ref:`binaryseq` dan :ref:` typebytearray`.

source: Return a new "bytes" object, which is an immutable sequence of integers in the range ``0 <= x < 256``. :class:`bytes` is an immutable version of :class:`bytearray` -- it has the same non-mutating methods and the same indexing and slicing behavior.
id: Kembalikan objek "bytes" baru, yang merupakan urutan bilangan bulat yang tidak dapat diubah *immutable* dalam kisaran ``0 <= x < 256``. :class:`bytes` adalah versi yang tidak dapat diubah dari :class:`bytearray` -- ia memiliki metode non-mutasi *non-mutating* yang sama dan perilaku pengindeksan dan pengirisan yang sama.

source: Accordingly, constructor arguments are interpreted as for :func:`bytearray`.
id: Dengan demikian, argumen konstruktor ditafsirkan untuk :func:`bytearray`.

source: Bytes objects can also be created with literals, see :ref:`strings`.
id: Objek byte juga dapat dibuat dengan literal, lihat :ref:`strings`.

source: See also :ref:`binaryseq`, :ref:`typebytes`, and :ref:`bytes-methods`.
id: Lihat juga :ref:`binaryseq`, :ref:`typebytes`, dan :ref:`bytes-methods`.

source: Return :const:`True` if the *object* argument appears callable, :const:`False` if not. If this returns ``True``, it is still possible that a call fails, but if it is ``False``, calling *object* will never succeed. Note that classes are callable (calling a class returns a new instance); instances are callable if their class has a :meth:`__call__` method.
id: Kembalikan :const:`True` jika argumen *object* tampak dapat dipanggil, :const:`False` jika tidak. Jika ini mengembalikan nilai ``True``, masih mungkin bahwa pemanggilan gagal, tetapi jika itu ``False``, memanggil *object* tidak akan pernah berhasil. Perhatikan bahwa kelas dapat dipanggil (memanggil kelas mengembalikan instansi baru); instansi dapat dipanggil jika kelasnya memiliki metode :meth:`__call__`.

source: This function was first removed in Python 3.0 and then brought back in Python 3.2.
id: Fungsi ini pertama kali dihapus di Python 3.0 dan kemudian dibawa kembali di Python 3.2.

source: Return the string representing a character whose Unicode code point is the integer *i*. For example, ``chr(97)`` returns the string ``'a'``, while ``chr(8364)`` returns the string ``'€'``. This is the inverse of :func:`ord`.
id: Kembalikan string yang mewakili karakter dimana titik kode Unicode sebagai integer *i*. Misalnya, ``chr(97)`` mengembalikan string ``'a'``, sementara ``chr(8364)`` mengembalikan string ``'€'``. Ini adalah kebalikan dari :func:`ord`.

source: The valid range for the argument is from 0 through 1,114,111 (0x10FFFF in base 16). :exc:`ValueError` will be raised if *i* is outside that range.
id: Rentang yang valid untuk argumen adalah dari 0 hingga 1.114.111 (0x10FFFF dalam basis 16). :exc:`ValueError` akan ditimbulkan jika *i* berada di luar rentang itu.

source: Transform a method into a class method.
id: Ubah metode menjadi metode kelas.

source: A class method receives the class as implicit first argument, just like an instance method receives the instance. To declare a class method, use this idiom::
id: Metode kelas atau *class method* menerima kelas sebagai argumen implisit pertama, seperti halnya metode *instance* menerima *instance*. Untuk mendeklarasikan metode kelas, gunakan idiom ini::

source: The ``@classmethod`` form is a function :term:`decorator` -- see :ref:`function` for details.
id: Bentuk ``@classmethod`` adalah fungsi :term:`decorator` -- lihat :ref:`function` untuk detail.

source: A class method can be called either on the class (such as ``C.f()``) or on an instance (such as ``C().f()``). The instance is ignored except for its class. If a class method is called for a derived class, the derived class object is passed as the implied first argument.
id: Metode kelas dapat dipanggil baik pada kelas (seperti ``C.f()``) atau pada *instance* (seperti ``C().f()``). Instance diabaikan kecuali untuk kelasnya. Jika metode kelas dipanggil untuk kelas turunan, objek kelas turunan dilewatkan sebagai argumen pertama yang tersirat.

source: Compile the *source* into a code or AST object. Code objects can be executed by :func:`exec` or :func:`eval`. *source* can either be a normal string, a byte string, or an AST object. Refer to the :mod:`ast` module documentation for information on how to work with AST objects.
id: Kompilasi *source* menjadi kode atau objek AST. Objek kode dapat dieksekusi oleh :func:`exec` atau :func:`eval`. *source* dapat berupa string normal, string byte, atau objek AST. Rujuk ke dokumentasi modul :mod:`ast` untuk informasi tentang cara bekerja dengan objek AST.

source: The *filename* argument should give the file from which the code was read; pass some recognizable value if it wasn't read from a file (``'<string>'`` is commonly used).
id: Argumen *filename* harus memberikan berkas dari mana kode dibaca; berikan nilai yang dapat dikenali jika tidak dibaca dari berkas (``'<string>'`` biasa digunakan).

source: The *mode* argument specifies what kind of code must be compiled; it can be ``'exec'`` if *source* consists of a sequence of statements, ``'eval'`` if it consists of a single expression, or ``'single'`` if it consists of a single interactive statement (in the latter case, expression statements that evaluate to something other than ``None`` will be printed).
id: Argumen *mode* menentukan jenis kode apa yang harus dikompilasi; itu bisa ``'exec'`` jika *source* terdiri dari urutan pernyataan, ``'eval'`` jika terdiri dari satu ekspresi, atau ``'single'`` jika terdiri dari satu pernyataan interaktif (dalam kasus terakhir, pernyataan ekspresi yang mengevaluasi sesuatu selain ``None`` akan dicetak).

source: The argument *optimize* specifies the optimization level of the compiler; the default value of ``-1`` selects the optimization level of the interpreter as given by :option:`-O` options. Explicit levels are ``0`` (no optimization; ``__debug__`` is true), ``1`` (asserts are removed, ``__debug__`` is false) or ``2`` (docstrings are removed too).
id: Argumen *optimize* menentukan tingkat optimisasi *compiler*; nilai default ``-1`` memilih tingkat optimisasi interpreter seperti yang diberikan oleh opsi :option:`-O`. Level eksplisitnya adalah ``0`` (tidak ada optimisasi; ``__debug__`` bernilai benar), ``1`` (*asserts* dihapus, ``__debug__`` bernilai salah) atau ``2`` (*docstrings* juga dihapus ).

source: This function raises :exc:`SyntaxError` if the compiled source is invalid, and :exc:`ValueError` if the source contains null bytes.
id: Fungsi ini memunculkan :exc:`SyntaxError` jika sumber yang dikompilasi tidak valid, dan :exc:`ValueError` jika sumbernya berisi byte *null*.

source: If you want to parse Python code into its AST representation, see :func:`ast.parse`.
id: Jika Anda ingin mengurai kode Python ke dalam representasi AST-nya, lihat :func:`ast.parse`.

source: Raises an :ref:`auditing event <auditing>` ``compile`` with arguments ``source``, ``filename``.
id: Memunculkan :ref:`auditing event <auditing>` ``compile`` dengan argumen ``source``, ``filename``.

source: Raises an :ref:`auditing event <auditing>` ``compile`` with arguments ``source`` and ``filename``. This event may also be raised by implicit compilation.
id: Memunculkan :ref:`auditing event <auditing>` ``compile`` dengan argumen ``source`` dan ``filename``. *event* ini juga dapat dimunculkan oleh kompilasi implisit.

source: When compiling a string with multi-line code in ``'single'`` or ``'eval'`` mode, input must be terminated by at least one newline character. This is to facilitate detection of incomplete and complete statements in the :mod:`code` module.
id: Ketika mengkompilasi string dengan kode multi-baris dalam mode ``'single'`` atau ``'eval'``, masukan harus diakhiri oleh setidaknya satu karakter baris baru. Ini untuk memudahkan deteksi pernyataan tidak lengkap dan lengkap dalam modul :mod:`code`.

source: It is possible to crash the Python interpreter with a sufficiently large/complex string when compiling to an AST object due to stack depth limitations in Python's AST compiler.
id: Dimungkinkan untuk membuat *crash* *interpreter* Python dengan string yang cukup besar/kompleks ketika dikompilasi ke objek AST karena batasan kedalaman tumpukan dalam kompiler AST Python.

source: Allowed use of Windows and Mac newlines. Also input in ``'exec'`` mode does not have to end in a newline anymore. Added the *optimize* parameter.
id: Diizinkan menggunakan baris baru Windows dan Mac. Juga masukan dalam mode ``'exec'`` tidak harus berakhir di baris baru lagi. Menambahkan parameter *optimize*.

source: Previously, :exc:`TypeError` was raised when null bytes were encountered in *source*.
id: Sebelumnya, :exc:`TypeError` dimunculkan ketika byte *null* ditemui di *source*.

source: ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` can now be passed in flags to enable support for top-level ``await``, ``async for``, and ``async with``.
id: ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` sekarang dapat diberikan tanda untuk mengaktifkan dukungan untuk ``await``, ``async for``, dan ``async with`` tingkat atas.

source: Return a complex number with the value *real* + *imag*\*1j or convert a string or number to a complex number. If the first parameter is a string, it will be interpreted as a complex number and the function must be called without a second parameter. The second parameter can never be a string. Each argument may be any numeric type (including complex). If *imag* is omitted, it defaults to zero and the constructor serves as a numeric conversion like :class:`int` and :class:`float`. If both arguments are omitted, returns ``0j``.
id: Kembalikan bilangan kompleks dengan nilai *real* + *imag*\*1j atau ubah string atau angka menjadi bilangan kompleks. Jika parameter pertama adalah string, itu akan ditafsirkan sebagai bilangan kompleks dan fungsinya harus dipanggil tanpa parameter kedua. Parameter kedua tidak pernah menjadi string. Setiap argumen dapat berupa tipe numerik apa pun (termasuk kompleks). Jika *imag* dihilangkan, defaultnya adalah nol dan pembangun *constructor* berfungsi sebagai konversi numerik seperti :class:`int` dan :class:`float`. Jika kedua argumen dihilangkan, kembalikan ``0j``.

source: For a general Python object ``x``, ``complex(x)`` delegates to ``x.__complex__()``. If ``__complex__()`` is not defined then it falls back to :meth:`__float__`. If ``__float__()`` is not defined then it falls back to :meth:`__index__`.
id: Untuk objek Python umum ``x``, ``complex(x)`` didelegasikan ke ``x.__complex__()``. Jika ``__complex__()`` tidak didefinisikan maka beralih ke :meth:`__float__`. Jika ``__float__()`` tidak didefinisikan maka beralih ke :meth:`__index__`.

source: When converting from a string, the string must not contain whitespace around the central ``+`` or ``-`` operator. For example, ``complex('1+2j')`` is fine, but ``complex('1 + 2j')`` raises :exc:`ValueError`.
id: Saat mengkonversi dari string, string tidak boleh berisi spasi *whitespace* di sekitar operator ``+`` atau ``-`` pusat. Misalnya, ``complex('1+2j')`` baik-baik saja, tetapi ``complex('1 + 2j')`` menimbulkan :exc:`ValueError`.

source: The complex type is described in :ref:`typesnumeric`.
id: Tipe kompleks dijelaskan dalam :ref:`typesnumeric`.

source: Grouping digits with underscores as in code literals is allowed.
id: Pengelompokan angka dengan garis bawah seperti dalam literal kode diperbolehkan.

source: Falls back to :meth:`__index__` if :meth:`__complex__` and :meth:`__float__` are not defined.
id: Dialihkan ke :meth:`__index__` jika :meth:`__complex__` dan :meth:`__float__` tidak terdefinisi.

source: This is a relative of :func:`setattr`. The arguments are an object and a string. The string must be the name of one of the object's attributes. The function deletes the named attribute, provided the object allows it. For example, ``delattr(x, 'foobar')`` is equivalent to ``del x.foobar``.
id: Ini adalah kerabat *relative* dari :func:`setattr`. Argumen adalah objek dan string. String haruslah nama dari salah satu atribut objek. Fungsi menghapus atribut bernama, asalkan objek memperbolehkannya. Misalnya, ``delattr(x, 'foobar')`` setara dengan ``del x.foobar``.

source: Create a new dictionary. The :class:`dict` object is the dictionary class. See :class:`dict` and :ref:`typesmapping` for documentation about this class.
id: Buat *dictionary* baru. Objek :class:`dict` adalah kelas kamus *dictionary*. Lihat :class:`dict` dan :ref:`typesmapping` untuk dokumentasi tentang kelas ini.

source: For other containers see the built-in :class:`list`, :class:`set`, and :class:`tuple` classes, as well as the :mod:`collections` module.
id: Untuk wadah *containers* lain, lihat kelas-kelas bawaan :class: `list`, :class:`set`, dan :class:`tuple`, dan juga modul :mod:`collections`.

source: Without arguments, return the list of names in the current local scope. With an argument, attempt to return a list of valid attributes for that object.
id: Tanpa argumen, kembalikan daftar *list* nama dalam lingkup lokal saat ini. Dengan argumen, mencoba untuk mengembalikan daftar *list* atribut yang valid untuk objek itu.

source: If the object has a method named :meth:`__dir__`, this method will be called and must return the list of attributes. This allows objects that implement a custom :func:`__getattr__` or :func:`__getattribute__` function to customize the way :func:`dir` reports their attributes.
id: Jika objek memiliki metode bernama :meth:`__dir__`, metode ini akan dipanggil dan harus mengembalikan daftar atribut. Ini memungkinkan objek yang mengimplementasikan fungsi alihsuai *custom* :func:`__getattr__` atau :func:`__getattribute__` untuk menyesuaikan cara :func:`dir` melaporkan atributnya.

source: If the object does not provide :meth:`__dir__`, the function tries its best to gather information from the object's :attr:`~object.__dict__` attribute, if defined, and from its type object. The resulting list is not necessarily complete, and may be inaccurate when the object has a custom :func:`__getattr__`.
id: Jika objek tidak menyediakan :meth: `__dir__`, fungsi mencoba yang terbaik untuk mengumpulkan informasi dari atribut objek :attr:`~objek.__dict__`, jika ditentukan, dan dari objek tipenya. Daftar yang dihasilkan belum tentu lengkap, dan mungkin tidak akurat ketika objek memiliki alihsuai *custom* :func:`__getattr__`.

source: The default :func:`dir` mechanism behaves differently with different types of objects, as it attempts to produce the most relevant, rather than complete, information:
id: Mekanisme bawaan :func:`dir` berperilaku berbeda dengan berbagai jenis objek, karena berusaha menghasilkan informasi yang paling relevan, dibanding lengkap,:

source: If the object is a module object, the list contains the names of the module's attributes.
id: Jika objek adalah objek modul, daftar berisi nama-nama atribut modul.

source: If the object is a type or class object, the list contains the names of its attributes, and recursively of the attributes of its bases.
id: Jika objek adalah tipe atau objek kelas, daftar berisi nama atributnya, dan secara rekursif atribut dari basisnya.

source: Otherwise, the list contains the object's attributes' names, the names of its class's attributes, and recursively of the attributes of its class's base classes.
id: Jika tidak, daftar berisi nama atribut objek, nama atribut kelasnya, dan secara rekursif atribut dari kelas dasar kelasnya.

source: The resulting list is sorted alphabetically. For example:
id: Daftar yang dihasilkan diurutkan berdasarkan abjad. Sebagai contoh:

source: Because :func:`dir` is supplied primarily as a convenience for use at an interactive prompt, it tries to supply an interesting set of names more than it tries to supply a rigorously or consistently defined set of names, and its detailed behavior may change across releases. For example, metaclass attributes are not in the result list when the argument is a class.
id: Karena :func:`dir` disediakan terutama sebagai kenyamanan untuk digunakan pada prompt interaktif, ia mencoba untuk memasok sekumpulan nama yang menarik lebih dari sekedar untuk menyediakan sekumpulan nama yang didefinisikan secara ketat atau konsisten, dan perilakunya yang terperinci dapat berubah lintas rilis. Misalnya, atribut metaclass tidak ada dalam daftar hasil ketika argumennya adalah kelas.
