Repository: python/python-docs-id
Catalog: python-newest.faq--installed/*.po
Languages: id

source: "Why is Python Installed on my Computer?" FAQ
id: "Kenapa Python Terpasang di Komputer saya?" FAQ

source: What is Python?
id: Apa itu Python?

source: Python is a programming language. It's used for many different applications. It's used in some high schools and colleges as an introductory programming language because Python is easy to learn, but it's also used by professional software developers at places such as Google, NASA, and Lucasfilm Ltd.
id: Python adalah bahasa pemrograman. Digunakan untuk berbagai aplikasi. Digunakan di sejumlah sekolah menengah dan perguruan tinggi sebagai pengenalan bahasa pemrograman karena Python mudah dipelajari, namun juga digunakan oleh pengembang perangkat lunak profesional di berbagai tempat misalnya Google, NASA, dan Lucasfilm Ltd.

source: If you wish to learn more about Python, start with the `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_.
id: Jika anda ingin pelajari Python lebih lanjut, mulai dengan `Panduan Pemula untuk Python <https://wiki.python.org/moin/BeginnersGuide>`_.

source: Why is Python installed on my machine?
id: Kenapa Python Terpasang di Komputer saya?

source: If you find Python installed on your system but don't remember installing it, there are several possible ways it could have gotten there.
id: Jika Anda menemukan Python terpasang pada sistem Anda tetapi tidak ingat pemasangannya, ada beberapa kemungkinan penyebab bisa ada di situ.

source: Perhaps another user on the computer wanted to learn programming and installed it; you'll have to figure out who's been using the machine and might have installed it.
id: Mungkin pengguna komputer lain ingin belajar pemrograman dan memasangnya; Anda harus mencari tahu siapa yang menggunakan mesin dan mungkin memasangnya.

source: A third-party application installed on the machine might have been written in Python and included a Python installation. There are many such applications, from GUI programs to network servers and administrative scripts.
id: Aplikasi pihak ketiga yang terpasang di mesin mungkin ditulis dengan Python dan menyertakan instalasi Python. Ada banyak aplikasi, dari program GUI hingga skrip jaringan server dan administrasi.

source: Some Windows machines also have Python installed. At this writing we're aware of computers from Hewlett-Packard and Compaq that include Python. Apparently some of HP/Compaq's administrative tools are written in Python.
id: Beberapa mesin Windows telah terpasang Python. Pada saat penulisan ini sudah diketahui komputer-komputer dari Hewlett-Packard dan Compaq menyertakan Python. Rupanya beberapa alat administrasi HP/Compaq ditulis dengan Python.

source: Many Unix-compatible operating systems, such as Mac OS X and some Linux distributions, have Python installed by default; it's included in the base installation.
id: Banyak sistem operasi yang kompatibel Unix, misalnya Mac OS X dan sejumlah distribusi Linux, terpasang Python secara bawaan; disertakan di basis instalasi.

source: Can I delete Python?
id: Dapatkah Saya hapus Python?

source: That depends on where Python came from.
id: Hal itu tergantung dari mana Python berasal.

source: If someone installed it deliberately, you can remove it without hurting anything. On Windows, use the Add/Remove Programs icon in the Control Panel.
id: Jika seseorang memasangnya dengan sengaja, Anda dapat menghapusnya tanpa merusak apapun. Di Windows, gunakan ikon Add/Remove Programs di Control Panel.

source: If Python was installed by a third-party application, you can also remove it, but that application will no longer work. You should use that application's uninstaller rather than removing Python directly.
id: Jika Python dipasang oleh aplikasi pihak ketiga, Anda juga dapat menghapusnya, tetapi aplikasi tersebut tidak akan berfungsi lagi. Anda perlu menggunakan penghapus pemasangan aplikasi dibanding menghapus Python secara langsung.

source: If Python came with your operating system, removing it is not recommended. If you remove it, whatever tools were written in Python will no longer run, and some of them might be important to you. Reinstalling the whole system would then be required to fix things again.
id: Jika Python terpasang dari sistem operasi Anda, tidak direkomendasikan untuk menghapusnya. Jika Anda menghapusnya, alat apapun yang ditulis dengan Python akan tidak berfungsi lagi, dan sejumlah diantaranya mungkin penting untuk Anda. Memasang ulang keseluruhan sistem akan dibutuhkan untuk memperbaikinya lagi.
