Repository: python/python-docs-id
Catalog: python-newest.extending--index/*.po
Languages: id

source: Extending and Embedding the Python Interpreter
id: Memperluas dan Menggabungkan Interpreter Python

source: This document describes how to write modules in C or C++ to extend the Python interpreter with new modules. Those modules can not only define new functions but also new object types and their methods. The document also describes how to embed the Python interpreter in another application, for use as an extension language. Finally, it shows how to compile and link extension modules so that they can be loaded dynamically (at run time) into the interpreter, if the underlying operating system supports this feature.
id: Dokumen ini menjelaskan cara menulis modul dalam C atau C++ untuk memperluas interpreter Python dengan modul baru. Modul-modul itu tidak hanya dapat mendefinisikan fungsi baru tetapi juga jenis objek baru dan metode mereka. Dokumen ini juga menjelaskan cara menanamkan interpreter Python di aplikasi lain, untuk digunakan sebagai ekstensi bahasa. Akhirnya, ini menunjukkan bagaimana mengkompilasi dan menautkan modul ekstensi sehingga mereka dapat dimuat secara dinamis (pada saat *run time*) ke dalam interpreter, jika sistem operasi yang mendasarinya mendukung fitur ini.

source: This document assumes basic knowledge about Python. For an informal introduction to the language, see :ref:`tutorial-index`. :ref:`reference-index` gives a more formal definition of the language. :ref:`library-index` documents the existing object types, functions and modules (both built-in and written in Python) that give the language its wide application range.
id: Dokumen ini mengasumsikan pengetahuan dasar tentang Python. Untuk pengantar informal ke bahasa, lihat :ref:`tutorial-index`. :ref:`reference-index` memberikan definisi bahasa yang lebih formal. :ref:`library-index` mendokumentasikan jenis objek, fungsi, dan modul yang ada (baik bawaan dan ditulis dengan Python) yang memberikan rentang penggunaan aplikasi yang luas terhadap bahasa tersebut.

source: For a detailed description of the whole Python/C API, see the separate :ref:`c-api-index`.
id: Untuk deskripsi terperinci dari keseluruhan API Python/C, lihat bagian terpisah :ref:`c-api-index`.

source: Recommended third party tools
id: Alat pihak ketiga yang direkomendasikan

source: This guide only covers the basic tools for creating extensions provided as part of this version of CPython. Third party tools like `Cython <http://cython.org/>`_, `cffi <https://cffi.readthedocs.io>`_, `SWIG <http://www.swig.org>`_ and `Numba <https://numba.pydata.org/>`_ offer both simpler and more sophisticated approaches to creating C and C++ extensions for Python.
id: Panduan ini hanya mencakup alat dasar untuk membuat ekstensi yang disediakan sebagai bagian dari versi CPython ini. Alat pihak ketiga seperti `Cython <http://cython.org/>`_, `cffi <https://cffi.readthedocs.io>`_, `SWIG <http://www.swig.org>`_ dan `Numba <https://numba.pydata.org/>`_ menawarkan pendekatan yang lebih sederhana dan lebih canggih untuk membuat ekstensi C dan C++ untuk Python.

source: `Python Packaging User Guide: Binary Extensions <https://packaging.python.org/guides/packaging-binary-extensions/>`_
id: `Panduan Pengguna Pengemasan Python: Ekstensi Biner <https://packaging.python.org/guides/packaging-binary-extensions/>`_

source: The Python Packaging User Guide not only covers several available tools that simplify the creation of binary extensions, but also discusses the various reasons why creating an extension module may be desirable in the first place.
id: Panduan Pengguna Pengemasan Python tidak hanya mencakup beberapa alat yang tersedia yang menyederhanakan pembuatan ekstensi biner, tetapi juga membahas berbagai alasan mengapa membuat modul ekstensi mungkin diinginkan di awal.

source: Creating extensions without third party tools
id: Membuat ekstensi tanpa alat pihak ketiga

source: This section of the guide covers creating C and C++ extensions without assistance from third party tools. It is intended primarily for creators of those tools, rather than being a recommended way to create your own C extensions.
id: Bagian panduan ini mencakup pembuatan ekstensi C dan C++ tanpa bantuan dari alat pihak ketiga. Ini dimaksudkan terutama untuk pembuat alat-alat itu, daripada menjadi cara yang disarankan untuk membuat ekstensi C Anda sendiri.

source: Embedding the CPython runtime in a larger application
id: Menggabungkan runtime CPython di aplikasi yang lebih besar

source: Sometimes, rather than creating an extension that runs inside the Python interpreter as the main application, it is desirable to instead embed the CPython runtime inside a larger application. This section covers some of the details involved in doing that successfully.
id: Terkadang, alih-alih membuat ekstensi yang berjalan di dalam interpreter Python sebagai aplikasi utama, lebih baik menanamkan runtime CPython di dalam aplikasi yang lebih besar. Bagian ini mencakup beberapa detail yang terlibat dalam melakukan hal itu dengan sukses.
