Repository: python/python-docs-id
Catalog: python-newest.c-api--float/*.po
Languages: id

source: Floating Point Objects
id: Objek Pecahan

source: This subtype of :c:type:`PyObject` represents a Python floating point object.
id: Subtipe dari :c:type:`PyObject` ini mewakili objek pecahan Python.

source: This instance of :c:type:`PyTypeObject` represents the Python floating point type. This is the same object as :class:`float` in the Python layer.
id: Instance dari :c:type:`PyTypeObject` ini mewakili tipe pecahan Python. Ini adalah objek yang sama dengan :class:`float` di lapisan Python.

source: Return true if its argument is a :c:type:`PyFloatObject` or a subtype of :c:type:`PyFloatObject`. This function always succeeds.
id: Mengambalikan nilai true jika argumennya adalah :c:type:`PyFloatObject` atau subtipe dari :c:type:`PyFloatObject`. Fungsi ini selalu sukses.

source: Return true if its argument is a :c:type:`PyFloatObject`, but not a subtype of :c:type:`PyFloatObject`. This function always succeeds.
id: Mengambalikan nilai true jika argumennya adalah :c:type:`PyFloatObject`, tetapi bukan subtipe dari :c:type:`PyFloatObject`.

source: Create a :c:type:`PyFloatObject` object based on the string value in *str*, or ``NULL`` on failure.
id: Membuat objek :c:type:`PyFloatObject` berdasarkan nilai string di *str*, atau ``NULL`` jika gagal.

source: Create a :c:type:`PyFloatObject` object from *v*, or ``NULL`` on failure.
id: Membuat objek :c:type:`PyFloatObject` dari *v*, atau ``NULL`` jika gagal.

source: Return a C :c:type:`double` representation of the contents of *pyfloat*. If *pyfloat* is not a Python floating point object but has a :meth:`__float__` method, this method will first be called to convert *pyfloat* into a float. If ``__float__()`` is not defined then it falls back to :meth:`__index__`. This method returns ``-1.0`` upon failure, so one should call :c:func:`PyErr_Occurred` to check for errors.
id: Mengembalikan representasi C :c:type:`double` dari konten *pyfloat*. Jika *pyfloat* bukan objek pecahan Python tetapi memiliki metode :meth:`__float__`, metode ini pertama-tama akan dipanggil untuk mengubah *pyfloat* menjadi float. Jika ``__float__ ()`` tidak ditentukan maka kembali ke :meth:`__index__`. Metode ini mengembalikan ``-1.0`` setelah gagal, jadi seseorang harus memanggil :c:func:`PyErr_Occurred` untuk memeriksa kesalahan.

source: Use :meth:`__index__` if available.
id: Gunakan :meth:`__index__` jika tersedia.

source: Return a C :c:type:`double` representation of the contents of *pyfloat*, but without error checking.
id: Mengembalikan representasi C :c:type:`double` dari konten *pyfloat*, tetapi tanpa pemeriksaan error.

source: Return a structseq instance which contains information about the precision, minimum and maximum values of a float. It's a thin wrapper around the header file :file:`float.h`.
id: Mengembalikan instance structseq yang berisi informasi tentang presisi, nilai minimum dan maksimum float. Ini adalah pembungkus tipis di sekitar file header :file:`float.h`.

source: Return the maximum representable finite float *DBL_MAX* as C :c:type:`double`.
id: Mengembalikan float maksimum yang dapat direpresentasikan *DBL_MAX* sebagai C :c:type:`double`.

source: Return the minimum normalized positive float *DBL_MIN* as C :c:type:`double`.
id: Mengembalikan float positif minimum yang dinormalisasi *DBL_MIN* sebagai C :c:type:`double`.
