Repository: python/python-docs-id
Catalog: python-newest.library--calendar/*.po
Languages: id

source: :mod:`calendar` --- General calendar-related functions
id: :mod:`calendar` --- Fungsi-fungsi umum yang terkait dengan modul calendar

source: This module allows you to output calendars like the Unix :program:`cal` program, and provides additional useful functions related to the calendar. By default, these calendars have Monday as the first day of the week, and Sunday as the last (the European convention). Use :func:`setfirstweekday` to set the first day of the week to Sunday (6) or to any other weekday. Parameters that specify dates are given as integers. For related functionality, see also the :mod:`datetime` and :mod:`time` modules.
id: Modul ini mengijinkan saudara untuk mendapatkan keluaran kalender-kalender seperti halnya di program Unix :program:`cal`, dan menyediakan fungsi-fungsi tambahan yang berguna yang terkait dengan kalender. Secara bawaan, kalender-kalender ini telah ditentukan dimulai dari hari Senin sebagai hari pertama dalam seminggu, dan Sabtu sebagai hari terakhir (merupakan sistem yang dianut oleh Eropa). Gunakan :func:`setfirstweekday` untuk mengatur hari pertama dalam seminggu ke hari Sabtu (6) atau ke nama hari yang lain. Parameter-parameter yang menentukan tanggal-tanggal diberikan dalam bentuk bilangan bulat. Untuk fungsionalitas yang lain, lihat juga modul-modul :mod:`datetime` dan :mod:`time`.

source: The functions and classes defined in this module use an idealized calendar, the current Gregorian calendar extended indefinitely in both directions. This matches the definition of the "proleptic Gregorian" calendar in Dershowitz and Reingold's book "Calendrical Calculations", where it's the base calendar for all computations. Zero and negative years are interpreted as prescribed by the ISO 8601 standard. Year 0 is 1 BC, year -1 is 2 BC, and so on.
id: Fungsi-fungsi dan kelas-kelas yang didefinisikan di modul ini menggunakan kalender yang telah diidealkan, yaitu kalender Gregorian yang digunakan saat ini yang rentang waktunya tak terbatas ke arah masa depan dan masa lalu. Hal ini bersesuaian dengan definisi dari kalender "proleptic Gregorian" di buku "Calendrical Calculation" oleh Dershowitz dan Reingold, yang merupakan kalender dasar bagi semua ragam komputasi. Tahun-tahun nol dan negatif diinterpretasikan sesuai dengan standar ISO 8601. Tahun 0 adalah 1 SM, tahun -1 adalah 2 SM, demikian seterusnya,

source: Creates a :class:`Calendar` object. *firstweekday* is an integer specifying the first day of the week. ``0`` is Monday (the default), ``6`` is Sunday.
id: Membuat suatu objek :class:`Calendar`. *firstweekday* adalah suatu bilangan bulat yang menentukan hari pertama dalam suatu pekan. ``0`` mewakili Senin (nilai bawaan), ``6`` mewakili Minggu.

source: A :class:`Calendar` object provides several methods that can be used for preparing the calendar data for formatting. This class doesn't do any formatting itself. This is the job of subclasses.
id: Suatu object :class:`Calendar` menyediakan beberapa metode yang dapat digunakan untuk mempersiapkan data kalender yang akan digunakan untuk proses pemformatan setelahnya. Kelas ini tidak dapat melakukan penformatan dengan sendirinya. Proses penformatan merupakan tugas dari subkelas-subkelas di dalam kelas tersebut.

source: :class:`Calendar` instances have the following methods:
id: Instanse-instanse :class:`Calendar` memiliki metode-metode berikut:

source: Return an iterator for the week day numbers that will be used for one week. The first value from the iterator will be the same as the value of the :attr:`firstweekday` property.
id: Memberikan keluaran suatu iterator berupa nomor hari dalam sepekan yang akan digunakan dalam sepekan. Nilai pertama iterator tersebut sama dengan nilai milik :attr:`firstweekday`.

source: Return an iterator for the month *month* (1--12) in the year *year*. This iterator will return all days (as :class:`datetime.date` objects) for the month and all days before the start of the month or after the end of the month that are required to get a complete week.
id: Memberikan keluaran suatu iterator untuk bulan *month* (1--12) dalam suatu tahun *year*. Iterator ini akan memberikan keluaran semua hari (berupa objek :class:`datetime.date`) dalam sebulan dan semua hari sebelum dimulainya bulan tersebut dan sesudah berakhir bulan tersebut yang diperlukan untuk melengkapi 7 hari lengkap dalam sepekan.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will simply be day of the month numbers. For the days outside of the specified month, the day number is ``0``.
id: Memberikan keluaran suatu iterator untuk bulan *month* dalam suatu tahun *year* serupa dengan :meth:`itermonthdates`, tetapi tidak dibatasi oleh rentang :class:`datetime.date`. Hari-hari yang diberikan berupa nomor-nomor tanggal dalam sebulan. Untuk hari-hari diluar bulan yang ditentukan, nomor hari adalah ``0``.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will be tuples consisting of a day of the month number and a week day number.
id: Memberikan keluaran suatu iterator untuk bulan *month* dalam suatu tahun *year* serupa dengan :meth:`itermonthdates`, tetapi tidak dibatasi oleh rentang :class:`datetime.date`. Hari-hari yang diberikan berupa tuples yang memuat nomor hari dalam sebulan dan nomor hari dalam seminggu.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will be tuples consisting of a year, a month and a day of the month numbers.
id: Memberikan keluaran suatu iterator untuk bulan *month* dalam suatu tahun *year* serupa dengan :meth:`itermonthdates`, tetapi tidak dibatasi oleh rentang :class:`datetime.date`. Hari-hari yang diberikan berupa tuples yang memuat nomor tahun, bulan, dan hari.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will be tuples consisting of a year, a month, a day of the month, and a day of the week numbers.
id: Memberikan keluaran suatu iterator untuk bulan *month* dalam suatu tahun *year* serupa dengan :meth:`itermonthdates`, tetapi tidak dibatasi oleh rentang :class:`datetime.date`. Hari-hari yang diberikan berupa tuples yang terdiri dari nomort tahun, bulan, hari, dan hari dalam sepekan.

source: Return a list of the weeks in the month *month* of the *year* as full weeks. Weeks are lists of seven :class:`datetime.date` objects.
id: Memberikan keluaran berupa suatu list pekan-pekan dalam suatu bulan *month* di suatu tahun *year* sebagai hari-hari lengkap dalam sepekan. Pekan-pekan adalah lists tujuh objek-object :class:`datetime.date`.

source: Return a list of the weeks in the month *month* of the *year* as full weeks. Weeks are lists of seven tuples of day numbers and weekday numbers.
id: Memberikan keluaran berupa suatu list pekan-pekan dalam satu bulan *month* di suatu tahun *year* sebagai hari lengkap dalam sepekan. Pekan-pekan adalah lists tujuh tuples tanggal dan nomor hari dalam sepekan.

source: Return a list of the weeks in the month *month* of the *year* as full weeks. Weeks are lists of seven day numbers.
id: Memberikan keluaran berupa suatu list pekan-pekan dalam satu bulan *month* di suatu tahun *year* sebagai hari lengkap dalam sepekan. Pekan-pekan adalah lists tujuh nomor tanggal.

source: Return the data for the specified year ready for formatting. The return value is a list of month rows. Each month row contains up to *width* months (defaulting to 3). Each month contains between 4 and 6 weeks and each week contains 1--7 days. Days are :class:`datetime.date` objects.
id: Memberikan keluaran data berdasarkan tahun yang telah ditentukan yang dapat digunakan sebagai input dalam proses penformatan. Nilai keluaran tersebut adalah suatu list bulan tersusun dalam baris-baris. Setiap baris memuat banyaknya *width* bulan (dipasang secara default di 3). Setiap bulan memuat antara 4 sampai 6 pekan dan setiap pekan memuat 1--7 hari. Hari-hari merupakan objek :class:`datetime.date`.

source: Return the data for the specified year ready for formatting (similar to :meth:`yeardatescalendar`). Entries in the week lists are tuples of day numbers and weekday numbers. Day numbers outside this month are zero.
id: Memberikan keluaran data yang berdasarkan tahun yang telah ditentukan yang dapat digunakan sebagai input dalam proses penformatan (serupa dengan :meth:`yeardatescalendar`). Keluaran yang diberikan di dalam lists pekan berupa tuples yang memuat nomor-nomor hari dan nomor-nomor hari dalam sepekan. Nomor-nomor hari diluar bulan yang ditentukan dipasang pada nilai nol.

source: Return the data for the specified year ready for formatting (similar to :meth:`yeardatescalendar`). Entries in the week lists are day numbers. Day numbers outside this month are zero.
id: Memberikan keluaran data yang berdasarkan tahun yang telah ditentukan yang dapat digunakan sebagai input dalam proses penformatan (serupa dengan :meth:`yeardatescalendar`). Keluaran yang diberikan di dalam lists pekan berupa nomor hari. Nomor hari diluar bulan yang ditentukan dipasang pada nilai nol.

source: This class can be used to generate plain text calendars.
id: Kelas ini digunakan untuk menbangkitkan kalender-kalender berformat teks biasa / berkas ASCII.

source: :class:`TextCalendar` instances have the following methods:
id: Instanse-instanse :class:`TextCalendar` memiliki metode-metode berikut:

source: Return a month's calendar in a multi-line string. If *w* is provided, it specifies the width of the date columns, which are centered. If *l* is given, it specifies the number of lines that each week will use. Depends on the first weekday as specified in the constructor or set by the :meth:`setfirstweekday` method.
id: Memberikan keluaran suatu kalender bulan dalam bentuk suatu string multi-baris. Jika nilai *w* diberikan, nilai ini akan menentukan lebar dari lajur-lajur tanggal, yang mana string akan disejajarkan rata tengah. Jika nilai *l* diberikan, nilai ini akan menentukan banyaknya baris yang digunakan untuk tiap pekan. Metode ini bergantung pada penentuan hari pertama dalam sepekan sebagaimana yang telah dipilih dalam constructor atau yang telah diatur dengan metode :meth:`setfirstweekday`.

source: Print a month's calendar as returned by :meth:`formatmonth`.
id: Mencetak suatu kalender bulan sebagaimana yang diberikan oleh :meth:`formatmonth`.

source: Return a *m*-column calendar for an entire year as a multi-line string. Optional parameters *w*, *l*, and *c* are for date column width, lines per week, and number of spaces between month columns, respectively. Depends on the first weekday as specified in the constructor or set by the :meth:`setfirstweekday` method. The earliest year for which a calendar can be generated is platform-dependent.
id: Memberikan keluaran suatu *m*-lajur kalender setahun dalam bentuk string multi-baris. Parameter-parameter opsional *w*, *l*, dan *c* adalah lebar lajur tanggal, banyaknya baris tiap minggu, dan banyaknya spasi antara lajur-lajur bulan, berturut-turut. Metode ini bergantung pada penentuan hari pertama dalam sepekan sebagaimana yang telah dipilih dalam constructor atau yang telah diatur dengan metode :meth:`setfirstweekday`. Tahun-tahun awal yang mana suatu kalender dapat dibangkitkan bergantung pada platform yang digunakan.

source: Print the calendar for an entire year as returned by :meth:`formatyear`.
id: Mencetak kalender untuk satu tahun penuh sebagaimana yang diberikan oleh :meth:`formatyear`.

source: This class can be used to generate HTML calendars.
id: Kelas ini dapat digunakan untuk membangkitkan kalender-kalender berformat HTML.

source: :class:`!HTMLCalendar` instances have the following methods:
id: Instanse-instanse :class:`!HTMLCalendar` memliki metode-metode berikut:

source: Return a month's calendar as an HTML table. If *withyear* is true the year will be included in the header, otherwise just the month name will be used.
id: Memberikan keluaran suatu kalender bulan dalam bentuk suatu tabel HTML. Jika nilai *withyear* adalah logika benar, tahun akan ditampilkan di bagian tajuk. Demikian sebaliknya hanya nama bulan yang ditampilkan.

source: Return a year's calendar as an HTML table. *width* (defaulting to 3) specifies the number of months per row.
id: Memberikan keluaran suatu kalender tahunan dalam bentuk suatu tabel HTML. Argumen *width* (nilai bawaan adalah 3) menentukan banyaknya bulan tiap baris.

source: Return a year's calendar as a complete HTML page. *width* (defaulting to 3) specifies the number of months per row. *css* is the name for the cascading style sheet to be used. :const:`None` can be passed if no style sheet should be used. *encoding* specifies the encoding to be used for the output (defaulting to the system default encoding).
id: Memberikan keluaran suatu kalender tahunan dalam bentuk suatu halaman HTML lengkap. *width* (nilai bawaan adalah 3) menentukan banyaknya bulan tiap baris. *css* adalah nama untuk cascading style sheet yang digunakan. :const:`None` dapat diberikan pada argumen css jika tidak ada style sheet yang digunakan. *encoding* menentukan pengodean yang digunakan untuk keluaran (nilai bawaan pada sistem adalah nilai bawaan pengodean ini).

source: :class:`!HTMLCalendar` has the following attributes you can override to customize the CSS classes used by the calendar:
id: :class:`!HTMLCalendar` memliki atribut-atribut berikut yang dapat ditimpa atribut baru dengan tujuan untuk mengubahsuaikan kelas-kelas CSS yang di gunakan di kelas kalendar:

source: A list of CSS classes used for each weekday. The default class list is::
id: Suatu list kelas-kelas CSS yang digunakan untuk tiap hari-hari dalam sepekan. List kelas bawaan berupa::

source: more styles can be added for each day::
id: Beberapa corak-corak dapat ditambahkan untuk penformatan tampilan tiap hari::

source: Note that the length of this list must be seven items.
id: Perlu diperhatikan bahwa panjang dari list ini haruslah tujuh item.

source: The CSS class for a weekday occurring in the previous or coming month.
id: Kelas CSS untuk hari-hari dalam sepekan yang muncul sebelum dan sesudah bulan yang dipilih.

source: A list of CSS classes used for weekday names in the header row. The default is the same as :attr:`cssclasses`.
id: Suatu list kelas-kelas CSS yang digunakan untuk hari-hari dalam sepekan di baris tajuk. Nilai bawaan untuk atribut ini adalah sama dengan atribut :attr:`cssclasses`.

source: The month's head CSS class (used by :meth:`formatmonthname`). The default value is ``"month"``.
id: Kelas CSS untuk bagian atas penamaan bulan (digunakan oleh metode :meth:`formatmonthname`). Nilai bawaan untuk atribut ini adalah ``"month"``.

source: The CSS class for the whole month's table (used by :meth:`formatmonth`). The default value is ``"month"``.
id: Kelas CSS untuk seluruh tabel bulan (digunakan oleh metode :meth:`formatmonth`). Nilai bawaan untuk atribut ini adalah ``"month"``.

source: The CSS class for the whole year's table of tables (used by :meth:`formatyear`). The default value is ``"year"``.
id: Kelas CSS untuk seluruh tabel-tabel bulan dalam setahun (digunakan oleh metode :meth:`formatyear`). Nilai bawaan untuk atribut ini adalah ``"year"``.

source: The CSS class for the table head for the whole year (used by :meth:`formatyear`). The default value is ``"year"``.
id: Kelas CSS kepala tabel untuk seluruh bulan dalam setahun (digunakan oleh :meth:`formatyear`). Nilai bawaan untuk atribut ini adalah ``"year"``.

source: Note that although the naming for the above described class attributes is singular (e.g. ``cssclass_month`` ``cssclass_noday``), one can replace the single CSS class with a space separated list of CSS classes, for example::
id: Perlu diperhatikan meskipun penamaan atribut-atribut kelas yang dijelaskan di atas bersifat tunggal (sebagai contoh ``cssclass_month`` ``cssclass_noday``), pengguna dapat mengganti kelas CSS tunggal dengan suatu list kelas-kelas CSS yang saling terpisah oleh spasi, sebagai contoh::

source: Here is an example how :class:`!HTMLCalendar` can be customized::
id: Berikut ini adalah suatu contoh bagaimana :class:`!HTMLCalendar` dapat diubahsuaikan::

source: This subclass of :class:`TextCalendar` can be passed a locale name in the constructor and will return month and weekday names in the specified locale. If this locale includes an encoding all strings containing month and weekday names will be returned as unicode.
id: Subkelas :class:`TextCalendar` ini dapat ditambahkan suatu nama lokal pada konstruktornya dan akan memberikan keluaran nama-nama bulan dan hari dalam sepekan yang bersesuaian dengan sistem lokal dari komputer. Jika lokal ini memuat suatu pengkodean semua string untuk bulan dan hari dalam sepekan, nama bulan dan hari tersebut akan diberikan dalam unicode.

source: This subclass of :class:`HTMLCalendar` can be passed a locale name in the constructor and will return month and weekday names in the specified locale. If this locale includes an encoding all strings containing month and weekday names will be returned as unicode.
id: Subkelas :class:`HTMLCalendar` ini dapat ditambahkan suatu nama lokal pada konstruktornya dan akan memberikan keluaran nama-nama bulan dan hari dalam sepekan yang bersesuaian dengan sistem lokal dari komputer. Jika lokal ini memuat suatu pengkodean semua string untuk bulan dan hari dalam sepekan, nama bulan dan hari tersebut akan diberikan dalam unicode.

source: The :meth:`formatweekday` and :meth:`formatmonthname` methods of these two classes temporarily change the current locale to the given *locale*. Because the current locale is a process-wide setting, they are not thread-safe.
id: Metode-metode :meth:`formatweekday` dan :meth:`formatmonthname` dari dua kelas di atas mengubah secara sementara lokal saat itu ke *locale* yang diberikan. Dikarenakan lokal saat itu merupakan pengaturan process keseluruhan, metode-metode di atas tidak thread-safe.

source: For simple text calendars this module provides the following functions.
id: Untuk kalender-kalender dengan teks sederhana, modul ini menyediakan fungsi-fungsi berikut.

source: Sets the weekday (``0`` is Monday, ``6`` is Sunday) to start each week. The values :const:`MONDAY`, :const:`TUESDAY`, :const:`WEDNESDAY`, :const:`THURSDAY`, :const:`FRIDAY`, :const:`SATURDAY`, and :const:`SUNDAY` are provided for convenience. For example, to set the first weekday to Sunday::
id: Menetapkan hari dimulainya hitungan minggu (``0`` adalah Senin, ``6`` adalah Minggu). Nilai-nilai :const:`MONDAY`, :const:`TUESDAY`, :const:`WEDNESDAY`, :const:`THURSDAY`, :const:`FRIDAY`, :const:`SATURDAY`, dan :const:`SUNDAY` disediakan secara bawaan demi kenyamanan. Sebagai contoh, untuk mengatur hari dimulainya hitungan minggu di hari Minggu::

source: Returns the current setting for the weekday to start each week.
id: Memberikan keluaran-keluaran pengaturan saat ini untuk hari dimulainya hitungan sepekan.

source: Returns :const:`True` if *year* is a leap year, otherwise :const:`False`.
id: Memberikan keluaran-keluaran :const:`True` jika *year* adalah suatu tahun kabisat, sebaliknya :const:`False`.

source: Returns the number of leap years in the range from *y1* to *y2* (exclusive), where *y1* and *y2* are years.
id: Memberikan keluaran banyaknya tahun-tahun kabisat dalam rentang dari *y1* sampai *y2* (ekslusif, batas rentang tidak ikut diperhitungkan), dengan *y1* dan *y2* adalah angka tahun.

source: This function works for ranges spanning a century change.
id: Fungsi ini berlaku untuk rentang tahun sampai satu abad.

source: Returns the day of the week (``0`` is Monday) for *year* (``1970``--...), *month* (``1``--``12``), *day* (``1``--``31``).
id: Memberikan keluaran hari dalam sepekan (``0`` adalah Senin) untuk *year* (``1970``--...), *month* (``1``--``12``), *day* (``1``--``31``).

source: Return a header containing abbreviated weekday names. *n* specifies the width in characters for one weekday.
id: Memberikan keluaran suatu tajuk yang memuat singkatan nama-nama hari dalam sepekan. *n* mengatur lebar dari karakter-karakter tiap nama-nama hari dalam sepekan.

source: Returns weekday of first day of the month and number of days in month, for the specified *year* and *month*.
id: Memberikan keluaran-keluaran hari dari tanggal pertama di bulan yang dipilih dan banyaknya hari dalam bulan tersebut, dengan *year* dan *month* sebagai argumen yand diisi oleh pengguna.

source: Returns a matrix representing a month's calendar. Each row represents a week; days outside of the month are represented by zeros. Each week begins with Monday unless set by :func:`setfirstweekday`.
id: Memberikan keluaran-keluaran suatu matriks yang mewakili suatu kalendar bulan. Tiap baris mewakili suatu pekan; hari-hari diluar bulan yang dipilih dinyatakan oleh nol. Tiap pekan dimulai dengan Senin kecuali :func:`setfirstweekday` telah diatur untuk dimulai dengan hari yang lain.

source: Prints a month's calendar as returned by :func:`month`.
id: Mencetak suatu kalender bulan sebagaimana yang diberikan oleh :func:`month`.

source: Returns a month's calendar in a multi-line string using the :meth:`formatmonth` of the :class:`TextCalendar` class.
id: Memberikan keluaran suatu kalender bulan dalam bentuk string multi-baris menggunakan metode :meth:`formatmonth` dari kelas :class:`TextCalendar`.

source: Prints the calendar for an entire year as returned by :func:`calendar`.
id: Mencetak kalender untuk satu tahun penuh sebagaimana yang diberikan oleh fungsi :func:`calendar`.

source: Returns a 3-column calendar for an entire year as a multi-line string using the :meth:`formatyear` of the :class:`TextCalendar` class.
id: Memberikan keluaran suatu kalender 3 lajur untuk satu tahun penuh sebagai suatu string multi-baris menggunakan metode :meth:`formatyear` dari kelas :class:`TextCalendar`.

source: An unrelated but handy function that takes a time tuple such as returned by the :func:`~time.gmtime` function in the :mod:`time` module, and returns the corresponding Unix timestamp value, assuming an epoch of 1970, and the POSIX encoding. In fact, :func:`time.gmtime` and :func:`timegm` are each others' inverse.
id: Fungsi yang tak terkait dengan fungsi lain tapi berguna yang menggunakan masukan suatu tuple waktu seperti yang diberikan oleh keluaran fungsi :func:`~time.gmtime` dalam modul :mod:`time`, dan memberikan keluaran yang bersesuaian dengan nilai cap waktu Unix, dengan mengasumsikan zaman dimulai dari tahun 1970, dan penyandian POSIX. Secara fakta, fungsi :func:`time.gmtime` dan :func:`timegm` adalah saling invers satu sama lain.

source: The :mod:`calendar` module exports the following data attributes:
id: Module :mod:`calendar` mengekspor data atribut-atribut berikut:

source: An array that represents the days of the week in the current locale.
id: Suatu array yang mewakili nama hari dalam sepekan berdasarkan pengaturan lokal yang sedang dipakai.

source: An array that represents the abbreviated days of the week in the current locale.
id: Suatu array yang mewakili singkatan nama hari dalam sepekan berdasarkan pengaturan lokal yang sedang dipakai.
