Repository: python/python-docs-id
Catalog: python-newest.library--calendar/*.po
Languages: id

source: An array that represents the months of the year in the current locale. This follows normal convention of January being month number 1, so it has a length of 13 and ``month_name[0]`` is the empty string.
id: Suatu array yang mewakili bulan-bulan dalam suatu tahun berdasarkan pengaturan lokal yang sedang dipakai. Array ini mengikuti aturan normal bahwa Januari merupakan bulan pertama, ditandai dengan angka 1, sehingga array ini akan memiliki panjang 13 item dan ``month_name[0]`` adalah suatu string kosong.

source: An array that represents the abbreviated months of the year in the current locale. This follows normal convention of January being month number 1, so it has a length of 13 and ``month_abbr[0]`` is the empty string.
id: Suatu array yang mewakili singkatan bulan-bulan dalam suatu tahun berdasarkan pengaturan lokal yang sedang dipakai. Array ini mengikuti aturan normal bahwa Januari merupakan bulan pertama, ditandai dengan angka 1, sehingga array ini akan memiliki panjang 13 item dan ``month_abbr[0]`` adalah suatu string kosong.

source: Module :mod:`datetime`
id: Modul :mod:`datetime`

source: Object-oriented interface to dates and times with similar functionality to the :mod:`time` module.
id: Antarmuka berorientasi objek untuk penanggalan dan waktu dengan fungsionalitas mirip modul :mod:`time`.

source: Module :mod:`time`
id: Modul :mod:`time`

source: Low-level time related functions.
id: Fungsi-fungsi waktu tingkat rendah.
