Repository: python/python-docs-id
Catalog: python-newest.faq--general/*.po
Languages: id

source: The Python project's infrastructure is located all over the world and is managed by the Python Infrastructure Team. Details `here <http://infra.psf.io>`__.
id: Infrastruktur proyek Python terletak di seluruh dunia dan dikelola oleh Tim Infrastruktur Python. Detail `di sini <http://infra.psf.io>`__.

source: Why is it called Python?
id: Kenapa disebut Python?

source: When he began implementing Python, Guido van Rossum was also reading the published scripts from `"Monty Python's Flying Circus" <https://en.wikipedia.org/wiki/Monty_Python>`__, a BBC comedy series from the 1970s. Van Rossum thought he needed a name that was short, unique, and slightly mysterious, so he decided to call the language Python.
id: Ketika mulai mengimplementasikan Python, Guido van Rossum juga membaca skrip yang diterbitkan dari `"Sirkus Terbang Monty Python "<https://en.wikipedia.org/wiki/Monty_Python>`__, sebuah serial komedi BBC dari tahun 1970-an. Van Rossum berpikir dia membutuhkan nama yang pendek, unik, dan sedikit misterius, jadi dia memutuskan untuk memanggil bahasa Python.

source: Do I have to like "Monty Python's Flying Circus"?
id: Apakah saya harus menyukai "Monty Python's Flying Circus"?

source: No, but it helps. :)
id: Tidak, tapi itu membantu. :)

source: Python in the real world
id: Python di dunia nyata

source: How stable is Python?
id: Seberapa stabil Python?

source: Very stable. New, stable releases have been coming out roughly every 6 to 18 months since 1991, and this seems likely to continue. As of version 3.9, Python will have a major new release every 12 months (:pep:`602`).
id: Sangat stabil. Rilis baru dan rilisan baru yang stabil telah keluar sekitar setiap 6 sampai 18 bulan sejak 1991, dan ini sepertinya akan terus berlanjut. Mulai versi 3.9, Python akan memiliki rilis baru setiap 12 bulan (:pep:`602`).

source: The developers issue "bugfix" releases of older versions, so the stability of existing releases gradually improves. Bugfix releases, indicated by a third component of the version number (e.g. 3.5.3, 3.6.2), are managed for stability; only fixes for known problems are included in a bugfix release, and it's guaranteed that interfaces will remain the same throughout a series of bugfix releases.
id: Pengembang mengeluarkan rilis "bugfix" dari versi yang lebih lama, sehingga stabilitas rilis yang ada secara bertahap membaik. Rilis perbaikan bug, ditunjukkan oleh komponen ketiga dari nomor versi (mis. 3.5.3, 3.6.2), dikelola untuk stabilitas; hanya perbaikan untuk masalah yang diketahui yang termasuk dalam rilis perbaikan bug, dan dijamin antarmuka akan tetap sama di sepanjang serangkaian rilis perbaikan bug.

source: The latest stable releases can always be found on the `Python download page <https://www.python.org/downloads/>`_. There are two production-ready versions of Python: 2.x and 3.x. The recommended version is 3.x, which is supported by most widely used libraries. Although 2.x is still widely used, `it is not maintained anymore <https://www.python.org/dev/peps/pep-0373/>`_.
id: Rilis stabil terbaru selalu dapat ditemukan di `halaman unduh Python <https://www.python.org/downloads/>`_. Ada dua versi Python yang siap produksi: 2.x dan 3.x. Versi yang disarankan adalah 3.x, yang didukung oleh pustaka yang paling banyak digunakan. Meskipun 2.x masih banyak digunakan, `itu tidak dirawat lagi <https://www.python.org/dev/peps/pep-0373/>`_.

source: How many people are using Python?
id: Berapa banyak orang menggunakan Python?

source: There are probably millions of users, though it's difficult to obtain an exact count.
id: Mungkin ada jutaan pengguna, meskipun sulit untuk mendapatkan jumlah pastinya.

source: Python is available for free download, so there are no sales figures, and it's available from many different sites and packaged with many Linux distributions, so download statistics don't tell the whole story either.
id: Python tersedia untuk diunduh gratis, jadi tidak ada angka penjualan, dan itu tersedia dari banyak situs yang berbeda dan dikemas dengan banyak distribusi Linux, jadi statistik unduhan juga tidak menceritakan keseluruhan cerita.

source: The comp.lang.python newsgroup is very active, but not all Python users post to the group or even read it.
id: newsgroup comp.lang.python sangat aktif, tetapi tidak semua pengguna Python mengirim ke grup atau bahkan membacanya.

source: Have any significant projects been done in Python?
id: Apakah ada proyek-proyek penting yang dibuat dengan Python?

source: See https://www.python.org/about/success for a list of projects that use Python. Consulting the proceedings for `past Python conferences <https://www.python.org/community/workshops/>`_ will reveal contributions from many different companies and organizations.
id: Lihat https://www.python.org/about/success untuk daftar proyek yang menggunakan Python. Konsultasi proses untuk `konferensi Python masa lalu <https://www.python.org/community/workshops/>`_ akan mengungkapkan kontribusi dari banyak perusahaan dan organisasi yang berbeda.

source: High-profile Python projects include `the Mailman mailing list manager <http://www.list.org>`_ and `the Zope application server <http://www.zope.org>`_. Several Linux distributions, most notably `Red Hat <https://www.redhat.com>`_, have written part or all of their installer and system administration software in Python. Companies that use Python internally include Google, Yahoo, and Lucasfilm Ltd.
id: Profil terkenal proyek Python termasuk `manajer milis Mailman <http://www.list.org>`_ dan `server aplikasi Zope <http://www.zope.org>`_. Beberapa distribusi Linux, terutama `Red Hat <https://www.redhat.com>`_, telah menulis sebagian atau semua installer dan perangkat lunak sistem administrasi mereka dengan Python. Perusahaan yang menggunakan Python secara internal termasuk Google, Yahoo, dan Lucasfilm Ltd.

source: What new developments are expected for Python in the future?
id: Apa pengembangan baru yang diharapkan dari Python di masa depan?

source: See https://www.python.org/dev/peps/ for the Python Enhancement Proposals (PEPs). PEPs are design documents describing a suggested new feature for Python, providing a concise technical specification and a rationale. Look for a PEP titled "Python X.Y Release Schedule", where X.Y is a version that hasn't been publicly released yet.
id: Lihat https://www.python.org/dev/peps/ untuk Python Enchancement Proposal (PEPs). PEP adalah dokumen desain yang menggambarkan fitur baru yang disarankan untuk Python, memberikan spesifikasi teknis yang ringkas dan alasannya. Cari PEP berjudul "Jadwal Rilis Python X.Y", di mana X.Y adalah versi yang belum dirilis secara publik.

source: New development is discussed on `the python-dev mailing list <https://mail.python.org/mailman/listinfo/python-dev/>`_.
id: Pengembangan baru didiskusikan di `milis python-dev <https://mail.python.org/mailman/listinfo/python-dev/>`_.

source: Is it reasonable to propose incompatible changes to Python?
id: Apakah beralasan untuk mengusulkan perubahan yang tidak kompatibel terhadap Python?

source: In general, no. There are already millions of lines of Python code around the world, so any change in the language that invalidates more than a very small fraction of existing programs has to be frowned upon. Even if you can provide a conversion program, there's still the problem of updating all documentation; many books have been written about Python, and we don't want to invalidate them all at a single stroke.
id: Secara umum, tidak. Sudah ada jutaan baris kode Python di seluruh dunia, sehingga setiap perubahan dalam bahasa yang membatalkan lebih dari sebagian kecil dari program yang ada harus dihapuskan. Bahkan jika Anda dapat menyediakan program konversi, masih ada masalah memperbarui semua dokumentasi; banyak buku telah ditulis tentang Python, dan kami tidak ingin membatalkan semuanya dengan satu goresan.

source: Providing a gradual upgrade path is necessary if a feature has to be changed. :pep:`5` describes the procedure followed for introducing backward-incompatible changes while minimizing disruption for users.
id: Diperlukan jalur peningkatan bertahap jika fitur harus diubah. :pep:`5` menjelaskan prosedur yang diikuti untuk memperkenalkan perubahan yang tidak kompatibel ke belakang sambil meminimalkan gangguan bagi pengguna.

source: Is Python a good language for beginning programmers?
id: Apakah Python bahasa yang baik untuk pemrogram pemula?

source: Yes.
id: Ya.

source: It is still common to start students with a procedural and statically typed language such as Pascal, C, or a subset of C++ or Java. Students may be better served by learning Python as their first language. Python has a very simple and consistent syntax and a large standard library and, most importantly, using Python in a beginning programming course lets students concentrate on important programming skills such as problem decomposition and data type design. With Python, students can be quickly introduced to basic concepts such as loops and procedures. They can probably even work with user-defined objects in their very first course.
id: Masih umum untuk memulai siswa belajar dengan bahasa prosedural dan tipe statis seperti Pascal, C, atau subset dari C++ atau Java. Siswa mungkin lebih baik dididik dengan mempelajari Python sebagai bahasa pertama mereka. Python memiliki sintaksis yang sangat sederhana dan konsisten serta pustaka standar yang besar dan, yang paling penting, menggunakan Python dalam kursus pemrograman awal memungkinkan siswa berkonsentrasi pada keterampilan penting pemrograman seperti dekomposisi masalah dan desain tipe data. Dengan Python, siswa dapat dengan cepat diperkenalkan dengan konsep-konsep dasar seperti loop dan prosedur. Mereka bahkan dapat bekerja dengan objek yang ditentukan pengguna dalam kursus pertama mereka.

source: For a student who has never programmed before, using a statically typed language seems unnatural. It presents additional complexity that the student must master and slows the pace of the course. The students are trying to learn to think like a computer, decompose problems, design consistent interfaces, and encapsulate data. While learning to use a statically typed language is important in the long term, it is not necessarily the best topic to address in the students' first programming course.
id: Untuk siswa yang belum pernah memprogram sebelumnya, menggunakan bahasa yang memiliki tipe statis tampaknya tidak wajar atau tidak biasa. Ini menyajikan kompleksitas tambahan bahwa siswa harus menguasai dan memperlambat laju kursus. Para siswa berusaha belajar berpikir seperti komputer, menguraikan masalah, mendesain antarmuka yang konsisten, dan merangkum data. Sementara belajar untuk menggunakan bahasa yang memiliki tipe statis itu penting dalam jangka panjang, itu tidak selalu merupakan topik terbaik untuk dibahas dalam kursus pemrograman pertama siswa.

source: Many other aspects of Python make it a good first language. Like Java, Python has a large standard library so that students can be assigned programming projects very early in the course that *do* something. Assignments aren't restricted to the standard four-function calculator and check balancing programs. By using the standard library, students can gain the satisfaction of working on realistic applications as they learn the fundamentals of programming. Using the standard library also teaches students about code reuse. Third-party modules such as PyGame are also helpful in extending the students' reach.
id: Banyak aspek lain dari Python menjadikannya bahasa pertama yang baik. Seperti Java, Python memiliki pustaka standar yang besar sehingga siswa dapat ditugaskan proyek pemrograman sangat awal dalam kursus yang *do* sesuatu. Tugas tidak terbatas pada kalkulator empat fungsi standar dan periksa program keseimbangan. Dengan menggunakan perpustakaan standar, siswa dapat memperoleh kepuasan bekerja pada aplikasi dunia nyata saat mereka mempelajari dasar-dasar pemrograman. Menggunakan perpustakaan standar juga mengajarkan siswa tentang penggunaan kembali *reuse* kode. Modul pihak ketiga seperti PyGame juga membantu dalam memperluas jangkauan siswa.

source: Python's interactive interpreter enables students to test language features while they're programming. They can keep a window with the interpreter running while they enter their program's source in another window. If they can't remember the methods for a list, they can do something like this::
id: *interpreter* interaktif Python memungkinkan siswa untuk menguji fitur bahasa saat mereka sedang melakukan pemrograman. Mereka dapat menjaga jendela dengan *interpreter* berjalan saat mereka memasukkan sumber program mereka di jendela lain. Jika mereka tidak dapat mengingat metode untuk *list*, mereka dapat melakukan sesuatu seperti ini::

source: With the interpreter, documentation is never far from the student as they are programming.
id: Dengan interpreter, dokumentasi tidak pernah jauh dari pelajar saat mereka melakukan pemrograman.

source: There are also good IDEs for Python. IDLE is a cross-platform IDE for Python that is written in Python using Tkinter. PythonWin is a Windows-specific IDE. Emacs users will be happy to know that there is a very good Python mode for Emacs. All of these programming environments provide syntax highlighting, auto-indenting, and access to the interactive interpreter while coding. Consult `the Python wiki <https://wiki.python.org/moin/PythonEditors>`_ for a full list of Python editing environments.
id: Ada juga IDE yang bagus untuk Python. IDLE adalah IDE lintas-platform untuk Python yang ditulis dalam Python menggunakan Tkinter. PythonWin adalah IDE khusus Windows. Pengguna Emacs akan senang mengetahui bahwa ada mode Python yang sangat bagus untuk Emacs. Semua lingkungan pemrograman ini menyediakan penyorotan sintaksis, indentasi otomatis, dan akses ke interpreter interaktif saat pengkodean. Konsultasikan `wiki Python <https://wiki.python.org/moin/PythonEditors>`_ untuk daftar lengkap lingkungan penyuntingan Python.

source: If you want to discuss Python's use in education, you may be interested in joining `the edu-sig mailing list <https://www.python.org/community/sigs/current/edu-sig>`_.
id: Jika ingin mendiskusikan penggunaan Python di bidang pendidikan, Anda mungkin tertarik untuk bergabung di `milis edu-sig <https://www.python.org/community/sigs/current/edu-sig>`_.
