Repository: python/python-docs-id
Catalog: python-newest.faq--general/*.po
Languages: id

source: General Python FAQ
id: FAQ Umum Python

source: Contents
id: Konten

source: General Information
id: Informasi Umum

source: What is Python?
id: Apa itu Python?

source: Python is an interpreted, interactive, object-oriented programming language. It incorporates modules, exceptions, dynamic typing, very high level dynamic data types, and classes. It supports multiple programming paradigms beyond object-oriented programming, such as procedural and functional programming. Python combines remarkable power with very clear syntax. It has interfaces to many system calls and libraries, as well as to various window systems, and is extensible in C or C++. It is also usable as an extension language for applications that need a programmable interface. Finally, Python is portable: it runs on many Unix variants including Linux and macOS, and on Windows.
id: Python adalah bahasa pemrograman yang diinterpretasi, interaktif, dan berorientasi objek. Itu menggabungkan modul-modul, exception, pengetikan yang dinamis, tipe data dinamis yang bersifat tingkat tinggi, dan kelas-kelas. Python menggabungkan kekuatan yang luar biasa dengan sintaks yang sangat jelas. Memiliki antar muka ke banyak pemanggilan sistem dan pustaka, serta sejumlah sistem di windows, serta dapat diperluas ke dalam bahasa C atau C++. Juga dapat digunakan sebagai bahasa tambahan untuk aplikasi yang membutuhkan antar muka yang dapat diprogram. Terakhir, Python bersifat portabel: berjalan di banyak varian Unix, di Mac, dan pada Windows 2000 dan yang lebih baru

source: To find out more, start with :ref:`tutorial-index`. The `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_ links to other introductory tutorials and resources for learning Python.
id: Untuk mengetahui lebih lanjut, mulai dengan :ref:`tutorial-index`. `Panduan Pemula Python <https://wiki.python.org/moin/BeginnersGuide>`_ tautan ke tutorial pengantar dan sumber lain untuk belajar Python.

source: What is the Python Software Foundation?
id: Apa itu Python Software Foundation?

source: The Python Software Foundation is an independent non-profit organization that holds the copyright on Python versions 2.1 and newer. The PSF's mission is to advance open source technology related to the Python programming language and to publicize the use of Python. The PSF's home page is at https://www.python.org/psf/.
id: The Python Software Foundation adalah organisasi nirlaba independen yang memegang hak cipta pada Python versi 2.1 dan yang lebih baru. Misi PSF adalah untuk memajukan teknologi *open source* yang terkait dengan bahasa pemrograman Python dan untuk mempublikasikan penggunaan Python. Halaman utama PSF ada di https://www.python.org/psf/.

source: Donations to the PSF are tax-exempt in the US. If you use Python and find it helpful, please contribute via `the PSF donation page <https://www.python.org/psf/donations/>`_.
id: Sumbangan untuk PSF bebas pajak di AS. Jika Anda menggunakan Python dan merasa terbantu, silakan berkontribusi melalui `halaman donasi PSF <https://www.python.org/psf/donations/>`_.

source: Are there copyright restrictions on the use of Python?
id: Apakah ada batasan hak cipta atas penggunaan Python?

source: You can do anything you want with the source, as long as you leave the copyrights in and display those copyrights in any documentation about Python that you produce. If you honor the copyright rules, it's OK to use Python for commercial use, to sell copies of Python in source or binary form (modified or unmodified), or to sell products that incorporate Python in some form. We would still like to know about all commercial use of Python, of course.
id: Anda dapat melakukan apa pun yang Anda inginkan dengan sumbernya, selama Anda meninggalkan hak cipta dan menampilkan hak cipta itu dalam dokumentasi apa pun tentang Python yang Anda hasilkan. Jika Anda menghormati aturan hak cipta, boleh saja menggunakan Python untuk penggunaan komersial, menjual salinan Python dalam bentuk sumber atau biner (dimodifikasi atau tidak dimodifikasi), atau untuk menjual produk yang memasukkan Python dalam beberapa bentuk. Kami masih ingin tahu tentang semua penggunaan komersial Python, tentu saja.

source: See `the PSF license page <https://www.python.org/psf/license/>`_ to find further explanations and a link to the full text of the license.
id: Lihat `halaman lisensi PSF <https://www.python.org/psf/license/>`_ untuk tahu lebih lanjut penjelasan dan tautan ke teks lisensi seluruhnya.

source: The Python logo is trademarked, and in certain cases permission is required to use it. Consult `the Trademark Usage Policy <https://www.python.org/psf/trademarks/>`__ for more information.
id: Logo Python terdaftar merek dagang, dan dalam kasus tertentu diperlukan izin untuk menggunakannya. Lihat `Kebijakan Penggunaan Merek Dagang <https://www.python.org/psf/trademarks/>`__ untuk info lebih lanjut.

source: Why was Python created in the first place?
id: Pada mulanya kenapa Python dibuat?

source: Here's a *very* brief summary of what started it all, written by Guido van Rossum:
id: Berikut adalah ringkasan *singkat* dari sejak awal dimulai, ditulis oleh Guido van Rossum:

source: I had extensive experience with implementing an interpreted language in the ABC group at CWI, and from working with this group I had learned a lot about language design. This is the origin of many Python features, including the use of indentation for statement grouping and the inclusion of very-high-level data types (although the details are all different in Python).
id: Saya memiliki pengalaman luas dalam mengimplementasikan bahasa yang ditafsirkan *interpreted* dalam kelompok ABC di CWI, dan dari bekerja dengan kelompok ini saya telah belajar banyak tentang desain bahasa. Ini adalah asal dari banyak fitur Python, termasuk penggunaan indentasi untuk pengelompokan pernyataan dan penyertaan tipe data tingkat-sangat-tinggi (walaupun detailnya semua berbeda dalam Python).

source: I had a number of gripes about the ABC language, but also liked many of its features. It was impossible to extend the ABC language (or its implementation) to remedy my complaints -- in fact its lack of extensibility was one of its biggest problems. I had some experience with using Modula-2+ and talked with the designers of Modula-3 and read the Modula-3 report. Modula-3 is the origin of the syntax and semantics used for exceptions, and some other Python features.
id: Saya memiliki sejumlah keluhan tentang bahasa ABC, tetapi juga menyukai banyak fitur-fiturnya. Tidak mungkin untuk memperluas bahasa ABC (atau implementasinya) untuk memperbaiki keluhan saya -- pada kenyataannya kurangnya ekstensibilitas adalah salah satu masalah terbesarnya. Saya punya pengalaman menggunakan Modula-2+ dan berbicara dengan desainer Modula-3 dan membaca laporan Modula-3. Modula-3 adalah asal dari sintaks dan semantik yang digunakan untuk pengecualian, dan beberapa fitur Python lainnya.

source: I was working in the Amoeba distributed operating system group at CWI. We needed a better way to do system administration than by writing either C programs or Bourne shell scripts, since Amoeba had its own system call interface which wasn't easily accessible from the Bourne shell. My experience with error handling in Amoeba made me acutely aware of the importance of exceptions as a programming language feature.
id: Saya bekerja di grup sistem operasi terdistribusi Amoeba di CWI. Kami membutuhkan cara yang lebih baik untuk melakukan administrasi sistem daripada dengan menulis baik program C atau skrip Bourne *shell*, karena Amuba memiliki antarmuka sistem panggilan sendiri yang tidak mudah diakses dari Bourne *shell*. Pengalaman saya dengan penanganan kesalahan di Amuba membuat saya sangat sadar akan pentingnya pengecualian sebagai fitur bahasa pemrograman.

source: It occurred to me that a scripting language with a syntax like ABC but with access to the Amoeba system calls would fill the need. I realized that it would be foolish to write an Amoeba-specific language, so I decided that I needed a language that was generally extensible.
id: Terpikir oleh saya bahwa bahasa *scripting* dengan sintaksis seperti ABC tetapi dengan akses ke panggilan sistem Amuba akan memenuhi kebutuhan. Saya menyadari bahwa bodoh untuk menulis bahasa khusus Amuba, jadi saya memutuskan bahwa saya membutuhkan bahasa yang pada umumnya dapat diperluas.

source: During the 1989 Christmas holidays, I had a lot of time on my hand, so I decided to give it a try. During the next year, while still mostly working on it in my own time, Python was used in the Amoeba project with increasing success, and the feedback from colleagues made me add many early improvements.
id: Selama liburan Natal 1989, saya punya banyak waktu, jadi saya memutuskan untuk mencobanya. Selama tahun berikutnya, sementara sebagian besar masih mengerjakannya di waktu saya sendiri, Python digunakan dalam proyek Amoeba dengan keberhasilan yang semakin meningkat, dan umpan balik dari kolega membuat saya menambahkan banyak perbaikan awal.

source: In February 1991, after just over a year of development, I decided to post to USENET. The rest is in the ``Misc/HISTORY`` file.
id: Pada Februari 1991, setelah setahun pengembangan, saya memutuskan untuk mengirim ke USENET. Sisanya ada di berkas``Misc/HISTORY``.

source: What is Python good for?
id: Apa gunanya Python?

source: Python is a high-level general-purpose programming language that can be applied to many different classes of problems.
id: Python adalah bahasa pemrograman umum tingkat atas yang dapat diterapkan untuk berbagai jenis permasalahan.

source: The language comes with a large standard library that covers areas such as string processing (regular expressions, Unicode, calculating differences between files), Internet protocols (HTTP, FTP, SMTP, XML-RPC, POP, IMAP, CGI programming), software engineering (unit testing, logging, profiling, parsing Python code), and operating system interfaces (system calls, filesystems, TCP/IP sockets). Look at the table of contents for :ref:`library-index` to get an idea of what's available. A wide variety of third-party extensions are also available. Consult `the Python Package Index <https://pypi.org>`_ to find packages of interest to you.
id: Bahasa ini dilengkapi dengan pustaka standar berukuran besar yang mencakup bidang-bidang seperti pemrosesan string (ekspresi reguler, Unicode, penghitungan perbedaan antara file), protokol Internet (HTTP, FTP, SMTP, XML-RPC, POP, IMAP, pemrograman CGI), rekayasa perangkat lunak (pengujian unit, pencatatan, pembuatan profil, penguraian kode Python), dan antarmuka sistem operasi (panggilan sistem, sistem berkas, soket TCP/IP). Lihatlah daftar isi untuk :ref:`library-index` untuk mendapatkan gambaran tentang apa yang tersedia. Berbagai ekstensi pihak ketiga juga tersedia. Periksa `the Python Package Index <https://pypi.org>`_ untuk menemukan paket yang menarik bagi Anda.

source: How does the Python version numbering scheme work?
id: Bagaimana cara kerja skema penomoran versi Python?

source: Python versions are numbered A.B.C or A.B. A is the major version number -- it is only incremented for really major changes in the language. B is the minor version number, incremented for less earth-shattering changes. C is the micro-level -- it is incremented for each bugfix release. See :pep:`6` for more information about bugfix releases.
id: Versi python diberi nomor A.B.C atau A.B. A adalah nomor versi utama -- hanya bertambah untuk perubahan besar dalam bahasa. B adalah nomor versi minor, ditambahkan untuk mengurangi perubahan yang menggoncang dunia. C adalah level mikro -- ia bertambah untuk setiap rilis bugfix. Lihat :pep:`6` untuk informasi lebih lanjut tentang rilis perbaikan bug.

source: Not all releases are bugfix releases. In the run-up to a new major release, a series of development releases are made, denoted as alpha, beta, or release candidate. Alphas are early releases in which interfaces aren't yet finalized; it's not unexpected to see an interface change between two alpha releases. Betas are more stable, preserving existing interfaces but possibly adding new modules, and release candidates are frozen, making no changes except as needed to fix critical bugs.
id: Tidak semua rilis adalah rilis perbaikan bug. Menjelang rilis besar baru, serangkaian rilis pengembangan dibuat, dilambangkan sebagai alpha, beta, atau kandidat rilis. Alpha adalah rilis awal di mana antarmuka belum difinalisasi; itu tidak terduga untuk melihat perubahan antarmuka antara dua rilis alpha. Beta lebih stabil, menjaga antarmuka yang ada tetapi mungkin menambahkan modul baru, dan rilis kandidat yang dibekukan, tidak membuat perubahan kecuali jika diperlukan untuk memperbaiki bug kritis.

source: Alpha, beta and release candidate versions have an additional suffix. The suffix for an alpha version is "aN" for some small number N, the suffix for a beta version is "bN" for some small number N, and the suffix for a release candidate version is "rcN" for some small number N. In other words, all versions labeled 2.0aN precede the versions labeled 2.0bN, which precede versions labeled 2.0rcN, and *those* precede 2.0.
id: Versi kandidat alfa, beta, dan kandidat rilis memiliki sufiks tambahan. Sufiks untuk versi alfa adalah "aN" untuk beberapa nomor kecil N, sufiks untuk versi beta adalah "bN" untuk beberapa nomor kecil N, dan sufiks untuk versi kandidat rilis adalah "rcN" untuk beberapa nomor kecil N. Dengan kata lain, semua versi berlabel 2.0aN mendahului versi berlabel 2.0bN, yang mendahului versi berlabel 2.0rcN, dan mendahului *yang* 2.0.

source: You may also find version numbers with a "+" suffix, e.g. "2.2+". These are unreleased versions, built directly from the CPython development repository. In practice, after a final minor release is made, the version is incremented to the next minor version, which becomes the "a0" version, e.g. "2.4a0".
id: Anda juga dapat menemukan nomor versi dengan akhiran "+", mis. "2.2+". Ini adalah versi yang belum dirilis, dibangun langsung dari repositori pengembangan CPython. Dalam praktiknya, setelah rilis minor final dibuat, versi tersebut bertambah menjadi versi minor berikutnya, yang menjadi versi "a0", mis. "2.4a0".

source: See also the documentation for :data:`sys.version`, :data:`sys.hexversion`, and :data:`sys.version_info`.
id: Lihat juga dokumentasi untuk :data:`sys.version`, :data:`sys.hexversion`, dan :data:`sys.version_info`.

source: How do I obtain a copy of the Python source?
id: Bagaimana saya mendapatkan salinan kode sumber Python?

source: The latest Python source distribution is always available from python.org, at https://www.python.org/downloads/. The latest development sources can be obtained at https://github.com/python/cpython/.
id: Distribusi kode sumber Python terbaru selalu bisa didapatkan dari python.org, di https://www.python.org/downloads/. Kode sumber pengembangan terbaru bisa didapatkan di https://github.com/python/cpython/.

source: The source distribution is a gzipped tar file containing the complete C source, Sphinx-formatted documentation, Python library modules, example programs, and several useful pieces of freely distributable software. The source will compile and run out of the box on most UNIX platforms.
id: Distribusi sumber adalah file tar gzip yang berisi sumber C lengkap, dokumentasi berformat Sphinx, modul pustaka Python, program contoh, dan beberapa perangkat lunak berguna yang dapat didistribusikan secara bebas. Sumber akan mengkompilasi dan langsung dapat digunakan pada sebagian besar platform UNIX.

source: Consult the `Getting Started section of the Python Developer's Guide <https://devguide.python.org/setup/>`__ for more information on getting the source code and compiling it.
id: Lihat `Bagian Memulai dari Panduan Pengembang Python <https://devguide.python.org/setup/>`__ untuk informasi lebih lanjut tentang mendapatkan kode sumber dan melakukan kompilasi.

source: How do I get documentation on Python?
id: Bagaimana saya mendapatkan dokumentasi tentang Python?

source: The standard documentation for the current stable version of Python is available at https://docs.python.org/3/. PDF, plain text, and downloadable HTML versions are also available at https://docs.python.org/3/download.html.
id: Dokumentasi standar untuk Python versi stabil saat ini tersedia di https://docs.python.org/3/. PDF, teks biasa, dan versi HTML yang dapat diunduh juga tersedia di https://docs.python.org/3/download.html.

source: The documentation is written in reStructuredText and processed by `the Sphinx documentation tool <http://sphinx-doc.org/>`__. The reStructuredText source for the documentation is part of the Python source distribution.
id: Dokumentasi ditulis dalam reStructuredText dan diproses dengan `Alat dokumentasi Sphinx <http://sphinx-doc.org/>`__. Sumber reStructuredText untuk dokumentasi merupakan bagian dari distribusi kode sumber Python.

source: I've never programmed before. Is there a Python tutorial?
id: Saya belum pernah memrogram sebelumnya. Apakah ada tutorial tentang Python?

source: There are numerous tutorials and books available. The standard documentation includes :ref:`tutorial-index`.
id: Ada sejumlah tutorial dan buku yang tersedia. Dokumentasi standar menyertakan :ref:`tutorial-index`.

source: Consult `the Beginner's Guide <https://wiki.python.org/moin/BeginnersGuide>`_ to find information for beginning Python programmers, including lists of tutorials.
id: Lihat `Panduan Memulai <https://wiki.python.org/moin/BeginnersGuide>`_ untuk menemukan informasi tentang menjadi pemrogram Python pemula, termasuk daftar tutorial.

source: Is there a newsgroup or mailing list devoted to Python?
id: Apakah ada newsgroup atau milis yang ditujukan untuk Python?

source: There is a newsgroup, :newsgroup:`comp.lang.python`, and a mailing list, `python-list <https://mail.python.org/mailman/listinfo/python-list>`_. The newsgroup and mailing list are gatewayed into each other -- if you can read news it's unnecessary to subscribe to the mailing list. :newsgroup:`comp.lang.python` is high-traffic, receiving hundreds of postings every day, and Usenet readers are often more able to cope with this volume.
id: Ada newsgroup, :newsgroup:`comp.lang.python`, dan milis, `python-list <https://mail.python.org/mailman/listinfo/python-list>`_. Newsgroup dan milis saling berhubungan satu sama lain -- jika Anda dapat membaca berita, tidak perlu berlangganan ke milis. :newsgroup:`comp.lang.python` memiliki lalu lintas tinggi, menerima ratusan posting setiap hari, dan pembaca Usenet seringkali lebih mampu mengatasi volume ini.

source: Announcements of new software releases and events can be found in comp.lang.python.announce, a low-traffic moderated list that receives about five postings per day. It's available as `the python-announce mailing list <https://mail.python.org/mailman/listinfo/python-announce-list>`_.
id: Pengumuman tentang rilis perangkat lunak dan acara baru dapat ditemukan di comp.lang.python.announce, daftar yang moderasi dengan lalu lintas rendah dimana menerima sekitar lima posting per hari. Ini tersedia sebagai `the python-announce mailing list <https://mail.python.org/mailman/listinfo/python-announce-list>`_.

source: More info about other mailing lists and newsgroups can be found at https://www.python.org/community/lists/.
id: Info lebih lanjut tentang milis dan newsgroup lainnya dapat ditemukan di https://www.python.org/community/lists/.

source: How do I get a beta test version of Python?
id: Bagaimana saya mendapatkan versi uji beta dari Python?

source: Alpha and beta releases are available from https://www.python.org/downloads/. All releases are announced on the comp.lang.python and comp.lang.python.announce newsgroups and on the Python home page at https://www.python.org/; an RSS feed of news is available.
id: Rilis alfa dan beta tersedia dari https://www.python.org/downloads/. Semua rilis diumumkan melalui newsgroup comp.lang.python dan comp.lang.python.announce dan di halaman utama Python di https://www.python.org/; tersedia juga umpan RSS dari berita.

source: You can also access the development version of Python through Git. See `The Python Developer's Guide <https://devguide.python.org/>`_ for details.
id: Anda juga dapat mengakses versi pengembangan dari Python melalui Git. Lihat `Panduan Pengembang Python <https://devguide.python.org/>`_ untuk lebih jelasnya.

source: How do I submit bug reports and patches for Python?
id: Bagaimana saya mengirimkan laporan bug dan patch untuk Python?

source: To report a bug or submit a patch, please use the Roundup installation at https://bugs.python.org/.
id: Untuk melaporkan bug atau mengirimkan patch, silakan gunakan instalasi Roundup di https://bugs.python.org/.

source: You must have a Roundup account to report bugs; this makes it possible for us to contact you if we have follow-up questions. It will also enable Roundup to send you updates as we act on your bug. If you had previously used SourceForge to report bugs to Python, you can obtain your Roundup password through Roundup's `password reset procedure <https://bugs.python.org/user?@template=forgotten>`_.
id: Anda harus memiliki akun Roundup untuk melaporkan bug; ini memungkinkan kami untuk menghubungi Anda jika kami memiliki pertanyaan tindak lanjut. Ini juga akan memungkinkan Roundup untuk mengirimi Anda pembaruan saat kami bertindak atas bug Anda. Jika sebelumnya Anda menggunakan SourceForge untuk melaporkan bug ke Python, Anda dapat memperoleh kata sandi Roundup Anda melalui `password reset procedure <https://bugs.python.org/user?@template=forgotten>`_ dari Roundup.

source: For more information on how Python is developed, consult `the Python Developer's Guide <https://devguide.python.org/>`_.
id: Untuk informasi lebih lanjut mengenai bagaimana Python dikembangkan, lihat `Panduan Pengembang Python <https://devguide.python.org/>`_.

source: Are there any published articles about Python that I can reference?
id: Apakah ada publikasi artikel tentang Python yang bisa saya gunakan sebagai referensi?

source: It's probably best to cite your favorite book about Python.
id: Mungkin sebaiknya mengutip buku favorit Anda tentang Python.

source: The very first article about Python was written in 1991 and is now quite outdated.
id: Artikel pertama tentang Python ditulis tahun 1991 dan sekarang sudah cukup usang.

source: Guido van Rossum and Jelke de Boer, "Interactively Testing Remote Servers Using the Python Programming Language", CWI Quarterly, Volume 4, Issue 4 (December 1991), Amsterdam, pp 283--303.
id: Guido van Rossum dan Jelke de Boer, "Interactively Testing Remote Servers Using the Python Programming Language", CWI Quarterly, Volume 4, Issue 4 (December 1991), Amsterdam, pp 283--303.

source: Are there any books on Python?
id: Apakah ada buku-buku tentang Python?

source: Yes, there are many, and more are being published. See the python.org wiki at https://wiki.python.org/moin/PythonBooks for a list.
id: Ya, ada banyak, dan banyak juga yang sedang diterbitkan. Untuk daftarnya lihat wiki python.org di https://wiki.python.org/moin/PythonBooks .

source: You can also search online bookstores for "Python" and filter out the Monty Python references; or perhaps search for "Python" and "language".
id: Anda juga dapat mencari "Python" di toko buku online dan menyaring referensi Monty Python; atau mungkin cari "Python" dan "bahasa".

source: Where in the world is www.python.org located?
id: Dimana di dunia lokasi www.python.org?
