Repository: python/python-docs-id
Catalog: python-newest.tutorial--introduction/*.po
Languages: id

source: An Informal Introduction to Python
id: Pengantar Informal Tentang Python

source: In the following examples, input and output are distinguished by the presence or absence of prompts (:term:`>>>` and :term:`...`): to repeat the example, you must type everything after the prompt, when the prompt appears; lines that do not begin with a prompt are output from the interpreter. Note that a secondary prompt on a line by itself in an example means you must type a blank line; this is used to end a multi-line command.
id: Dalam contoh berikut, masukan dan keluaran dibedakan dengan ada atau tidaknya prompt (:term:`>>>` dan :term:`...`): untuk mengulangi contoh, Anda harus mengetikkan semuanya setelah prompt, saat prompt muncul; baris yang tidak dimulai dengan prompt adalah output dari interpreter. Perhatikan bahwa baris yang hanya berisi prompt sekunder dalam contoh berarti Anda harus mengetikkan baris kosong; ini digunakan untuk mengakhiri perintah multi-baris.

source: Many of the examples in this manual, even those entered at the interactive prompt, include comments. Comments in Python start with the hash character, ``#``, and extend to the end of the physical line. A comment may appear at the start of a line or following whitespace or code, but not within a string literal. A hash character within a string literal is just a hash character. Since comments are to clarify code and are not interpreted by Python, they may be omitted when typing in examples.
id: Banyak contoh dalam manual ini, bahkan yang dimasukkan pada prompt interaktif, termasuk komentar. Komentar dalam Python dimulai dengan karakter hash, ``#``, dan diperluas hingga akhir garis fisik. Sebuah komentar dapat muncul di awal baris atau mengikuti spasi atau kode, tetapi tidak dalam string literal. Karakter hash dalam string literal hanyalah karakter hash. Karena komentar adalah untuk mengklarifikasi kode dan tidak ditafsirkan oleh Python, mereka dapat dihilangkan saat mengetikkan contoh.

source: Some examples::
id: Beberapa contoh::

source: Using Python as a Calculator
id: Menggunakan Python sebagai Kalkulator

source: Let's try some simple Python commands. Start the interpreter and wait for the primary prompt, ``>>>``. (It shouldn't take long.)
id: Mari kita coba beberapa perintah Python sederhana. Mulai interpreter dan tunggu prompt utama, ``>>>``. (Seharusnya tidak butuh waktu lama.)

source: Numbers
id: Angka

source: The interpreter acts as a simple calculator: you can type an expression at it and it will write the value. Expression syntax is straightforward: the operators ``+``, ``-``, ``*`` and ``/`` work just like in most other languages (for example, Pascal or C); parentheses (``()``) can be used for grouping. For example::
id: Interpreter bertindak sebagai kalkulator sederhana: Anda dapat mengetikkan ekspresi padanya dan itu akan menulis nilainya. Sintaksis ekspresi mudah: operator ``+``, ``-``, ``*`` dan ``/`` berfungsi seperti di sebagian besar bahasa lain (misalnya, Pascal atau C); tanda kurung (``()``) dapat digunakan untuk pengelompokan. Sebagai contoh::

source: The integer numbers (e.g. ``2``, ``4``, ``20``) have type :class:`int`, the ones with a fractional part (e.g. ``5.0``, ``1.6``) have type :class:`float`. We will see more about numeric types later in the tutorial.
id: Bilangan bulat (mis. ``2``, ``4``, ``20``) memiliki tipe :class:`int`, yang memiliki bagian pecahan (mis.``5.0``,``1.6``) memiliki tipe :class:`float`. Kita akan melihat lebih banyak tentang tipe bilangan nanti dalam tutorial.

source: Division (``/``) always returns a float. To do :term:`floor division` and get an integer result (discarding any fractional result) you can use the ``//`` operator; to calculate the remainder you can use ``%``::
id: Division (``/``) selalu mengembalikan float atau bilangan pecahan. Untuk melakukan :term:`floor division` dan mendapatkan hasil integer atau bilangan bulat (menghilangkan hasil pecahannya) Anda dapat menggunakan operator ``//``; untuk menghitung sisanya Anda dapat menggunakan ``%``::

source: With Python, it is possible to use the ``**`` operator to calculate powers [#]_::
id: Dengan Python, dimungkinkan untuk menggunakan operator ``**`` untuk menghitung pemangkatan [#]_::

source: The equal sign (``=``) is used to assign a value to a variable. Afterwards, no result is displayed before the next interactive prompt::
id: Tanda sama dengan (``=``) digunakan untuk memberikan nilai ke variabel. Setelah itu, tidak ada hasil yang ditampilkan sebelum prompt interaktif berikutnya::

source: If a variable is not "defined" (assigned a value), trying to use it will give you an error::
id: Jika variabel tidak "didefinisikan" (diberi nilai), mencoba menggunakannya akan menghasilkan kesalahan::

source: There is full support for floating point; operators with mixed type operands convert the integer operand to floating point::
id: Ada dukungan penuh untuk floating point; operator dengan operan tipe campuran akan mengubah operan integer ke floating point::

source: In interactive mode, the last printed expression is assigned to the variable ``_``. This means that when you are using Python as a desk calculator, it is somewhat easier to continue calculations, for example::
id: Dalam mode interaktif, ekspresi cetak terakhir diberikan ke variabel ``_``. Ini berarti bahwa ketika Anda menggunakan Python sebagai kalkulator meja, agak lebih mudah untuk melanjutkan perhitungan, misalnya::

source: This variable should be treated as read-only by the user. Don't explicitly assign a value to it --- you would create an independent local variable with the same name masking the built-in variable with its magic behavior.
id: Variabel ini harus diperlakukan sebagai baca-saja oleh pengguna. Jangan secara eksplisit memberikan nilai padanya --- Anda akan membuat variabel lokal independen dengan nama yang sama menutupi variabel bawaan dengan perilaku saktinya.

source: In addition to :class:`int` and :class:`float`, Python supports other types of numbers, such as :class:`~decimal.Decimal` and :class:`~fractions.Fraction`. Python also has built-in support for :ref:`complex numbers <typesnumeric>`, and uses the ``j`` or ``J`` suffix to indicate the imaginary part (e.g. ``3+5j``).
id: Selain :class:`int` dan :class:` float`, Python mendukung tipe angka lainnya, seperti :class:`~decimal.Decimal` dan :class:`~fractions.Fraction`. Python juga memiliki dukungan bawaan untuk :ref:`complex numbers <typesnumeric>`, dan menggunakan akhiran ``j`` atau ``J`` untuk menunjukkan bagian imajiner (mis. ``3+5j``).

source: Strings
id: String

source: Besides numbers, Python can also manipulate strings, which can be expressed in several ways. They can be enclosed in single quotes (``'...'``) or double quotes (``"..."``) with the same result [#]_. ``\`` can be used to escape quotes::
id: Selain angka, Python juga dapat memanipulasi string atau teks, yang dapat diekspresikan dalam beberapa cara. Mereka dapat disertakan dalam tanda kutip tunggal (``'...'``) atau tanda kutip ganda (``"..."``) dengan hasil yang sama [#]_. ``\`` dapat digunakan untuk keluar dari kutipan::

source: In the interactive interpreter, the output string is enclosed in quotes and special characters are escaped with backslashes. While this might sometimes look different from the input (the enclosing quotes could change), the two strings are equivalent. The string is enclosed in double quotes if the string contains a single quote and no double quotes, otherwise it is enclosed in single quotes. The :func:`print` function produces a more readable output, by omitting the enclosing quotes and by printing escaped and special characters::
id: Dalam interpreter interaktif, string keluaran diapit dengan tanda kutip dan karakter khusus dipisahkan dengan garis miring terbalik. Meskipun ini kadang-kadang terlihat berbeda dari input (tanda kutip terlampir dapat berubah), kedua string tersebut setara. String disertakan dalam tanda kutip ganda jika string berisi kutipan tunggal dan tidak ada tanda kutip ganda, jika tidak maka akan dilampirkan dalam tanda kutip tunggal. Fungsi :func:`print` menghasilkan keluaran yang lebih mudah dibaca, dengan menghilangkan tanda kutip terlampir dan dengan mencetak karakter yang dipisahkan dan spesial::

source: If you don't want characters prefaced by ``\`` to be interpreted as special characters, you can use *raw strings* by adding an ``r`` before the first quote::
id: Jika Anda tidak ingin karakter yang diawali dengan ``\`` ditafsirkan sebagai karakter khusus, Anda dapat menggunakan *raw strings* dengan menambahkan ``r`` sebelum kutipan pertama::

source: String literals can span multiple lines. One way is using triple-quotes: ``"""..."""`` or ``'''...'''``. End of lines are automatically included in the string, but it's possible to prevent this by adding a ``\`` at the end of the line. The following example::
id: String literal dapat melebar hingga beberapa baris. Salah satu caranya adalah dengan menggunakan tanda kutip tiga: ``"""..."""`` atau ``'''...'''``. Akhir baris secara otomatis termasuk dalam string, tetapi dimungkinkan untuk mencegahnya dengan menambahkan ``\`` di akhir baris. Contoh berikut::

source: produces the following output (note that the initial newline is not included):
id: menghasilkan keluaran berikut (perhatikan bahwa awal baris baru tidak termasuk):

source: Strings can be concatenated (glued together) with the ``+`` operator, and repeated with ``*``::
id: String dapat digabungkan (direkatkan) dengan operator ``+``, dan diulangi dengan ``*``::

source: Two or more *string literals* (i.e. the ones enclosed between quotes) next to each other are automatically concatenated. ::
id: Dua atau lebih *string literals* (yaitu yang terlampir di antara tanda kutip) di sebelah satu sama lain secara otomatis digabungkan. ::

source: This feature is particularly useful when you want to break long strings::
id: Fitur ini sangat berguna ketika Anda ingin memecah string panjang::

source: This only works with two literals though, not with variables or expressions::
id: Ini hanya bekerja dengan dua literal, tidak dengan variabel atau ekspresi::

source: If you want to concatenate variables or a variable and a literal, use ``+``::
id: Jika Anda ingin menggabungkan variabel atau variabel dan literal, gunakan ``+``::

source: Strings can be *indexed* (subscripted), with the first character having index 0. There is no separate character type; a character is simply a string of size one::
id: String dapat diindeks atau *indexed* (disandikan), dengan karakter pertama memiliki indeks 0. Tidak ada tipe karakter yang terpisah; sebuah karakter hanyalah sebuah string berukuran satu::

source: Indices may also be negative numbers, to start counting from the right::
id: Indeks juga bisa berupa angka negatif, untuk mulai menghitung dari kanan::

source: Note that since -0 is the same as 0, negative indices start from -1.
id: Perhatikan bahwa karena -0 sama dengan 0, indeks negatif mulai dari -1.

source: In addition to indexing, *slicing* is also supported. While indexing is used to obtain individual characters, *slicing* allows you to obtain substring::
id: Selain pengindeksan, *slicing* atau mengiris juga didukung. Sementara pengindeksan digunakan untuk mendapatkan karakter individual, *slicing* memungkinkan Anda untuk mendapatkan substring::

source: Note how the start is always included, and the end always excluded. This makes sure that ``s[:i] + s[i:]`` is always equal to ``s``::
id: Perhatikan bagaimana awal selalu disertakan, dan akhirnya selalu dikecualikan. Ini memastikan bahwa ``s[:i] + s[i:]`` selalu sama dengan ``s``::

source: Slice indices have useful defaults; an omitted first index defaults to zero, an omitted second index defaults to the size of the string being sliced. ::
id: Indeks irisan memiliki nilai bawaan yang berguna; indeks pertama yang hilang akan digantikan ke nilai nol, indeks kedua yang hilang akan digantikan ke nilai ukuran atau panjang string yang diiris. ::

source: One way to remember how slices work is to think of the indices as pointing *between* characters, with the left edge of the first character numbered 0. Then the right edge of the last character of a string of *n* characters has index *n*, for example::
id: Salah satu cara untuk mengingat bagaimana irisan bekerja adalah dengan menganggap indeks sebagai menunjuk *between* karakter, dengan tepi kiri karakter pertama bernomor 0. Kemudian tepi kanan karakter terakhir dari string *n* karakter memiliki indeks *n*, misalnya::

source: The first row of numbers gives the position of the indices 0...6 in the string; the second row gives the corresponding negative indices. The slice from *i* to *j* consists of all characters between the edges labeled *i* and *j*, respectively.
id: Baris pertama angka memberikan posisi indeks 0...6 dalam string; baris kedua memberikan indeks negatif yang sesuai. Irisan dari *i* ke *j* terdiri dari semua karakter di antara kedua sisi yang berlabel *i* dan *j*.

source: For non-negative indices, the length of a slice is the difference of the indices, if both are within bounds. For example, the length of ``word[1:3]`` is 2.
id: Untuk indeks non-negatif, panjang irisan adalah selisih indeks, jika keduanya berada dalam batas. Misalnya, panjang ``word[1:3]`` adalah 2.

source: Attempting to use an index that is too large will result in an error::
id: Mencoba menggunakan indeks yang terlalu besar akan menghasilkan kesalahan::

source: However, out of range slice indexes are handled gracefully when used for slicing::
id: Namun, indeks irisan di luar jangkauan ditangani dengan anggun ketika digunakan untuk mengiris::

source: Python strings cannot be changed --- they are :term:`immutable`. Therefore, assigning to an indexed position in the string results in an error::
id: String python tidak dapat diubah --- mereka adalah :term:`immutable`. Oleh karena itu, menetapkan ke suatu indeks posisi dalam string menghasilkan kesalahan::

source: If you need a different string, you should create a new one::
id: Jika Anda membutuhkan string yang berbeda, Anda harus membuat yang baru::

source: The built-in function :func:`len` returns the length of a string::
id: Fungsi bawaan :func:`len` mengembalikan panjang string::

source: Strings are examples of *sequence types*, and support the common operations supported by such types.
id: String adalah contoh *sequence types* atau jenis urutan, dan mendukung operasi umum yang didukung oleh jenis tersebut.

source: Strings support a large number of methods for basic transformations and searching.
id: String mendukung sejumlah besar metode untuk transformasi dasar dan pencarian.

source: String literals that have embedded expressions.
id: String literal yang memiliki ekspresi yang tersemat.

source: Information about string formatting with :meth:`str.format`.
id: Informasi tentang pemformatan string dengan :meth:`str.format`.

source: The old formatting operations invoked when strings are the left operand of the ``%`` operator are described in more detail here.
id: Operasi pemformatan lama dipanggil ketika string adalah operan kiri dari operator ``%`` dijelaskan secara lebih rinci di sini.

source: Lists
id: List

source: Python knows a number of *compound* data types, used to group together other values. The most versatile is the *list*, which can be written as a list of comma-separated values (items) between square brackets. Lists might contain items of different types, but usually the items all have the same type. ::
id: Python mengetahui sejumlah tipe data *compound* atau gabungan, yang digunakan untuk mengelompokkan nilai-nilai lainnya. Yang paling serbaguna adalah *list*, yang dapat ditulis sebagai daftar nilai yang dipisahkan koma (*items*) antara tanda kurung siku. *List* atau daftar mungkin berisi *items* dari tipe yang berbeda, tetapi biasanya semua *items* memiliki tipe yang sama. ::

source: Like strings (and all other built-in :term:`sequence` types), lists can be indexed and sliced::
id: Seperti string (dan semua bawaan lainnya tipe :term:`sequence`), list atau daftar tersebut dapat diindeks dan diiris::

source: All slice operations return a new list containing the requested elements. This means that the following slice returns a :ref:`shallow copy <shallow_vs_deep_copy>` of the list::
id: Semua operasi iris mengembalikan list atau daftar baru yang berisi elemen yang diminta. Ini berarti bahwa irisan berikut mengembalikan :ref:`shallow copy <shallow_vs_deep_copy>` dari list::

source: Lists also support operations like concatenation::
id: List atau daftar juga mendukung operasi seperti perangkaian::

source: Unlike strings, which are :term:`immutable`, lists are a :term:`mutable` type, i.e. it is possible to change their content::
id: Tidak seperti string, yang :term:`immutable`, list adalah :term:`mutable`, mis. dimungkinkan untuk mengubah kontennya::

source: You can also add new items at the end of the list, by using the :meth:`~list.append` *method* (we will see more about methods later)::
id: Anda juga dapat menambahkan *items* baru di akhir list, dengan menggunakan *method* :meth:`~list.append` (kita akan melihat lebih banyak tentang metode nanti)::

source: Assignment to slices is also possible, and this can even change the size of the list or clear it entirely::
id: Pemberian nilai untuk irisan juga dimungkinkan, dan ini bahkan dapat mengubah ukuran list atau menghapus seluruhnya::

source: The built-in function :func:`len` also applies to lists::
id: Fungsi bawaan :func:`len` juga berlaku untuk list::

source: It is possible to nest lists (create lists containing other lists), for example::
id: Dimungkinkan untuk membuat list atau daftar bersarang (membuat daftar yang berisi daftar lain), misalnya::

source: First Steps Towards Programming
id: Langkah Awal Menuju Pemrograman

source: Of course, we can use Python for more complicated tasks than adding two and two together. For instance, we can write an initial sub-sequence of the `Fibonacci series <https://en.wikipedia.org/wiki/Fibonacci_number>`_ as follows::
id: Tentu saja, kita bisa menggunakan Python untuk tugas yang lebih rumit daripada menambahkan dua dan dua bersamaan. Sebagai contoh, kita dapat menulis awal dari sub-urutan `Fibonacci series <https://en.wikipedia.org/wiki/Fibonacci_number>`_ sebagai berikut::

source: This example introduces several new features.
id: Contoh ini memperkenalkan beberapa fitur baru.

source: The first line contains a *multiple assignment*: the variables ``a`` and ``b`` simultaneously get the new values 0 and 1. On the last line this is used again, demonstrating that the expressions on the right-hand side are all evaluated first before any of the assignments take place. The right-hand side expressions are evaluated from the left to the right.
id: Baris pertama berisi *multiple assignment*: variabel ``a`` dan ``b`` secara bersamaan mendapatkan nilai-nilai baru 0 dan 1. Pada baris terakhir ini digunakan lagi, menunjukkan bahwa ekspresi di sisi sebelah kanan, semua dievaluasi terlebih dahulu sebelum salah satu pemberian nilai berlangsung. Ekspresi sisi kanan dievaluasi dari kiri ke kanan.

source: The :keyword:`while` loop executes as long as the condition (here: ``a < 10``) remains true. In Python, like in C, any non-zero integer value is true; zero is false. The condition may also be a string or list value, in fact any sequence; anything with a non-zero length is true, empty sequences are false. The test used in the example is a simple comparison. The standard comparison operators are written the same as in C: ``<`` (less than), ``>`` (greater than), ``==`` (equal to), ``<=`` (less than or equal to), ``>=`` (greater than or equal to) and ``!=`` (not equal to).
id: Perulangan :keyword:`while` dieksekusi selama kondisi (di sini: ``a < 10``) masih benar. Dalam Python, seperti dalam C, nilai integer bukan nol bernilai benar; nol itu bernilai salah. Kondisi ini juga bisa berupa nilai string atau daftar, sebenarnya urutan apa pun; apapun dengan panjang yang tidak nol bernilai benar, urutan kosong bernilai salah. Tes yang digunakan dalam contoh adalah perbandingan sederhana. Operator perbandingan standar ditulis sama seperti dalam C: ``<`` (kurang dari), ``>`` (lebih besar dari), ``==`` (sama dengan), ``<=`` ( kurang dari atau sama dengan), ``>=`` (lebih besar atau sama dengan) dan ``!=`` (tidak sama dengan).

source: The *body* of the loop is *indented*: indentation is Python's way of grouping statements. At the interactive prompt, you have to type a tab or space(s) for each indented line. In practice you will prepare more complicated input for Python with a text editor; all decent text editors have an auto-indent facility. When a compound statement is entered interactively, it must be followed by a blank line to indicate completion (since the parser cannot guess when you have typed the last line). Note that each line within a basic block must be indented by the same amount.
id: *body* dari pengulangan adalah *indentasi*: indentasi adalah cara Python untuk pengelompokan pernyataan. Pada prompt interaktif, Anda harus mengetikkan tab atau spasi(-spasi) untuk setiap baris yang diberikan indentasi. Dalam praktiknya Anda akan menyiapkan masukan yang lebih rumit untuk Python dengan editor teks; semua editor teks yang baik memiliki fasilitas indentasi otomatis. Ketika pernyataan majemuk dimasukkan secara interaktif, harus diikuti oleh baris kosong untuk menunjukkan penyelesaian (karena pengurai tidak dapat menebak kapan Anda mengetik baris terakhir). Perhatikan bahwa setiap baris dalam blok dasar harus diindentasi dengan jumlah yang sama.

source: The :func:`print` function writes the value of the argument(s) it is given. It differs from just writing the expression you want to write (as we did earlier in the calculator examples) in the way it handles multiple arguments, floating point quantities, and strings. Strings are printed without quotes, and a space is inserted between items, so you can format things nicely, like this::
id: Fungsi :func:`print` menulis nilai argumen(-argumen) yang diberikan. Ini berbeda dari hanya menulis ekspresi yang ingin Anda tulis (seperti yang kami lakukan sebelumnya dalam contoh kalkulator) dalam cara menangani beberapa argumen, jumlah floating point, dan string. String dicetak tanpa tanda kutip, dan spasi dimasukkan di antara *items*, sehingga Anda dapat memformat sesuatu dengan baik, seperti ini::

source: The keyword argument *end* can be used to avoid the newline after the output, or end the output with a different string::
id: Argumen kata kunci *end* dapat digunakan untuk menghindari baris baru setelah keluaran, atau mengakhiri keluaran dengan string yang berbeda::

source: Footnotes
id: Catatan kaki

source: Since ``**`` has higher precedence than ``-``, ``-3**2`` will be interpreted as ``-(3**2)`` and thus result in ``-9``. To avoid this and get ``9``, you can use ``(-3)**2``.
id: Karena ``**`` memiliki prioritas lebih tinggi dari ``-``, ``-3**2`` akan ditafsirkan sebagai ``-(3**2)`` dan karenanya menghasilkan ``-9``. Untuk menghindari ini dan mendapatkan ``9``, Anda dapat menggunakan ``(-3)**2``.

source: Unlike other languages, special characters such as ``\n`` have the same meaning with both single (``'...'``) and double (``"..."``) quotes. The only difference between the two is that within single quotes you don't need to escape ``"`` (but you have to escape ``\'``) and vice versa.
id: Tidak seperti bahasa lain, karakter khusus seperti ``\n`` memiliki arti yang sama dengan kedua tanda kutip tunggal (``'...'``) dan ganda (``"..."``). Satu-satunya perbedaan antara keduanya adalah bahwa dalam tanda kutip tunggal Anda tidak perlu memisahkan ``"`` (tetapi Anda harus memisahkan ``\'``) dan sebaliknya.
