Repository: python/python-docs-id
Catalog: python-newest.library--tabnanny/*.po
Languages: id

source: :mod:`tabnanny` --- Detection of ambiguous indentation
id: mod:`tabnanny` --- Deteksi indentasi ambigu

source: **Source code:** :source:`Lib/tabnanny.py`
id: **Kode sumber:** :source:`Lib/tabnanny.py`

source: For the time being this module is intended to be called as a script. However it is possible to import it into an IDE and use the function :func:`check` described below.
id: Untuk saat ini modul ini dimaksudkan untuk disebut sebagai script. Namun memungkinkan untuk mengimpornya ke IDE dan menggunakan fungsi :func:`check` yang dijelaskan di bawah ini.

source: The API provided by this module is likely to change in future releases; such changes may not be backward compatible.
id: API yang disediakan oleh modul ini kemungkinan besar akan berubah dalam rilis mendatang; perubahan tersebut mungkin tidak kompatibel dengan versi sebelumnya.

source: If *file_or_dir* is a directory and not a symbolic link, then recursively descend the directory tree named by *file_or_dir*, checking all :file:`.py` files along the way. If *file_or_dir* is an ordinary Python source file, it is checked for whitespace related problems. The diagnostic messages are written to standard output using the :func:`print` function.
id: Jika *file_or_dir* adalah direktori dan bukan tautan simbolis, maka secara rekursif turun pohon direktori yang dinamai oleh *file_or_dir*, memeriksa semua file :file:`.py` di sepanjang jalan. Jika *file_or_dir* adalah file sumber Python biasa, akan diperiksa untuk masalah terkait spasi. Pesan diagnostik ditulis ke keluaran standar menggunakan fungsi :func:`print`.

source: Flag indicating whether to print verbose messages. This is incremented by the ``-v`` option if called as a script.
id: Penanda yang menunjukkan apakah akan mencetak pesan verbose. Ini bertambah dengan opsi ``-v`` jika dipanggil sebagai skrip.

source: Flag indicating whether to print only the filenames of files containing whitespace related problems. This is set to true by the ``-q`` option if called as a script.
id: Penanda yang menunjukkan apakah akan mencetak hanya nama file dari file yang berisi masalah terkait spasi. Ini disetel ke true oleh opsi ``-q`` jika dipanggil sebagai skrip.

source: Raised by :func:`process_tokens` if detecting an ambiguous indent. Captured and handled in :func:`check`.
id: Dibesarkan oleh :func:`process_tokens` jika mendeteksi indentasi yang ambigu. Diambil dan ditangani di :func:`check`.

source: This function is used by :func:`check` to process tokens generated by the :mod:`tokenize` module.
id: Fungsi ini digunakan oleh :func:`check` untuk memproses token yang dibuat oleh modul :mod:`tokenize`.

source: Module :mod:`tokenize`
id: Modul :mod:`tokenize`

source: Lexical scanner for Python source code.
id: Pemindai leksikal untuk kode sumber Python.
