Repository: python/python-docs-id
Catalog: c-api/cell.po
Languages: id

source: Cell Objects
id: Objek Sel, *Cell*

source: "Cell" objects are used to implement variables referenced by multiple scopes. For each such variable, a cell object is created to store the value; the local variables of each stack frame that references the value contains a reference to the cells from outer scopes which also use that variable. When the value is accessed, the value contained in the cell is used instead of the cell object itself. This de-referencing of the cell object requires support from the generated byte-code; these are not automatically de-referenced when accessed. Cell objects are not likely to be useful elsewhere.
id: Objek-objek "Cell" digunakan untuk mengimplementasi variabel-variabel yang direferensikan oleh beberapa *scopes*. Untuk variable seperti itu, sebuah objek *cell* dibuat untuk menyimpan nilai; variabel lokal dari setiap kerangka *stack* yang mereferensikan nilai yang memiliki referensi ke *cells* dari *scopes* luar yang juga menggunakan variabel tersebut. Ketika nilai diakses, nilai yang dimiliki *cell* digunakan alih-alih objek *cell* itu sendiri. *De-referencing* dari objek *cell* ini membutuhkan dukungan dari kode *byte* yang dihasilkan; bagian ini tidak secara otomatis mengalami *de-referenced* ketika diakses. Objek-objek *Cell* sepertinya tidak akan berguna di tempat lain.

source: The C structure used for cell objects.
id: Struktur C digunakan untuk objek sel.

source: The type object corresponding to cell objects.
id: Tipe objek yang sesuai dengan objek sel.

source: Return true if *ob* is a cell object; *ob* must not be ``NULL``.
id: Mengembalikan *True* jika *ob* merupakan objek *cell*; *ob* tidak boleh ``NULL``.

source: Create and return a new cell object containing the value *ob*. The parameter may be ``NULL``.
id: Membuat dan mengembalikan objek *cell* baru yang memiliki nilai *ob*. Parameter dibolehkan ``NULL``.

source: Return the contents of the cell *cell*.
id: Kembalikan isi sel *cell*.

source: Return the contents of the cell *cell*, but without checking that *cell* is non-``NULL`` and a cell object.
id: Kembalikan isi dari sel *cell*, tanpa mengecek jika *cell* merupakan *non-*``NULL`` dan sebuah objek *cell.

source: Set the contents of the cell object *cell* to *value*. This releases the reference to any current content of the cell. *value* may be ``NULL``. *cell* must be non-``NULL``; if it is not a cell object, ``-1`` will be returned. On success, ``0`` will be returned.
id: Mengatur konten dari objek sel *cell* ke *value*. Ini akan menghasilkan referensi ke konten terkini dari sebuah *cell*. *value* dibolehkan ``NULL``. *cell* harus non-``NULL``. Jika bukan objek sel, ``-1`` akan dikembalikan. Ketika berhasil, ``0`` akan dikembalikan.

source: Sets the value of the cell object *cell* to *value*. No reference counts are adjusted, and no checks are made for safety; *cell* must be non-``NULL`` and must be a cell object.
id: Mengatur nilai dari objek sel *cell* ke *value*. Tidak ada hitungan referensi yang diatur, dan tidak ada pengecekan untuk keamanan;*cell* harus non-``NULL`` dan harus merupakan sebuah objek sel.
