Repository: python/python-docs-id
Catalog: python-newest.tutorial--appetite/*.po
Languages: id

source: Whetting Your Appetite
id: Membangkitkan Selera Anda

source: If you do much work on computers, eventually you find that there's some task you'd like to automate. For example, you may wish to perform a search-and-replace over a large number of text files, or rename and rearrange a bunch of photo files in a complicated way. Perhaps you'd like to write a small custom database, or a specialized GUI application, or a simple game.
id: Jika Anda melakukan banyak pekerjaan pada komputer, pada akhirnya Anda menemukan bahwa ada beberapa tugas yang ingin Anda lakukan secara otomatis. Misalnya, Anda mungkin ingin melakukan pencarian-dan-ganti dari sejumlah besar berkas teks, atau ganti nama dan atur ulang banyak file foto dengan cara yang rumit. Mungkin Anda ingin menulis basis data khusus kecil, atau aplikasi GUI khusus, atau permainan sederhana.

source: If you're a professional software developer, you may have to work with several C/C++/Java libraries but find the usual write/compile/test/re-compile cycle is too slow. Perhaps you're writing a test suite for such a library and find writing the testing code a tedious task. Or maybe you've written a program that could use an extension language, and you don't want to design and implement a whole new language for your application.
id: Jika Anda seorang pengembang perangkat lunak profesional, Anda mungkin harus bekerja dengan beberapa pustaka C/C++ /Java tetapi menemukan siklus penulisan/kompilasi/pengujian/kompilasi ulang yang biasa terlalu lambat. Mungkin Anda sedang menulis serangkaian pengujian untuk pustaka seperti itu dan menemukan menulis kode pengujian tugas yang membosankan. Atau mungkin Anda telah menulis sebuah program yang dapat menggunakan bahasa ekstensi, dan Anda tidak ingin merancang dan mengimplementasikan bahasa yang sama sekali baru untuk aplikasi Anda.

source: Python is just the language for you.
id: Python adalah bahasa yang sesuai untuk Anda.

source: You could write a Unix shell script or Windows batch files for some of these tasks, but shell scripts are best at moving around files and changing text data, not well-suited for GUI applications or games. You could write a C/C++/Java program, but it can take a lot of development time to get even a first-draft program. Python is simpler to use, available on Windows, Mac OS X, and Unix operating systems, and will help you get the job done more quickly.
id: Anda bisa menulis skrip Unix *shell* atau berkas *batch* Windows untuk beberapa tugas ini, tetapi skrip *shell* paling baik untuk bergerak di sekitar berkas dan mengubah data teks, tidak cocok untuk aplikasi atau game GUI. Anda bisa menulis program C/C++/Java, tetapi mungkin butuh banyak waktu pengembangan untuk mendapatkan bahkan program draft pertama. Python lebih mudah digunakan, tersedia di sistem operasi Windows, Mac OS X, dan Unix, dan akan membantu Anda menyelesaikan pekerjaan dengan lebih cepat.

source: Python is simple to use, but it is a real programming language, offering much more structure and support for large programs than shell scripts or batch files can offer. On the other hand, Python also offers much more error checking than C, and, being a *very-high-level language*, it has high-level data types built in, such as flexible arrays and dictionaries. Because of its more general data types Python is applicable to a much larger problem domain than Awk or even Perl, yet many things are at least as easy in Python as in those languages.
id: Python mudah digunakan, tetapi ini adalah bahasa pemrograman nyata, menawarkan lebih banyak struktur dan dukungan untuk program besar daripada skrip *shell* atau berkas *batch* dapat tawarkan. Di sisi lain, Python juga menawarkan pemeriksaan kesalahan jauh lebih banyak daripada C, dan, karena *bahasa tingkat sangat tinggi*, ia memiliki tipe data tingkat tinggi yang tertanam di dalamnya, seperti *arrays* dan *dictionary* yang fleksibel. Karena tipe datanya yang lebih umum, Python dapat diterapkan pada domain masalah yang jauh lebih besar daripada Awk atau bahkan Perl, namun banyak hal yang setidaknya semudah dalam Python seperti pada bahasa-bahasa tersebut.

source: Python allows you to split your program into modules that can be reused in other Python programs. It comes with a large collection of standard modules that you can use as the basis of your programs --- or as examples to start learning to program in Python. Some of these modules provide things like file I/O, system calls, sockets, and even interfaces to graphical user interface toolkits like Tk.
id: Python memungkinkan Anda untuk membagi program Anda menjadi modul yang dapat digunakan kembali dalam program Python lainnya. Muncul dengan koleksi besar modul standar yang dapat Anda gunakan sebagai dasar program Anda --- atau sebagai contoh untuk mulai belajar memprogram dengan Python. Beberapa modul ini menyediakan hal-hal seperti berkas I/O, panggilan sistem, soket, dan bahkan antarmuka ke *toolkit* antarmuka pengguna grafis seperti Tk.

source: Python is an interpreted language, which can save you considerable time during program development because no compilation and linking is necessary. The interpreter can be used interactively, which makes it easy to experiment with features of the language, to write throw-away programs, or to test functions during bottom-up program development. It is also a handy desk calculator.
id: Python adalah bahasa yang ditafsirkan, yang dapat menghemat waktu Anda selama pengembangan program karena tidak diperlukan kompilasi dan penautan. *interpreter* dapat digunakan secara interaktif, yang membuatnya mudah untuk bereksperimen dengan fitur-fitur bahasa, untuk menulis *throw-away programs*, atau untuk menguji fungsi selama pengembangan program *bottom-up*. Ini juga merupakan kalkulator meja yang berguna.

source: Python enables programs to be written compactly and readably. Programs written in Python are typically much shorter than equivalent C, C++, or Java programs, for several reasons:
id: Python memungkinkan program ditulis secara ringkas dan mudah dibaca. Program yang ditulis dengan Python biasanya jauh lebih pendek daripada program C, C++, atau Java yang setara, karena beberapa alasan:

source: the high-level data types allow you to express complex operations in a single statement;
id: tipe data tingkat tinggi memungkinkan Anda untuk mengekspresikan operasi yang kompleks dalam satu pernyataan;

source: statement grouping is done by indentation instead of beginning and ending brackets;
id: pengelompokan pernyataan dilakukan dengan indentasi alih-alih tanda kurung kurawal di awal dan akhir;

source: no variable or argument declarations are necessary.
id: tidak ada deklarasi variabel atau argumen yang diperlukan.

source: Python is *extensible*: if you know how to program in C it is easy to add a new built-in function or module to the interpreter, either to perform critical operations at maximum speed, or to link Python programs to libraries that may only be available in binary form (such as a vendor-specific graphics library). Once you are really hooked, you can link the Python interpreter into an application written in C and use it as an extension or command language for that application.
id: Python bersifa *extensible*: jika Anda tahu cara memprogram dalam C, mudah untuk menambahkan fungsi atau modul bawaan baru ke *interpreter*, baik untuk melakukan operasi kritis dengan kecepatan maksimum, atau untuk menautkan program Python ke perpustakaan yang mungkin hanya tersedia dalam bentuk biner (seperti pustaka grafik spesifik vendor). Setelah Anda benar-benar ketagihan, Anda dapat menautkan juru bahasa Python ke dalam aplikasi yang ditulis dalam C dan menggunakannya sebagai ekstensi atau bahasa perintah untuk aplikasi itu.

source: By the way, the language is named after the BBC show "Monty Python's Flying Circus" and has nothing to do with reptiles. Making references to Monty Python skits in documentation is not only allowed, it is encouraged!
id: Ngomong-ngomong, bahasa tersebut dinamai menurut acara BBC "Sirkus Terbang Monty Python" dan tidak ada hubungannya dengan reptil. Membuat referensi ke sandiwara Monty Python dalam dokumentasi tidak hanya diizinkan, tetapi juga dianjurkan!

source: Now that you are all excited about Python, you'll want to examine it in some more detail. Since the best way to learn a language is to use it, the tutorial invites you to play with the Python interpreter as you read.
id: Sekarang Anda semua bersemangat tentang Python, Anda akan ingin memeriksanya lebih terinci. Karena cara terbaik untuk belajar bahasa adalah menggunakannya, tutorial mengundang Anda untuk bermain dengan *interpreter* Python saat Anda membaca.

source: In the next chapter, the mechanics of using the interpreter are explained. This is rather mundane information, but essential for trying out the examples shown later.
id: Dalam bab selanjutnya, mekanisme penggunaan *interpreter* dijelaskan. Ini adalah informasi yang biasa saja, tetapi penting untuk mencoba contoh yang ditunjukkan nanti.

source: The rest of the tutorial introduces various features of the Python language and system through examples, beginning with simple expressions, statements and data types, through functions and modules, and finally touching upon advanced concepts like exceptions and user-defined classes.
id: Sisa tutorial ini memperkenalkan berbagai fitur bahasa dan sistem Python melalui contoh, dimulai dengan ekspresi sederhana, pernyataan dan tipe data, melalui fungsi dan modul, dan akhirnya menyentuh konsep-konsep lanjutan seperti pengecualian dan kelas yang ditentukan pengguna.
